{
  "0": {
    "cast": [
      "Christian Bale as Bruce Wayne / Batman", 
      "Michael Caine as Alfred Pennyworth", 
      "Liam Neeson as Henri Ducard / Ra's al Ghul", 
      "Katie Holmes as Rachel Dawes", 
      "Gary Oldman as James Gordon"
    ], 
    "critical_response": [
      "being both comic-book archetypes and real people", 
      "comfortably mix the tormented drama and revenge motifs with light hearted gags and comic book allusions,'s who sign up to make them, have no evident motive beyond their own aggrandizement.", 
      "hype about exploring Batman's damaged psyche", 
      "both the menace and the wit he showed in his brilliant turn in American Psycho"
    ], 
    "director": "Christopher Nolan", 
    "genre": "SuperHero", 
    "introduction": "Batman Begins is a 2005 superhero film based on the DC Comics character Batman, directed by Christopher Nolan and written by Nolan and David S. Goyer. It stars Christian Bale, Michael Caine, Liam Neeson, Katie Holmes, Gary Oldman, Cillian Murphy, Tom Wilkinson, Rutger Hauer, Ken Watanabe, and Morgan Freeman. The film reboots the Batman film series, telling the origin story of Bruce Wayne from the death of his parents to his journey to become Batman and his fight to stop Ra's al Ghul and the Scarecrow from plunging Gotham City into chaos.", 
    "movieName": "Batman Begins", 
    "rating": [
      "Rotten Tomatoes: 84% and average: 7.7/10", 
      "Metacritic Score: 70/100", 
      "CinemaScore: A"
    ], 
    "year": "2005"
  }, 
  "1": "As a child, Bruce Wayne falls down into a dry well and is attacked by a swarm of bats, subsequently developing a phobia of the creatures. While watching an opera with his parents, Thomas and Martha, Bruce becomes frightened by performers masquerading as bats and asks to leave. Outside, mugger Joe Chill murders Bruce's parents in front of him. Orphaned, Bruce is raised by the family butler, Alfred Pennyworth. ", 
  "2": "Fourteen years later, Chill is freed in exchange for testifying against Gotham City mafia boss Carmine Falcone. Bruce intends to murder Chill, but one of Falcone's assassins does so first. Bruce's childhood friend, assistant district attorney Rachel Dawes, berates him for attempting to undermine the justice system, saying that his father would be ashamed. Bruce confronts Falcone, who tells him that real power comes from being feared. Bruce decides to travel the world and learn how to confront injustice. While serving a prison sentence for theft in Bhutan, he meets Henri Ducard, who trains him as a member of the League of Shadows, led by Ra's al Ghul. After completing his training and purging his fears, Bruce learns that the League intends to destroy Gotham, believing it to be corrupt, decadent, hypocritical and beyond saving. Bruce rejects the League's cause and burns down their temple during his escape. Ra's is killed by falling debris, while Bruce saves the unconscious Ducard. ", 
  "3": "Batman intercepts a drug shipment, provides Rachel with evidence against Falcone, and enlists Sergeant James Gordon, one of the few honest cops left in Gotham, to arrest him. In prison, Falcone meets with Dr. Jonathan Crane, a corrupt psychiatrist whom he has helped smuggle drugs into Gotham, and threatens to reveal his complicity if he does not declare him mentally unfit for trial. Crane puts on a scarecrow mask and sprays Falcone with a fear-inducing hallucinogen that drives him insane (which causes Falcone to constantly mouth the word 'Scarecrow'), and has him transferred to Arkham Asylum. While investigating 'the Scarecrow', Batman is exposed to the hallucinogen and left incapacitated. He is saved by Alfred and given an antidote developed by Fox. When Rachel accuses Crane of corruption, Crane reveals that he has been pouring his fear-inducing drug into Gotham's water supply. He drugs Rachel with it, but Batman saves her and subdues Crane, who claims to work for Ra's al Ghul. Batman evades the police to get Rachel to safety, administers the antidote, and gives her a vial of it for Gordon and another for mass production. Ducard reappears at Bruce's birthday party and reveals himself to be the true Ra's al Ghul. Having stolen a powerful microwave emitter from Wayne Enterprises, he plans to vaporize Gotham's water supply, rendering Crane's drug airborne and causing mass hysteria that will destroy the city. He sets Wayne Manor aflame and leaves Bruce to die, but Alfred rescues him. ", 
  "wikiDocumentIdx": 14
}