{
  "0": {
    "cast": [
      "Jim Carrey as Bruce Nolan", 
      "Morgan Freeman as God", 
      "Jennifer Aniston as Grace Connelly", 
      "Lisa Ann Walter as Debbie Connelly", 
      "Philip Baker Hall as Jack Baylor"
    ], 
    "critical_response": [
      "Carrey is hilarious in the slapstick scenes, but Bruce Almighty gets bogged down in treacle", 
      "In one of Jim Carrey's best films he plays Bruce Nolan, a news reporter that nurses hopes of one day becoming an anchor, but is seen as too comedic by his fellow workers. Kind of like Carrey probably nursed hopes of one day becoming a real actor."
    ], 
    "director": "Tom Shadyac", 
    "genre": "Comedy", 
    "introduction": "Bruce Almighty is a 2003 American high-concept comedy film directed by Tom Shadyac, written by Steve Koren, Mark O'Keefe and Steve Oedekerk and stars Jim Carrey as Bruce Nolan, a down-on-his-luck TV reporter who complains to God (Morgan Freeman) that he is not doing his job correctly, and is offered the chance to try being God himself for one week.", 
    "movieName": "Bruce Almighty", 
    "rating": [
      "Rotten Tomatoes:48% and average: 5.7/10", 
      "Metacritic Score: 46/100", 
      "CinemaScore: A"
    ], 
    "year": "2003"
  }, 
  "1": "Bruce Nolan (Jim Carrey) is a television field reporter for Eyewitness News at WKBW-TV in Buffalo, New York, but desires to be the news anchorman. He is in a relationship with his girlfriend Grace Connelly (Jennifer Aniston), but also has a mild crush on his co-worker, Susan Ortega (Catherine Bell), who barely seems to notice him. Bruce, however, suffers from constant bad luck and reaches breaking point when he is passed over for promotion by his rival, Evan Baxter (Steve Carell), who then steals dialogue from an unaired segment by Bruce while accepting the promotion on air. ", 
  "2": "Bruce also finds ways of using the powers to cause miraculous events to occur at otherwise mundane events that he covers, such as discovering the body of Jimmy Hoffa, earning him his job back, or causing a meteor to harmlessly land near a cook-off. Bruce then uses his powers to cause Evan to humiliate himself on air, causing Evan to be fired in favor of Bruce as the new anchor. After taking Grace to a fancy dinner and telling her about his promotion (disappointing her, as she thought he was going to propose), Bruce begins to hear voices in his head. He re-encounters God, who explains that the voices are prayers to God, and that Bruce must deal with them. Bruce creates an e-mail system to receive prayers and respond to them - but finds that the influx is far too great for him to handle, even with the use of his powers. So he sets the program to automatically answer 'Yes' to every prayer, thinking this will make everyone happy. ", 
  "3": "God appears and tells Bruce to pray for what he truly wants; Bruce prays for Grace to find a man that would make her happy. God agrees and Bruce finds himself in the hospital, shortly after being miraculously revived by the doctors. Grace arrives and the two reconcile. After his recovery, Bruce returns to his field of reporting, but takes more pleasure, in simple stories. Bruce and Grace announce their engagement on live television. The film ends with a homeless man holding a sign with philosophical messages that Bruce previously ran into on various occasions finally revealing himself to be God. ", 
  "wikiDocumentIdx": 15
}