{
  "0": {
    "cast": [
      "Ben Affleck as Bruce Wayne / Batman", 
      "Henry Cavill as Clark Kent / Superman", 
      "Amy Adams as Lois Lane", 
      "Jesse Eisenberg as Lex Luthor", 
      "Diane Lane as Martha Kent"
    ], 
    "critical_response": [
      " 153 minutes of a grown man whacking two dolls together, has the definition of 'movie' changed from 'motion picture story that a human wrote on purpose' to '700 only tangentially related 12-second grey and red vignettes ? ", 
      "The point of Batman v Superman isn't fun, and it isn't thinking, either. It's obedience. The theology is invoked ... to buttress a spectacle of power. And in that way the film serves as a metaphor for its own aspirations. The corporations that produce movies like this one, and the ambitious hacks who sign up to make them, have no evident motive beyond their own aggrandizement.", 
      " better than Man of Steel but below the high bar set by Nolan's Dark Knight ", 
      "As the film progresses, Lex degenerates into a gibbering mad man, some strange mix of the Riddler and the Joker with a little bit of Mark Zuckerberg added for flair."
    ], 
    "director": "Zack Snyder", 
    "genre": "SuperHero", 
    "introduction": "Batman v Superman: Dawn of Justice is a 2016 American superhero film featuring the DC Comics characters Batman and Superman. Directed by Zack Snyder, it is the second installment in the DC Extended Universe (DCEU), following 2013's Man of Steel. It was written by Chris Terrio and David S. Goyer, and features an ensemble cast that includes Ben Affleck, Henry Cavill, Amy Adams, Jesse Eisenberg, Diane Lane, Laurence Fishburne, Jeremy Irons, Holly Hunter, and Gal Gadot. Batman v Superman: Dawn of Justice is the first live-action film to feature Batman and Superman together, as well as the first live-action cinematic portrayal of Wonder Woman. In the film, criminal mastermind Lex Luthor (Eisenberg) manipulates Batman (Affleck) into a preemptive battle with Superman (Cavill), whom Luthor is obsessed with defeating.", 
    "movieName": "Batman vs Superman", 
    "rating": [
      "Rotten Tomatoes: 27% and average: 4.9/10", 
      "Metacritic Score: 44/100", 
      "CinemaScore: B"
    ], 
    "year": "2016"
  }, 
  "1": "Eighteen months after the battle between Superman and General Zod in Metropolis, Superman has become a controversial figure. Billionaire Bruce Wayne, who has operated in Gotham City as the vigilante Batman for two decades, sees Superman as an existential threat to humanity. After learning of Batman's form of justice, Clark Kent seeks to expose him via Daily Planet articles. Wayne learns that Russian weapon trafficker Anatoli Knyazev has been contacting LexCorp mogul Lex Luthor. Meanwhile, Luthor unsuccessfully tries to persuade Senator June Finch to allow him to import kryptonite retrieved from the Indian Ocean following Zod's terraforming attempt, claiming he wants to maintain it as a 'deterrent' against future Kryptonian threats. He instead makes alternative plans with Finch's subordinate and gains access to Zod's body and the Kryptonian scout ship. ", 
  "2": "Later, Luthor kidnaps Lois and Martha Kent, Clark's adoptive mother, to bring Superman out of exile. He reveals to him that he manipulated Superman and Batman by fueling their distrust for each other. Luthor demands that Superman kill Batman in exchange for Martha's life. Superman tries to explain the situation to Batman, but instead Batman fights Superman and eventually subdues him. Before Batman can kill him with the spear, Superman urges Batman to 'save Martha', whose name is also shared with Bruce's late mother, confusing him long enough for Lois to arrive and explain what Superman meant. Realizing how far he has fallen and unwilling to let an innocent die, Batman rescues Martha, while Superman confronts Luthor on the scout ship. ", 
  "3": "Luthor is arrested and Batman confronts him in prison, warning Luthor that he will always be watching him. Luthor gloats that Superman's death has made the world vulnerable to powerful alien threats. A memorial is held for Superman in Metropolis. Clark is also declared dead, with various friends and family members including Bruce Wayne and Diana Prince attending for him in Smallville. Martha gives an envelope to Lois, which contains an engagement ring from Clark. After the funeral, Bruce expresses his regrets to Diana about how he failed Superman. He reveals to her that he plans to form a team of metahumans, starting with those from Luthor's files, to help protect the world in Superman's absence. After they leave, the dirt atop Clark's coffin levitates. ", 
  "wikiDocumentIdx": 13
}