{
  "0": {
    "cast": [
      "Leonardo DiCaprio as Frank Abagnale, Jr.", 
      "Tom Hanks as Carl Hanratty", 
      "Christopher Walken as Frank Abagnale, Sr.", 
      "Nathalie Baye as Paula Abagnale.", 
      "Amy Adams as Brenda Strong"
    ], 
    "critical_response": [
      " This is not a major Spielberg film, although it is an effortlessly watchable one ", 
      "the range and ease and cleverness that Martin Scorsese so underutilized in Gangs of New York", 
      " Catch Me if You Can never takes itself or its subjects too seriously, and contains more genuinely funny material than about 90% of the so-called 'comedies' found in multiplexes these days ", 
      "bogged down over 140 minutes. A film that took off like a hare on speed ends like a winded tortoise."
    ], 
    "director": "Steven Spielberg", 
    "genre": "biographical, crime", 
    "introduction": "Catch Me If You Can is a 2002 American biographical crime film directed and co-produced by Steven Spielberg from a screenplay by Jeff Nathanson. The film is based on the life of Frank Abagnale, who, before his 19th birthday, successfully performed cons worth millions of dollars by posing as a Pan American World Airways pilot, a Georgia doctor and a Louisiana parish prosecutor. His primary crime was check fraud; he became so experienced that the FBI eventually turned to him for help in catching other checking forgers. The film stars Leonardo DiCaprio and Tom Hanks, with Christopher Walken, Martin Sheen, and Nathalie Baye in supporting roles.", 
    "movieName": "Catch me if you can", 
    "rating": [
      "Rotten Tomatoes: 96% and average: 7.9/10", 
      "Metacritic Score: 76/100", 
      "CinemaScore: A-"
    ], 
    "year": "2002"
  }, 
  "1": "In 1963, teenaged Frank Abagnale lives in New Rochelle, New York with his father Frank Abagnale, Sr., and French mother Paula. When Frank Sr. is denied a business loan at Chase Manhattan Bank due to unknown difficulties with the IRS, the family is forced to move from their large home to a small apartment. Paula carries on an affair with Jack, a friend of her husband. Meanwhile, Frank poses as a substitute teacher in his French class. Frank's parents file for divorce, and Frank runs away. When he runs out of money, he begins relying on confidence scams to get by. Soon, Frank's cons increase and he even impersonates an airline pilot. He forges Pan Am payroll checks and succeeds in stealing over $2.8 million. ", 
  "2": "The scene then flashes forward to a plane returning Frank home from prison, where Carl informs him that his father has died. Grief-stricken, Frank escapes from the plane and goes back to his old house, where he finds his mother with the man she left his father for, as well as a girl who Frank realizes is his half-sister. Frank gives himself up and is sentenced to 12 years in prison, getting visits from time to time from Carl. When Frank points out how one of the checks Carl is carrying as evidence is fake, Carl convinces the FBI to offer Frank a deal by which he can live out the remainder of his sentence working for the bank fraud department of the FBI, which Frank accepts. While working at the FBI, Frank misses the thrill of the chase and even attempts to fly as an airline pilot again. He is cornered by Carl, who insists that Frank will return to the FBI job since no one is chasing him. On the following Monday, Carl is nervous that Frank has not yet arrived at work. However, Frank eventually arrives and they discuss their next case. ", 
  "3": "The ending credits reveal that Frank has been happily married for 26 years, has three sons, lives in the Midwest, is still good friends with Carl, has caught some of the world's most elusive money forgers, and earns millions of dollars each year because of his work creating unforgeable checks. ", 
  "wikiDocumentIdx": 19
}