{
  "0": {
    "cast": [
      "Steve Carell as Gru, a mean supervillain", 
      "Jason Segel as Victor \"Vector\" Perkins, Mr. Perkins' son and Gru's archenemy", 
      "Russell Brand as Dr. Nefario, Gru's elderly gadget man and a friendly scientist"
    ], 
    "critical_response": [
      "Since villains so often steal the show in animation, Despicable Me smartly turns the whole operation over to megalomaniacal rogue Gru.", 
      "Despicable Me is a 3D cartoon comedy of whiplash-quick laughs, funny punch lines and a wickedly gimmicky appreciation for 3D.", 
      "Kids will dig it, adults will smile with amusement, and no one will be any different afterward than they were walking into the theater.", 
      "Short, sweet-and-sour, and amusing rather than funny, Despicable Me can't help but be likable.", 
      "It's no first-rank CGI cartoon, but shows how Pixar's quality over crass is inspiring the mid-list. Fun, with teary bits, for kids; fresh and smart for adults."
    ], 
    "director": "Pierre Coffin, Chris Renaud", 
    "genre": "Animation", 
    "introduction": "Despicable Me is a 2010 American 3D computer-animated comedy film from Universal Pictures and Illumination Entertainment that was released on July 9, 2010, in the United States. It is the debut film of Illumination Entertainment. The film was animated by the French animation studio Mac Guff, which was later acquired by Illumination Entertainment.[6] It was directed by Pierre Coffin and Chris Renaud as their feature debut film, with a story by Sergio Pablos. The title references the main character as he refers to himself, and is accompanied by a song by Pharrell.", 
    "movieName": "Despicable Me", 
    "rating": [
      "Rotten Tomatoes:81% and average: 6.8/10", 
      "Metacritic Score: 72/100", 
      "CinemaScore: A"
    ], 
    "year": "2010"
  }, 
  "1": "Gru, a supervillain, is disheartened when an unknown supervillain steals the Great Pyramid of Giza. Gru, with the assistance of his colleague Dr. Nefario and his Minions, resolves to one-up this mystery rival by shrinking and stealing the Moon. As it would be costly to steal the moon, Gru seeks a loan from the Bank of Evil. Bank president Mr. Perkins is impressed by the plan but will provide the money only if Gru can obtain the necessary shrink ray first. Upon learning that an up-and-coming villain named Vector was responsible for the pyramid theft, Gru starts a rivalry with him. ", 
  "2": "Eventually, Gru and the girls arrive at Vector's fortress, and Gru steals the shrink ray. The girls then suggest a day at a theme park; Gru agrees, believing he can abandon the girls there, but instead he warms up to them. Later, Gru contacts Perkins via video chat, stating that he finally has the shrink ray. Margo, Edith, and Agnes interrupt the meeting, and Perkins announces that he has lost confidence in Gru and will no longer fund his operations. As Gru tells the Minions he can no longer pay them for their services, the girls offer the contents of their piggy bank. Gru, inspired, sells parts of his lair to construct a spacecraft. Gru plans to steal the Moon when it is nearest the Earth, but this is the same day as the girls' ballet recital. Gru becomes conflicted, and Dr. Nefario, seeing the recital as interfering with the plan, arranges for the girls to be returned to the orphanage. At the same time, Perkins informs Vector, revealed to be Perkins' son, of Gru's possession of the shrink ray and the adoption of the three girls, encouraging Vector to act. ", 
  "3": "Gru successfully shrinks and steals the Moon, and rushes back to Earth to attend the recital only to find a ransom note from Vector, who has kidnapped the girls. After arriving at Vector's headquarters, Gru surrenders the Moon, but Vector reneges on the deal, flying off with the girls and the Moon. Meanwhile, Dr. Nefario has discovered that the effects of the shrink ray are temporary; the bigger the object's original size, the faster the shrinkage will wear off. As the Moon starts to expand in Vector's ship, Gru, Dr. Nefario, and the Minions execute a daring mid-air rescue of the girls just as the Moon explodes out of Vector's ship and launches itself back into orbit, with Vector trapped on it. ", 
  "wikiDocumentIdx": 16
}