{
  "0": {
    "cast": [
      "Fionn Whitehead as Tommy, a British Army private", 
      "Whitehead was cast in the lead after a secretive auditioning process lasting several months. His character was named after the slang term for the ordinary British soldier.", 
      "Tom Glynn-Carney as Peter, Mr Dawson's son", 
      "Jack Lowden as Collins, a Royal Air Force Spitfire pilot", 
      "Harry Styles as Alex, a private in the Argyll and Sutherland Highlanders", 
      "Styles won the role after auditioning against hundreds of candidates, when Nolan was unaware of his renown as a singer.", 
      "Aneurin Barnard as \"Gibson\", a French soldier masquerading as a British Army private."
    ], 
    "critical_response": [
      "surrounds his audience with chaos and horror from the outset, and amazing images and dazzlingly accomplished set pieces on a huge 70mm screen, particularly the pontoon crammed with soldiers extending into the churning sea, exposed to enemy aircraft", 
      "an impressionist masterpiece' that was 'deeply moving' but without 'manufactured sentimentality or false heroics.", 
      "There's little doubt that [Nolan] has, without sentimentality or sanctimony, raised that genre to the level of art...with the resonant force of an enduring screen classic.", 
      " 'tight, gripping, deeply involving and unforgettable ... triumph in filmmaking", 
      " '[Dunkirk] is 106 clamorous minutes of big-screen bombast that's so concerned with its own spectacle and scale that it neglects to deliver the most crucial element drama."
    ], 
    "director": "Christopher Nolan", 
    "genre": "War", 
    "introduction": "Dunkirk is a 2017 war film written, directed, and co-produced by Christopher Nolan that depicts World War II's Dunkirk evacuation. Dunkirk portrays the evacuation from three perspectives: land, sea, and air. It has little dialogue, since Nolan sought to create suspense from cinematography and music. Filming began in May 2016 in Dunkirk and ended that September in Los Angeles, when post-production began. Cinematographer Hoyte van Hoytema shot the film on IMAX 65 mm and 65 mm large format film stock. Dunkirk has extensive practical effects, using thousands of extras, boats that participated in the evacuation, and period aeroplanes.", 
    "movieName": "Dunkirk", 
    "rating": [
      "Rotten Tomatoes: 92% and average: 8.6/10", 
      "Metacritic Score: 94/100", 
      "CinemaScore: A-"
    ], 
    "year": "2017"
  }, 
  "1": "In 1940, during the fall of France, hundreds of thousands of Allied soldiers have retreated to Dunkirk. Tommy, a young British private, is the sole survivor of a German ambush. At the beach, he finds thousands of troops awaiting evacuation and meets Gibson, who is burying a body. After a German dive-bomber attack, they find a wounded man. They rush his stretcher onto a hospital ship, but are denied passage themselves. The ship is sunk by dive-bombers; Tommy saves Alex, another soldier. They leave at night on a destroyer, which is sunk by a torpedo from a U-Boat. Gibson saves Tommy and Alex, and they are brought ashore by a rowing boat. The British navy requisitions civilian vessels that can get close to the beach. In Weymouth, Mr. Dawson and his son Peter set out on his boat Moonstone rather than let the navy take it. Impulsively, their teenage friend George joins them. At sea, they rescue a shell-shocked officer from a wrecked ship. When he realises that Dawson is sailing for Dunkirk, the officer demands that they turn back, and tries to wrest control of the boat; in the struggle, George suffers a head injury that renders him blind. ", 
  "2": "Tommy, Alex and Gibson join a group of Scottish soldiers and hide inside a trawler until the tide rises. Its owner, a Dutch mariner, returns. German troops shoot at the boat for target practice; when the tide rises, water enters through the bullet holes. Alex, hoping to lighten the boat's load, accuses Gibson, who has been silent, of being a spy and demands that he leave. Gibson reveals he is French; he had stolen the identity of the soldier he buried, hoping to evacuate with the British. Alex, Tommy and the Scottish soldiers abandon the fishing boat when it begins to sink. Gibson is entangled in a chain and drowns. Alex and Tommy swim towards a nearby destroyer, but it is sunk by a bomber. The Moonstone manoeuvres to take on troops, including Alex and Tommy. Peter realises that George is dead; when asked by the shell-shocked officer, he lies that George will be fine. Farrier shoots down the bomber, which crashes and ignites the oil slick from the sinking destroyer. Peter reveals to Collins that his elder brother was a Hurricane pilot, killed early in the war.  ", 
  "3": "At the beach, Commander Bolton watches the last British soldiers leave. He confirms that 300,000 have been evacuated, ten times more than estimated. He remains to oversee the evacuation of the French rearguard. Alex and Tommy cross the English Channel and board a train in Weymouth. Dawson is congratulated for having saved so many men. The shell-shocked officer sees George's body being carried away. Peter visits the local newspaper with a photograph of George; a front-page article later commends George as a hero. Alex expects public scorn as the train approaches Woking, but they receive a hero's welcome. Tommy reads out Winston Churchill's address to the nation from a newspaper. ", 
  "wikiDocumentIdx": 9
}