{
  "0": {
    "cast": [
      "Macaulay Culkin as Kevin", 
      "Joe Pesci as Harry", 
      "Daniel Stern as Marv", 
      "John Heard as Peter", 
      "Roberts Blossom as Marley"
    ], 
    "critical_response": [
      "the film's first half is 'flat and unsurprising as its cute little premise suggests', the second half is praised for its slapstick humor. The conversation between Kevin and Marley, as well as the film's final scenes, is also praised.", 
      "He compared the elaborate booby-traps in the film to Rube Goldberg machines, writing 'they're the kinds of traps that any 8-year-old could devise, if he had a budget of tens of thousands of dollars and the assistance of a crew of movie special effects people' and criticized the plot as 'so implausible that it makes it hard for [him] to really care about the plight of the kid [Kevin]", 
      "sadistic festival of adult-bashing'. ", 
      "[John] Hughes is pulling our strings as though he'd never learn to do anything else"
    ], 
    "director": "Chris Columbus", 
    "genre": "Comedy", 
    "introduction": "Home Alone is a 1990 American comedy film written and produced by John Hughes and directed by Chris Columbus. The film stars Macaulay Culkin as Kevin McCallister, a boy who is mistakenly left behind when his family flies to Paris for their Christmas vacation. Kevin initially relishes being home alone, but soon has to contend with two would-be burglars played by Joe Pesci and Daniel Stern. The film also features Catherine O'Hara and John Heard as Kevin's parents.", 
    "movieName": "Home Alone", 
    "rating": [
      "Rotten Tomatoes: 62% and average: 5.5/10", 
      "Metacritic Score: 63/100", 
      "CinemaScore: A"
    ], 
    "year": "1990"
  }, 
  "1": "The McCallister family is preparing to spend Christmas in Paris, gathering at Peter and Kate's home outside of Chicago on the night before their departure. Peter and Kate's youngest son, eight-year-old Kevin, is being ridiculed by his siblings and cousins. A fight with his older brother, Buzz, results in Kevin getting sent to the third floor of the house for punishment, where he wishes that his family would disappear. During the night, heavy winds cause damage to power lines, which causes a temporary power outage and resets the alarm clocks, causing the entire family to oversleep. In the confusion and rush to get to the airport, Kevin is accidentally left behind. ", 
  "2": "Kate discovers mid-flight that Kevin is missing and, upon arrival in Paris, the family discovers that all flights for the next two days are booked. Peter and the rest of the family go to his brother Rob's apartment in the city while Kate manages to get a flight back to the United States, only to get as far as Scranton, Pennsylvania. She attempts to book a flight to Chicago but again, everything is booked. Unable to accept this, Kate is overheard by Gus Polinski, the lead member of a traveling polka band, who offers to let her travel with them to Chicago on their way to Milwaukee in a moving van, which she graciously accepts. ", 
  "3": "Kevin returns home and rigs the house with numerous booby traps. Harry and Marv break in, spring the traps, and suffer various injuries. While the duo pursues Kevin around the house, he calls the police and flees the house, luring the duo into a neighboring vacant home. Harry and Marv manage to catch him and discuss how they will get their revenge, but Marley sneaks in and knocks them unconscious with his snow shovel before they can do anything to Kevin. The police arrive and arrest Harry and Marv, having identified all the houses they burgled due to the latter's habit of flooding them. On Christmas Day, Kevin is disappointed to find that his family is still gone. He then hears Kate enter the house and call for him; they reconcile and are soon joined by the rest of the McCallisters, who waited in Paris until they could get a direct flight to Chicago. Kevin keeps silent about his encounter with Harry and Marv, although Peter finds Harry's missing gold tooth. Kevin then observes Marley reuniting with his son and his family. Marley notices Kevin and the pair wave to each other before Marley and his family go inside his house. Buzz suddenly calls out, 'Kevin, what did you do to my room?!' at which point Kevin runs off. ", 
  "wikiDocumentIdx": 20
}