{
  "0": {
    "cast": [
      "Jay Baruchel as Hiccup Horrendous Haddock III: companion of Toothless, a Night Fury.", 
      "Gerard Butler as Stoick the Vast, the chieftain of the Viking tribe and Hiccup's father.", 
      "Craig Ferguson as Gobber the Belch: blacksmith, a close friend of Stoick's, and training master of the young warriors.", 
      "America Ferrera as Astrid Hofferson, Hiccup's fellow student."
    ], 
    "critical_response": [
      "It devotes a great deal of time to aerial battles between tamed dragons and evil ones, and not much to character or story development. But it's bright, good-looking, and has high energy", 
      "It's a thrilling action-adventure saga with exhilarating 3-D animation, a clever comedy with witty dialogue, a coming-of-age tale with surprising depth and a sweetly poignant tale of friendship between man and animal.", 
      "more coming-of-age dramedy or 'everything about your world view is wrong' message movie than it is a comedy, and that seems like a waste of a funny book, some very funny actors and some darned witty animation.", 
      "Technically proficient and featuring a witty, intelligent, surprisingly insightful script, How to Train Your Dragon comes close to the level of Pixar's recent output while easily exceeding the juvenilia DreamWorks has released in the last nine years.", 
      "How to Train Your Dragon rouses you in conventional ways, but it's also the rare animated film that uses 3-D for its breathtaking spatial and emotional possibilities."
    ], 
    "director": "Chris Sanders, Dean DeBlois", 
    "genre": "animation, fantasy", 
    "introduction": "How to Train Your Dragon is a 2010 American 3D computer-animated action-fantasy film produced by DreamWorks Animation and distributed by Paramount Pictures.1 Loosely based on the British book series of the same name by Cressida Cowell, the film was directed by Chris Sanders and Dean DeBlois, the duo who directed Disney's Lilo & Stitch. It stars the voices of Jay Baruchel, Gerard Butler, Craig Ferguson, America Ferrera, Jonah Hill, T.J. Miller, Kristen Wiig, and Christopher Mintz-Plasse.", 
    "movieName": "How to Train Your Dragon", 
    "rating": [
      "Rotten Tomatoes: 98% and average: 7.9/10", 
      "Metacritic Score: 74/100", 
      "CinemaScore: A"
    ], 
    "year": "2010"
  }, 
  "1": "The Isle of Berk is a remote Viking village, from which dragons periodically steal livestock. Hiccup, the awkward fifteen-year-old son of the village chieftain, Stoick the Vast, is too small to fight the dragons and instead fashions mechanical devices under his apprenticeship with Gobber the blacksmith, though his inventions often backfire. During one attack, Hiccup believes he has shot down a Night Fury, an extremely rare and dangerous dragon. Hiccup later finds it in the forest trapped in his bolas, but finds that he cannot bring himself to kill the dragon and instead sets it free. ", 
  "2": "Stoick assembles a fleet to find the dragons' nest, leaving Hiccup in a dragon-fighting class taught by Gobber. Hiccup returns to the forest to find the Night Fury still there, and realizes it is unable to fly properly because of its crippled caudal fin. Hiccup gradually tames the dragon and gives it the name 'Toothless', for its retractable teeth. Hiccup makes a harness and prosthetic fin that allows him to guide the dragon in free flight. By studying Toothless's behavior, Hiccup becomes proficient in subduing the captive dragons during training. Stoick's fleet arrives home unsuccessful, but he is cheered by Hiccup's unexpected success. ", 
  "3": "Back at the village, Hiccup subdues a captive dragon in his final training test in front of his father instead of killing it, but Stoick inadvertently angers the dragon into attacking. Toothless attempts to protect Hiccup in the ensuing panic but is instead captured by the Vikings. Hiccup accidentally reveals to Stoick that Toothless is capable of locating the dragons' nest. Stoick disowns his son and sets off for the nest with Toothless chained to the lead ship as a guide. The Vikings expel most of the dragons but are overwhelmed by the Red Death until Hiccup, Astrid and their fellow pupils fly in riding the training dragons from the academy and provide cover fire. Hiccup almost drowns trying to break Toothless free from a sinking ship but Stoick saves them both and then reconciles with his son. Toothless and Hiccup destroy the Red Death but Hiccup is injured in the fight. Hiccup regains consciousness on Berk where his lower left leg has been replaced by a prosthesis, and the Vikings and the dragons now live in harmony. ", 
  "wikiDocumentIdx": 10
}