{
  "0": {
    "cast": [
      "Benedict Cumberbatch as Alan Turing", 
      "Keira Knightley as Joan Clarke", 
      "Matthew Goode as Hugh Alexander", 
      "Tom Goodman-Hill as Sgt. Staehl"
    ], 
    "critical_response": [
      "one of the most important stories of the last century is one of the greatest movies of 2014", 
      "Empire described it as a 'superb thriller' and Glamour declared it 'an instant classic'.", 
      "Peter Debruge of Variety added that the film is 'beautifully written, elegantly mounted and poignantly performed'.", 
      "movie is undeniably strong in its sense of a bright light burned out too soon, and the often undignified fate of those who dare to chafe at society's established norms", 
      "The Hollywood Reporter reported that the highlight of the film was Cumberbatch, 'whose charisma, tellingly modulated and naturalistic array of eccentricities, talent at indicating a mind never at rest and knack for simultaneously portraying physical oddness and attractiveness combine to create an entirely credible portrait of genius at work", 
      "I discovered that The Imitation Game takes major liberties with its source material, injecting conflict where none existed, inventing entirely fictional characters, rearranging the chronology of events, and misrepresenting the very nature of Turing's work at Bletchley Park'.", 
      "Andrew Grant of Science News wrote, '... like so many other Hollywood biopics, it takes some major artistic license   which is disappointing, because Turing's actual story is so compelling. "
    ], 
    "director": "Morten Tyldum", 
    "genre": "Drama, biopic", 
    "introduction": "The Imitation Game is a 2014 American historical drama film directed by Morten Tyldum and written by Graham Moore, loosely based on the biography Alan Turing: The Enigma by Andrew Hodges (which was previously adapted as the stage play and BBC drama Breaking the Code). It stars Benedict Cumberbatch as real-life British cryptanalyst Alan Turing, who decrypted German intelligence codes for the British government during the Second World War. Keira Knightley, Matthew Goode, Rory Kinnear, Charles Dance and Mark Strong also star.", 
    "movieName": "Imitation Game", 
    "rating": [
      "Rotten Tomatoes: 91% and average: 7.7/10", 
      "Metacritic Score: 73/100", 
      "CinemaScore: A+"
    ], 
    "year": "2014"
  }, 
  "1": "In 1951, two policemen, Nock and Staehl, investigate the mathematician Alan Turing after an apparent break-in at his home. During his interrogation by Nock, Turing tells of his time working at Bletchley Park. In 1927, the young Turing is unhappy and bullied at boarding school. He develops a friendship with Christopher Morcom, who sparks his interest in cryptography, and Turing develops romantic feelings for him. Before Turing can confess his love, Christopher dies unexpectedly from tuberculosis. When Britain declares war on Germany in 1939, Turing travels to Bletchley Park, where, under the direction of Commander Alastair Denniston, he joins the cryptography team of Hugh Alexander, John Cairncross, Peter Hilton, Keith Furman and Charles Richards. The team are trying to decrypt the Enigma machine, which the Nazis use to send coded messages. ", 
  "2": "Turing s machine, which he names Christopher, is constructed, but cannot determine the Enigma settings before the Germans reset the Enigma encryption each day. Denniston orders it destroyed and Turing fired, but the other cryptographers threaten to leave if Turing goes. After Clarke plans to leave on the wishes of her parents, Turing proposes marriage, which she accepts. During their reception, Turing confirms his homosexuality to Cairncross, who warns him to keep it secret. After overhearing a conversation with a female clerk about messages she receives, Turing has an epiphany, realising he can program the machine to decode words he already knows exist in certain messages. After he recalibrates the machine, it quickly decodes a message and the cryptographers celebrate; however, Turing realises they cannot act on every decoded message or the Germans will realise Enigma has been broken. ", 
  "3": "Turing discovers that Cairncross is a Soviet spy. When Turing confronts him, Cairncross argues that the Soviets are allies working for the same goals, and threatens to retaliate by disclosing Turing s homosexuality if his role as an agent is revealed. When the MI6 agent Stewart Menzies appears to threaten Clarke, Turing reveals that Cairncross is a spy. Menzies reveals he knew this already, and planted Cairncross among them in order to leak messages to the Soviets for British benefit. Fearing for her safety, Turing tells Clarke to leave Bletchley Park, revealing that he is gay and lying about never having cared for her. After the war, Menzies tells the cryptographers to destroy their work and that they can never see one another again or share what they have done. ", 
  "wikiDocumentIdx": 1
}