{
  "0": {
    "cast": [
      "Robert Downey Jr. as Tony Stark/Iron Man, an industrialist, genius inventor, and consummate playboy, he is CEO of Stark Industries and a chief weapons manufacturer for the U.S. military.", 
      "Terrence Howard as James \"Rhodey\" Rhodes, a friend of Stark's, and the liaison between Stark Industries and the United States Air Force in the department of acquisitions, specifically weapons development. ", 
      "Jeff Bridges as Obadiah Stane, Stark's business second-in-command, mentor and friend who turns on him to overtake the company, eventually building a giant exosuit to fight Stark. ", 
      "Shaun Toub as Yinsen, Stark's fellow captive, who grafts an electromagnet to Stark's chest \"to keep the shrapnel shell shards that wounded him from reaching his heart and killing him\", and who helps Stark build the first Iron Man suit.", 
      "Gwyneth Paltrow as Pepper Potts, Stark's personal assistant and budding love interest."
    ], 
    "critical_response": [
      "expansively entertaining special effects extravaganza' with 'fresh energy and stylistic polish", 
      "impressive sets and mechanics that combine smoothly with relatively seamless CG", 
      "a shapely piece of mythmaking [...] Favreau doesn't go in for stylized comic-book frames, at least in the first half. He gets real with it   you'd think you were watching a military thriller", 
      "a slightly depressed, going-through-the-motions feel to the entire show [...] Gwyneth Paltrow, widening her eyes and palpitating, can't do much with an antique role as Stark's girl Friday, who loves him but can't say so; Terrence Howard, playing a military man who chases around after Stark, looks dispirited and taken for granted"
    ], 
    "director": "Jon Favreau", 
    "genre": "SuperHero", 
    "introduction": "Iron Man is a 2008 American superhero film based on the Marvel Comics character of the same name, produced by Marvel Studios and distributed by Paramount Pictures.1 It is the first film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Favreau, with a screenplay by the writing teams of Mark Fergus and Hawk Ostby and Art Marcum and Matt Holloway. It stars Robert Downey Jr. as Tony Stark / Iron Man, alongside Terrence Howard, Jeff Bridges, Shaun Toub, and Gwyneth Paltrow. In Iron Man, Tony Stark, an industrialist and master engineer, builds a powered exoskeleton and becomes the technologically advanced superhero Iron Man", 
    "movieName": "Iron Man", 
    "rating": [
      "Rotten Tomatoes: 94% and average: 7.7/10", 
      "Metacritic Score: 79/100", 
      "CinemaScore: A"
    ], 
    "year": "2008"
  }, 
  "1": "Genius, billionaire, and playboy Tony Stark, who has inherited the defense contractor Stark Industries from his father, is in war-torn Afghanistan with his friend and military liaison Lieutenant Colonel James Rhodes to demonstrate the new 'Jericho' missile. After the demonstration, the convoy is ambushed and Stark is critically wounded by one of his own company's rocket-propelled grenades. He is captured and imprisoned in a cave by a terrorist group, the Ten Rings; Yinsen, a fellow captive who is a doctor, implants an electromagnet into Stark's chest to keep the shrapnel shards that wounded him from reaching his heart and killing him. Ten Rings leader Raza offers Stark freedom in exchange for building a Jericho missile for the group, but Tony and Yinsen know that Raza will not keep his word. ", 
  "2": "At a charity event held by Stark Industries, reporter Christine Everhart informs Stark that his company's weapons, including the Jericho, were recently delivered to the Ten Rings and are being used to attack Yinsen's home village, Gulmira. Stark then learns that Stane has been arms trafficking to criminals worldwide, and is staging a coup to replace him as Stark Industries' CEO. Stark dons his new armor and flies to Afghanistan, where he saves the villagers. While flying home, Stark is shot at by two F-22 Raptor fighter jets. He reveals his secret identity to Rhodes over the phone in an attempt to end the attack. Meanwhile, the Ten Rings gather the pieces of Stark's prototype suit and meet with Stane, who subdues Raza and has the rest of the group killed. Stane has a massive new suit reverse engineered from the wreckage. Seeking to track his company's illegal shipments, Stark sends Pepper to hack into its database. She discovers Stane hired the Ten Rings to kill Stark, but the group reneged. Potts meets with Agent Phil Coulson of S.H.I.E.L.D., an intelligence agency, to inform him of Stane's activities. ", 
  "3": "Stane's scientists cannot duplicate Stark's miniaturized arc reactor, so Stane ambushes Stark at his home and takes the one from his chest. Stark manages to get to his original reactor to replace it. Potts and several S.H.I.E.L.D. agents attempt to arrest Stane, but he dons his suit and attacks them. Stark fights Stane, but is outmatched without his new reactor to run his suit at full capacity. The fight carries Stark and Stane to the top of the Stark Industries building, and Stark instructs Potts to overload the large arc reactor powering the building. This unleashes a massive electrical surge that causes Stane and his armor to fall into the exploding reactor, killing him. The next day, at a press conference, Stark defies suggestions from S.H.I.E.L.D. and publicly admits to being the superhero the press has dubbed 'Iron Man'. ", 
  "wikiDocumentIdx": 21
}