{
  "0": {
    "cast": [
      "Roy Scheider as Chief Martin Brody", 
      "Robert Shaw as Quint", 
      "Richard Dreyfuss as Matt Hooper", 
      "Lorraine Gary as Ellen Brody"
    ], 
    "critical_response": [
      "a sensationally effective action picture, a scary thriller that works all the better because it's populated with characters that have been developed into human beings", 
      "the most cheerfully perverse scare movie ever made ... [with] more zest than an early  picture, a lot more electricity, [and] it's funny in a Woody Allen sort of way", 
      "Spielberg is blessed with a talent that is absurdly absent from most American filmmakers these days: this man actually knows how to tell a story on screen. ... It speaks well of this director's gifts that some of the most frightening sequences in Jaws are those where we don't even see the shark.", 
      "It's a measure of how the film operates that not once do we feel particular sympathy for any of the shark's victims. ... In the best films, characters are revealed in terms of the action. In movies like Jaws, characters are simply functions of the action ... like stage hands who move props around and deliver information when it's necessary", 
      "Jaws is too gruesome for children, and likely to turn the stomach of the impressionable at any age. ... It is a coarse-grained and exploitative work which depends on excess for its impact. Ashore it is a bore, awkwardly staged and lumpily written.", 
      "scare machine that works with computer-like precision. ... You feel like a rat, being given shock therapy"
    ], 
    "director": "Steven Spielberg", 
    "genre": "thriller", 
    "introduction": "Jaws is a 1975 American  directed by  and based on 's 1974 . In the story, a giant   attacks beachgoers on Amity Island, a fictional summer , prompting the local police chief to hunt it with the help of a  and a professional shark hunter. The film stars  as police chief ,  as shark hunter Quint,  as oceanographer Matt Hooper,  as Larry Vaughn, the mayor of Amity Island, and  as Brody's wife, Ellen.", 
    "movieName": "Jaws", 
    "rating": [
      "Rotten Tomatoes: 97% with an average: 9.2/10 ", 
      "Metacritics: 87/100", 
      "IMDB: 8.0/10"
    ], 
    "year": "1975"
  }, 
  "1": "A beach party takes place at dusk on Amity Island, where a woman named Chrissie Watkins goes skinny dipping in the ocean. While , she is violently pulled under. The next day, her partial remains are found on shore. The medical examiner ruling the death a shark attack leads to Police Chief Martin Brody closing the beaches. Mayor Larry Vaughn overrules him, fearing it will ruin the town's summer economy. The coroner now concurs with the mayor's theory that Watkins was killed in a boating accident. Brody reluctantly accepts their conclusion until another fatal shark attack occurs shortly after. A bounty is then placed on the shark, resulting in an amateur shark-hunting frenzy. Local professional shark hunter Quint offers his services for $10,000. Meanwhile, consulting oceanographer Matt Hooper examines Watkins' remains and confirms her death was from a shark attack. ", 
  "2": "When local fishermen catch a large , the mayor proclaims the beaches safe. Hooper disputes it being the same predator, confirming this after no human remains are found inside it. Hooper and Brody find a half-sunken vessel while searching the night waters in Hooper's boat. Underwater, Hooper retrieves a sizable 's tooth embedded in the submerged . He drops it after finding a partial corpse. Vaughn discounts Brody and Hooper's claims that a huge great white shark is responsible and refuses to close the beaches, allowing only added safety precautions. On the Fourth of July weekend, tourists fill the beaches. Following a juvenile prank, the real shark enters a nearby , killing a boater and causing Brody's son, Michael, to go into shock. Brody finally convinces a devastated Vaughn to hire Quint. ", 
  "3": "Quint, Brody, and Hooper set out on Quint's boat, the Orca, to hunt the shark. While Brody lays down a  line, Quint waits for an opportunity to hook the shark. Without warning, it appears behind the boat. Quint examines the shark and harpoons a barrel into it, but it drags the barrel underwater and disappears. With the Orca slowly sinking, the trio attempt a riskier approach. Hooper puts on  and enters the water in a , intending to lethally inject the shark with  using a hypodermic spear. The shark demolishes the cage before Hooper can inject it, but he manages to escape to the seabed. The shark then attacks the boat directly and devours Quint. Trapped on the sinking vessel, Brody stuffs a pressurized scuba tank into the shark's mouth, and, climbing the mast, shoots the tank with Quint's rifle, destroying it. The resulting explosion kills the shark. Hooper resurfaces, and he and Brody paddle to Amity Island clinging to boat wreckage. ", 
  "wikiDocumentIdx": 2
}