{
  "0": {
    "cast": [
      "Keanu Reeves as Jonathan \"John\" Wick, an ex-hitman who returns to the criminal underworld following the death of his wife and a run-in with a Russian Crime Syndicate.", 
      "Michael Nyqvist as Viggo, the head of the Tarasov family and an enterprising businessman with questionable roots.", 
      "Alfie Allen as Iosef, the arrogant, entitled and foolish son of Viggo.", 
      "Adrianne Palicki as Ms. Perkins, a distinguished female contract killer in the underworld of assassins, and a former acquaintance of John."
    ], 
    "critical_response": [
      "John Wick is the kind of fired-up, ferocious B-movie fun some of us can't get enough of", 
      "Action movies are about movement, and John Wick pursues that goal with remorseless verve.", 
      "After a marked absence from the genre, Reeves resoundingly returns with an effortless, kinetic style that positions the film extremely well for any potential follow-ups.", 
      "Harboring few ambitions beyond knock-your-socks-off action sequences, this crafty revenge thriller delivers with so much style   and even some wit   that the lack of substance takes longer than it should to become problematic.", 
      "Reeves's semi-deliberate zonked deadpan style only really works in juxtaposition with funny dialogue   and this is a pretty humourless and violent film, which grinds on and on with more and more gleaming black SUVs getting trashed."
    ], 
    "director": "Chad Stahelski", 
    "genre": "Action", 
    "introduction": "John Wick is a 2014 American neo-noir action thriller film directed by Chad Stahelski and David Leitch. It stars Keanu Reeves, Michael Nyqvist, Alfie Allen, Adrianne Palicki, Bridget Moynahan, Dean Winters, Ian McShane, John Leguizamo and Willem Dafoe. The first installment in the John Wick film series, the story focuses on John Wick (Reeves), a retired hitman seeking vengeance for the theft of his vintage car and the killing of his puppy, a gift from his recently deceased wife. Stahelski and Leitch directed the film together, though only Stahelski was credited.", 
    "movieName": "John Wick", 
    "rating": [
      "Rotten Tomatoes: 86% and average: 6.9/10", 
      "Metacritic Score: 68/100", 
      "CinemaScore: B"
    ], 
    "year": "2014"
  }, 
  "1": "Iosef takes the Mustang to a chop shop run by Aurelio to have the VIN changed. Aurelio recognizes the car and, upon learning that Iosef stole it from John, punches him before throwing him out of his shop. John visits Aurelio, who tells him Iosef is the son of Viggo Tarasov, the head of the Russian crime syndicate in New York City. Viggo, informed by Aurelio of Iosef's actions, beats and berates Iosef, explaining to him that John Wick was his best assassin, nicknamed 'Baba Yaga.' When John wanted to retire and marry Helen, Viggo gave him an 'impossible task', implied to involve multiple assassinations. John succeeded, establishing the Tarasov syndicate. ", 
  "2": "John learns from Winston, the Continental's owner, that Viggo has Iosef protected at his nightclub, the Red Circle. John enters the Red Circle and kills his way to Iosef, but Viggo's henchman Kirill waylays John, allowing Iosef to escape. John retreats to the Continental to tend his injuries. Ms. Perkins, an assassin and former acquaintance, sneaks into John's room to kill him, but Marcus alerts John, allowing him to subdue Perkins. He forces Perkins to reveal the location of Viggo's front, knocks her unconscious and leaves her with fellow assassin Harry to await punishment. However, Perkins frees herself and kills Harry.  John travels to the Little Russia church which serves as Viggo's front and destroys Viggo's cache of money and blackmail material. When Viggo and his team arrive, John ambushes them, but he is subdued and captured. Viggo taunts John for thinking he could leave his old life behind. Before John can be killed, Marcus intervenes again, allowing John to free himself, kill Kirill, and accost Viggo. Under John's gunpoint, Viggo reveals Iosef's location to him. John then travels to Iosef's 'safe house' and kills him. ", 
  "3": "Perkins sees that John and Marcus have been in contact and tells Viggo, who has Marcus tortured before executing him in his home. Viggo calls John to report this, planning to have Perkins ambush him. Perkins, however, is called to a meeting with Winston, who has her executed for breaking the Continental's rules.  Winston calls John to inform him that Viggo is planning to escape by helicopter, and John races to the harbor, killing Viggo's remaining henchmen before engaging Viggo in a fistfight on the dock. Viggo pulls a knife and John allows himself to be stabbed, surprising Viggo. John then disarms and fatally wounds Viggo. Wounded himself, John stops at a waterfront animal clinic to treat his wound and takes with him a pit bull puppy which was scheduled to be euthanized. John and the dog walk home on the boardwalk where he had his last date with Helen. ", 
  "wikiDocumentIdx": 6
}