{
  "0": {
    "cast": [
      "Ryan Gosling as Sebastian Wilder", 
      "Emma Stone as Mia Dolan", 
      "John Legend as Keith", 
      "Callie Hernandez as Tracy"
    ], 
    "critical_response": [
      "succeeds both as a fizzy fantasy and a hard-headed fable, a romantic comedy and a showbiz melodrama, a work of sublime artifice and touching authenticity ", 
      "Chazelle has crafted that rare thing, a genuinely romantic comedy, and as well, a rhapsody in blue, red, yellow and green.", 
      "La La Land may look like the world that we dream about, but it also understands the cruelty that can come out of (or undermine) those dreams; it's shot in CinemaScope, and yet it's still an intimate masterpiece.", 
      "the year's most seriously pleasurable entertainment", 
      "...the movie traffics in the bittersweet happiness of treasuring things that are vanishing, like the unrealized future imagined in the climatic dance number, or those inky, star-filled dance floors that go on forever in old movies, or Hollywood musicals themselves. Or jazz: Sebastian has an early moment at a nightclub where he passionately sticks up for the music he loves.  It's dying on the vine, ", 
      "his quest (and eventual success) to save the traditionally black musical genre from extinction, seemingly the only person who can accomplish such a goal.", 
      "the movie sags badly in the middle, like a worn-out mattress that needs new springs", 
      " the film is a little dull, that the two leads' singing and dancing aren't exceptional, and that Sebastian is a jazz snob and Mia's character lacks depth. "
    ], 
    "director": "Damien Chazelle", 
    "genre": "Musical, Drama, Romance", 
    "introduction": "La La Land is a 2016 American musical romantic comedy-drama film written and directed by Damien Chazelle. It stars Ryan Gosling as a jazz pianist and Emma Stone as an aspiring actress, who meet and fall in love in Los Angeles while pursuing their dreams. The film's title refers simultaneously to music, the city of Los Angeles, and to the idiom for being out of touch with reality.", 
    "movieName": "La la Land", 
    "rating": [
      "Rotten Tomatoes: 92% and average: 8.6/10 ", 
      "Metacritics: 93/100", 
      "IMDB: 8.1/10"
    ], 
    "year": "2016"
  }, 
  "1": "During a gig at a restaurant, Sebastian slips into a passionate jazz improvisation despite warnings from the owner to stick to the setlist of traditional Christmas songs. Mia overhears the music as she passes by ('Mia and Sebastian's Theme'). Moved, she enters the restaurant, but Sebastian is fired for his disobedience. As he storms out, Mia attempts to compliment him, but he brushes her off. Months later, Mia runs into Sebastian at a party where he plays in a 1980s pop cover band; she teases him by requesting 'I Ran (So Far Away)', a song he considers an insult for 'a serious musician'. After the gig, the two walk to their cars, lamenting each other's company despite the chemistry between them ('A Lovely Night'). ", 
  "2": "After more failed auditions, Mia decides, at Sebastian's suggestion, to write a one-woman play. Sebastian begins to perform regularly at a jazz club ('Summer Montage'), and the two move in together. Sebastian's former classmate Keith invites him to be the keyboardist in his jazz fusion band, where he will be offered a steady income. Although he is dismayed by the band's pop style, Sebastian signs after overhearing Mia trying to convince her mother that Sebastian is working on his career. The band finds success, but when Mia attends one of their concerts ('Start a Fire') she is disturbed, knowing Sebastian does not enjoy their music. ", 
  "3": "During the band's first tour, Mia and Sebastian get into an argument; she accuses him of abandoning his dreams, while he claims she liked him more when he was unsuccessful. Mia leaves, insulted and frustrated. Sebastian misses Mia's play due to a band photo shoot that he had previously forgotten. The play is a disaster; few people attend, and Mia overhears dismissive comments. Sebastian attempts to apologize to Mia for missing the play, but she is unwilling to forgive him and ends their relationship. Despondent and unable to pay the theater back, Mia moves back home to Boulder City, Nevada. ", 
  "wikiDocumentIdx": 3
}