{
  "0": {
    "cast": [
      "Angelina Jolie as Maleficent", 
      "Sharlto Copley as Stefan", 
      "Elle Fanning as Aurora", 
      "Sam Riley as Diaval", 
      "Imelda Staunton as Knotgrass"
    ], 
    "critical_response": [
      "Maleficent' demolishes stereotypes that were only tweaked in 'Frozen", 
      "[it] surprises not for its baroque visions of a colourful woodland enlivened by joyous fairies and a forbidding castle peopled by unhappy humans, but rather for the thematic richness of its story gloriously personified by Angelina Jolie in the title role.", 
      "there's a lot of levitating cliffs and odd flora. But despite their bleeding-edge digital design, the backgrounds have all the depth of the old matte-painted backgrounds of the analog days,", 
      "Still, for all its limitations, 'Maleficent' manages to be improbably entertaining to watch, due solely to its title character."
    ], 
    "director": "Robert Stromberg", 
    "genre": "SuperHero", 
    "introduction": "Maleficent is a 2014 American dark fantasy film directed by Robert Stromberg from a screenplay by Linda Woolverton, and starring Angelina Jolie as Maleficent with Sharlto Copley, Elle Fanning, Sam Riley, Imelda Staunton, Juno Temple, and Lesley Manville in supporting roles. Loosely inspired by Charles Perrault's original fairy tale and Walt Disney's 1959 animated film Sleeping Beauty, the film portrays the story from the perspective of the eponymous antagonist, depicting her conflicted relationship with the princess and king of a corrupt kingdom.", 
    "movieName": "Maleficent", 
    "rating": [
      "Rotten Tomatoes: 51% and average: 5.7/10", 
      "Metacritic Score: 56/100", 
      "CinemaScore: A"
    ], 
    "year": "2014"
  }, 
  "1": "Maleficent is a powerful fairy living in the Moors, a magical forest realm bordering a human kingdom. As a young girl, she meets and falls in love with a human peasant boy named Stefan, whose love for Maleficent is overshadowed by his ambition. As they become older, the two grow apart, and Maleficent becomes protector of the Moors. When King Henry tries to conquer the Moors, Maleficent mortally wounds him and forces him to retreat. As he lies dying, he declares that whoever kills Maleficent will be named his successor and marry his daughter, Princess Leila. Stefan visits Maleficent in the Moors. He drugs her, but cannot bring himself to kill her. Instead, he cuts off her wings with iron, which is lethal to fairies, and presents them to the king. Devastated by Stefan's betrayal, Maleficent turns the Moors into a dark kingdom. She finds a raven named Diaval to act as her wings, spy and confidant. She transforms him into different forms as needed, including human. ", 
  "2": "Despite her initial dislike for Aurora, Maleficent begins to care for her when the bumbling and neglectful pixies fail to do so. After a brief meeting with the young Aurora, Maleficent watches over her from afar. When Aurora is fifteen, she encounters Maleficent. Knowing that she is being watched over, she calls Maleficent her 'fairy godmother.' Maleficent tries desperately to undo the curse but is unsuccessful, as the curse proves to be unbreakable by any means other than true love's kiss. In the forest, Aurora meets Prince Philip, and the two are attracted to each other. On the day before Aurora's sixteenth birthday, Aurora tells Maleficent that she would like to live with her in the Moors. When Aurora returns to the cottage, the pixies inadvertently tell Aurora of her past. Having learned of Maleficent's true identity, Aurora runs to her father's castle. ", 
  "3": "After a brief reunion with his daughter, Stefan locks her away in a room for her own safety while setting up a plan to kill Maleficent. However, the power of the curse draws Aurora to the dungeon, where a spinning wheel magically reassembles itself. She pricks her finger and falls into a deep sleep, fulfilling the curse. Maleficent, intent on saving Aurora, abducts Phillip and infiltrates Stefan's castle, but Phillip's kiss fails to awaken Aurora. At her bedside, Maleficent apologizes to Aurora and kisses her forehead. Aurora awakens, as Maleficent's motherly feelings towards her count as true love. However, as Maleficent and Aurora attempt to leave, they are ambushed by Stefan and his guards, with an iron net dropping on her. Maleficent transforms Diaval into a dragon, and he battles Stefan's guards, but he is eventually caught as well. Stefan taunts Maleficent, who is dizzy and sick from the iron, his former love for her fully gone, but before he can deliver a killing blow, Aurora finds her wings and releases them. They fly to Maleficent and reattach themselves. Maleficent carries Stefan to the top of the castle's highest tower and beats him easily and quickly in battle, but cannot bring herself to kill him. Stefan attacks her as she turns away, however, and both plummet from the tower. Maleficent breaks away and sends Stefan to his death. ", 
  "wikiDocumentIdx": 22
}