{
  "0": {
    "cast": [
      "Lindsay Lohan as Cady Heron", 
      "Rachel McAdams as Regina George", 
      "Lacey Chabert as Gretchen Wieners", 
      "Amanda Seyfried as Karen Smith", 
      "Lizzy Caplan as Janis Ian"
    ], 
    "critical_response": [
      "Boasts a one-two-three punch in star Lindsay Lohan, screenwriter Tina Fey and director Mark Waters, and, indeed, it delivers a knockout", 
      "The screenplay was highly praised by critics with Peter Travers of Rolling Stone calling it 'comic gold'.", 
      "In November 2012, Rotten Tomatoes named it in its 'Top 50 Greatest Teen Comedies'."
    ], 
    "director": "Mark Waters ", 
    "genre": "Comedy, teeny", 
    "introduction": "Mean Girls is a 2004 American teen comedy film directed by Mark Waters and written by Tina Fey. The film is partially based on Rosalind Wiseman's 2002 non-fiction self-help book Queen Bees and Wannabes, which describes female high school social cliques and the damaging effects they can have on girls.", 
    "movieName": "Mean Girls", 
    "rating": [
      "Rotten Tomatoes: 84% and average: 6.9/10", 
      "Metacritic Score: 66/100", 
      "CinemaScore: A-"
    ], 
    "year": "2004"
  }, 
  "1": "Sixteen-year-old homeschooled Cady Heron and her zoologist parents return to the United States after a twelve-year research trip in Africa, settling down in Evanston, Illinois. Attending a public school for the first time, Cady meets new classmates Janis Ian and Damian Leigh. Janis and Damian educate Cady on the school's various cliques and warn her to avoid the most popular and infamous one, the 'Plastics', who are led by queen bee Regina George and include insecure rich girl Gretchen Wieners and sweet but dimwitted Karen Smith. The Plastics take an interest in Cady, and invite her to sit with them at lunch. Seeing that Cady is getting along with the Plastics, Janis hatches a plan of revenge against Regina for some past slight, using Cady as the infiltrator. ", 
  "2": "When Regina is finally made aware of Cady's treachery, she retaliates by spreading the contents of her Burn Book all over the school, quickly inciting a massive brawl. To avoid suspicion, Regina inserts a fake libel of herself in the book in order to blame Cady, Gretchen, and Karen, the only female students not mentioned in the book. Karen convinces Principal Duvall that they did not spread the book. Duvall soon quells the fighting, and gathers all the girls in the school in the gymnasium. Math teacher Ms. Norbury, whom the Burn Book defamed as a drug dealer, makes the girls face the ways they all treat each other, confess their transgressions, and apologize to each other and the teachers. When Janis's turn comes, she defies Norbury and confesses her plan to destroy Regina with Cady's help, and openly mocks Regina with the support of the entire school. Pursued by an apologetic Cady, Regina storms out and is struck by a school bus, breaking her spine. ", 
  "3": "Without any friends, shunned by Aaron, grounded by her parents and despised by her peers at school, Cady takes full blame for the Burn Book and becomes an outcast. After she makes amends with Regina, Cady's guilt soon dissolves and she returns to her old personality. As part of her punishment for lying and failing Ms. Norbury's class, she joins the Mathletes in the state championship finals, and ends up winning the competition for her team after her opponent answers incorrectly. At the Spring Fling dance, Regina's new boyfriend, Shane Oman, is elected King, while Cady is elected Queen. Onstage, Cady declares that all her classmates are wonderful in their own way, breaks her plastic tiara, and distributes the pieces to some other girls. She then reconciles with Janis, Damian, and Aaron, and reaches a truce with the Plastics. ", 
  "wikiDocumentIdx": 11
}