{
  "0": {
    "cast": [
      "Billy Crystal as Michael \"Mike\" Wazowski", 
      "Noah Johnston as Young Mike", 
      "John Goodman as James P. \"Sulley\" Sullivan", 
      "Steve Buscemi as Randall \"Randy\" Boggs", 
      "Helen Mirren as Dean Abigail Hardscrabble, the chair of the Scarer program at Monsters University", 
      "Peter Sohn as Scott \"Squishy\" Squibbles, an Oozma Kappa fraternity member"
    ], 
    "critical_response": [
      "is true to the spirit of [Monsters, Inc.] and matches its tone. But it never seems content to turn over old ground.", 
      "It has enough of the right stuff to haunt the imagination long after the immediate buzz of its fluffy-furred cuteness has melted away. For a mere prequel, that's a result.", 
      "is cute, and funny, and the animation, though not exactly inspired, is certainly colorful.", 
      "This is a safe, predictable, edge-free, nearly bland effort from a studio that rarely hedges its bets."
    ], 
    "director": "Dan Scanlon", 
    "genre": "Comedy, Animation", 
    "introduction": "Monsters University is a 2013 American 3D computer-animated comedy film produced by Pixar Animation Studios for Walt Disney Pictures.[6] It was directed by Dan Scanlon and produced by Kori Rae, with John Lasseter, Pete Docter, Andrew Stanton and Lee Unkrich as executive producers. The music for the film was composed by Randy Newman, marking his seventh collaboration with Pixar. It was the fourteenth feature film produced by Pixar, and is a prequel to 2001's Monsters, Inc., marking the first time Pixar has made a prequel film.[7] Monsters University tells the story of two monsters, Mike and Sulley, and their time studying at college, where they start off as rivals, but slowly become best friends. John Goodman, Billy Crystal, Steve Buscemi, Bob Peterson, and John Ratzenberger reprise their roles as James P. Sullivan, Mike Wazowski, Randall Boggs, Roz, and the Abominable Snowman, respectively. Bonnie Hunt, who played Ms. Flint in the first film, voices Mike's grade school teacher Ms. Karen Graves.", 
    "movieName": "Monsters University", 
    "rating": [
      "Rotten Tomatoes: 79% and average: 6.8/10", 
      "Metacritic Score: 65/100", 
      "CinemaScore: A"
    ], 
    "year": "2013"
  }, 
  "1": "Michael 'Mike' Wazowski, a 7-year-old monster, aspires to become a scarer   a monster who enters the human world at night to scare children and harvest their screams for energy   when he grows up after visiting Monsters Inc., Monstropolis' most profitable scaring company, on a school field trip. Eleven years later, Mike is a first-year scare major at Monsters University, where he meets fellow monster, James P. 'Sulley' Sullivan. Mike studies hard, while the privileged Sulley, coming from a family of talented scarers, relies only on his natural ability and begins to falter. As the semester progresses, Mike and Sulley attempt to join a fraternity, but only Sulley is accepted into Roar Omega Roar, the strongest fraternity on campus. At the semester's final exam, a fight between the two causes them to accidentally break Dean Abigail Hardscrabble's cherished Scream Can. Hardscrabble fails both of them immediately, stating that Sulley does not study enough, and Mike is not scary enough. ", 
  "2": "Wanting to prove himself, Mike enters the university's 'Scare Games', and makes a wager with Hardscrabble to reinstate him and his team to the scare program if they win, but Mike must leave the university if they lose. He joins a group of misfits named Oozma Kappa, the weakest fraternity on campus, but they are denied entry to the Games for being one team member short. Sulley subsequently joins them, seeing the competition as his ticket back into the scare program. Oozma Kappa finish last in the first challenge, but are saved from elimination after another team is disqualified for cheating. Oozma Kappa improve gradually due to Mike's training and intricate knowledge of scaring, and they advance through each following challenge, finishing just behind Roar Omega Roar. In the final round, they defeat Roar Omega Roar with a decisive final scare by Mike in the simulation bedroom. However, Mike soon discovers that he only won because Sulley tampered with the machine's difficulty to the easiest setting. ", 
  "3": "Mike and Sulley are led away by the CDA, and are expelled from the university as a result of their actions, but the other members of Oozma Kappa are accepted into the scare program the next semester, as Hardscrabble was impressed by their performances in the Games. As Mike leaves on the bus, Sulley runs after him to raise his spirits. Hardscrabble then appears and wishes the two luck, claiming they were the first students to have surprised her. The two take jobs in the mail room of Monsters, Inc., eventually working their way up to join the scarer team. ", 
  "wikiDocumentIdx": 23
}