{
  "0": {
    "cast": [
      "Hugh Jackman as Charlie Kenton", 
      "Dakota Goyo as Max Kenton", 
      "Evangeline Lilly as Bailey Tallet", 
      "Anthony Mackie as Finn", 
      "Olga Fonda as Farra Lemkova"
    ], 
    "critical_response": [
      "Real Steel is a real movie. It has characters, it matters who they are, it makes sense of its action, it has a compelling plot. Sometimes you go into a movie with low expectations and are pleasantly surprised.", 
      "makes good use of his specialized skill in blending people and computer-made imaginary things into one lively, emotionally satisfying story", 
      "Though the premise of fighting robots does seem a plausible and intriguing extension of the contemporary WWE world, Real Steel is hampered by leaden, cliche d moments in which a stubborn boy teaches his childish father a valuable lesson.", 
      "Rocky with robots? It's not quite in Balboa's weight class, but Real Steel at least has some heft. There's barely a story beat among the beat-downs that you won't expect, and sometimes the saccharine gets in the way of the spectacle, but on the whole this is enjoyable family entertainment."
    ], 
    "director": "Shawn Levy", 
    "genre": "Science, Sports", 
    "introduction": "Real Steel is a 2011 American science fiction sports film starring Hugh Jackman and Dakota Goyo and co-produced and directed by Shawn Levy for DreamWorks Pictures. The film is based on the short story \"Steel\", written by Richard Matheson, which was originally published in the May 1956 edition of The Magazine of Fantasy & Science Fiction, and later adapted into a 1963 Twilight Zone episode. Real Steel was in development for several years before production began on June 24, 2010. Filming took place primarily in the U.S. state of Michigan. Animatronic robots were built for the film, and motion capture technology was used to depict the brawling of computer-generated robots and animatronics.", 
    "movieName": "Real Steel", 
    "rating": [
      "Rotten Tomatoes: 59% and average: 5.9/10", 
      "Metacritic Score: 56/100", 
      "CinemaScore: A"
    ], 
    "year": "2011"
  }, 
  "1": "In 2020, human boxers are replaced by robots. Charlie Kenton (Hugh Jackman), a former boxer, owns 'Ambush', but loses it in a fight against a bull belonging to promoter and carnival owner Ricky (Kevin Durand), who rigged the fight to mess with Charlie as he sees him as a joke, partially because he beat him up the last time they competed for bailing on the bet. Having made a bet that Ambush would win as a result, Charlie now has a debt to Ricky that he can't pay which he runs out on. ", 
  "2": "At Max's behest, Charlie pits Atom against 'Metro', whom Atom overcomes. Max programs Noisy Boy's vocal-respond controls in Atom, and convinces Charlie to help him with Atom's fighting move memory, resulting in a series of victories and culminating to being offered a fight in World Robot Boxing against national champion 'Twin Cities'. After reaching the arena, the owner of global champion 'Zeus' offers to buy Atom, which Max instantly rejects. Charlie disagrees, but eventually takes Max's side. The fight starts with Atom on the attack, but Twin Cities easily takes the offensive and corners Atom. While their opponent has no blind spot, Charlie notices a hitch whenever Twin Cities throws a right jab. Using this, Charlie is able to get Atom out of the corner and eventually win by knockout. Elated by their success, Max challenges Zeus, publicly, with the audience squarely on their side. After the fight, Ricky and his two henchmen ambush Charlie for bailing earlier and rob them of their winnings, prompting Charlie to return Max to Debra. ", 
  "3": "Zeus starts the fight by knocking Atom down with its first punch, but Atom gets up, and Zeus continues its assault, knocking Atom down multiple times, but each time Atom gets back up, and eventually is able to land its first punch, a right uppercut. Atom survives the first round, stunning the audience. Ricky, who had made a bet with a friend of Charlie's of $100,000 that Atom would not last the round, tries to slip away, but is cornered by the fight's bookmakers. The two opponents go back and forth throughout the fight, Atom landing multiple punches but also getting knocked down many times, getting back up for each of them. Late in the fourth round, Atom's vocal-respond controls are damaged, forcing Charlie to use its 'shadow function' to make it mimic his boxing skills. This, and the fact that Zeus starts running out of power from its constant offense, tip the odds in Atom's favor, forcing Zeus' programmer to manually control it, and Max and Bailey both watch Charlie doing what he was meant to do, and are touched by seeing him literally fighting for his son. Zeus gets a sound beating, once even hitting the ground and barely avoiding losing by knockout, but survives the final round and wins the match by the judges' decision. The technologically superior machine remains undefeated, but with the humiliation of being fought to a near-loss, to which Atom is hailed the 'People's Champion'. ", 
  "wikiDocumentIdx": 24
}