{
  "0": {
    "cast": [
      "Jesse Eisenberg as Mark Zuckerberg", 
      "Andrew Garfield as Eduardo Saverin", 
      "Justin Timberlake as Sean Parker", 
      "Armie Hammer as Cameron and Tyler Winklevoss", 
      "Max Minghella as Divya Narendra"
    ], 
    "critical_response": [
      "David Fincher's film has the rare quality of being not only as smart as its brilliant hero, but in the same way. It is cocksure, impatient, cold, exciting and instinctively perceptive.", 
      "The Social Network is the movie of the year. But Fincher and Sorkin triumph by taking it further. Lacing their scathing wit with an aching sadness, they define the dark irony of the past decade.", 
      "The biographical part takes liberties with its subject. Aaron Sorkin based his screenplay on a contentious book, Ben Mezrich's The Accidental Billionaires, so everything that's seen isn't necessarily to be believed."
    ], 
    "director": "David Fincher", 
    "genre": "Biographical, drama", 
    "introduction": "The Social Network is a 2010 American biographical drama film directed by David Fincher and written by Aaron Sorkin. Adapted from Ben Mezrich's 2009 book The Accidental Billionaires: The Founding of Facebook, A Tale of Sex, Money, Genius and Betrayal, the film portrays the founding of social networking website Facebook and the resulting lawsuits. It stars Jesse Eisenberg as founder Mark Zuckerberg, along with Andrew Garfield as Eduardo Saverin, Justin Timberlake as Sean Parker, and Armie Hammer as Cameron and Tyler Winklevoss. Neither Zuckerberg nor any other Facebook staff were involved with the project, although Saverin was a consultant for Mezrich's book.[3] The film was released in the United States by Columbia Pictures on October 1, 2010.", 
    "movieName": "The Social Network", 
    "rating": [
      "Rotten Tomatoes: 96% and average: 9/10", 
      "Metacritic Score: 95/100", 
      "CinemaScore: B+"
    ], 
    "year": "2010"
  }, 
  "1": "In October 2003, 19-year-old Harvard University student Mark Zuckerberg is dumped by his girlfriend Erica Albright. Returning to his dorm, Zuckerberg writes an insulting entry about Albright on his LiveJournal blog and then creates a campus website called Facemash by hacking into college databases to steal photos of female students, then allowing site visitors to rate their attractiveness. After traffic to the site crashes parts of Harvard's computer network, Zuckerberg is given six months of academic probation. However, Facemash's popularity attracts the attention of Harvard upperclassmen and twins Cameron and Tyler Winklevoss and their business partner Divya Narendra. The trio invites Zuckerberg to work on Harvard Connection, a social network featuring the exclusive nature of Harvard students and aimed at dating. ", 
  "2": "Saverin and Zuckerberg meet fellow student Christy Lee, who asks them to 'Facebook me', a phrase which impresses both of them. As Thefacebook grows in popularity, Zuckerberg extends the network to Yale University, Columbia University and Stanford University. Lee arranges for Saverin and Zuckerberg to meet Napster co-founder Sean Parker, who presents a 'billion dollar' vision for the company that impresses Zuckerberg. He also suggests dropping 'The' from Thefacebook, just calling it Facebook. At Parker's suggestion, the company moves to Palo Alto, with Saverin remaining in New York to work on business development. After Parker promises to expand Facebook to two continents, Zuckerberg invites him to live at the house he is using as company headquarters. ", 
  "3": "Throughout the film, the narrative is intercut with scenes from depositions taken in the Winklevoss twins' and Saverin's respective lawsuits against Zuckerberg and Facebook. The Winklevoss twins claim that Zuckerberg stole their idea, while Saverin claims his shares of Facebook were unfairly diluted when the company was incorporated. At the end, Marylin Delpy, a junior lawyer for the defense, informs Zuckerberg that they will settle with Saverin, since the sordid details of Facebook's founding and Zuckerberg's own callous attitude will make him highly unsympathetic to a jury. After everyone leaves, Zuckerberg is shown sending a friend request to Albright on Facebook and then refreshing the webpage every few seconds as he waits for her response. the world in Superman's absence. After they leave, the dirt atop Clark's coffin levitates. ", 
  "wikiDocumentIdx": 17
}