{
  "0": {
    "cast": [
      "Leonardo DiCaprio as Jordan Belfort", 
      "Jonah Hill as Donnie Azoff", 
      "Margot Robbie as Naomi Lapaglia", 
      "Kyle Chandler as Patrick Denham", 
      "Rob Reiner as Max Belfort"
    ], 
    "critical_response": [
      "Epic in size, claustrophobically narrow in scope.", 
      "the story 'wants us to be interested in characters who are dull people to start with, made duller by their delusions of being interesting because they are high.", 
      "an irresponsible glorification rather than a satirical takedown."
    ], 
    "director": "Martin Scorsese", 
    "genre": "black comedy", 
    "introduction": "The Wolf of Wall Street is a 2013 American black comedy[3] directed by Martin Scorsese and written by Terence Winter, based on the memoir of the same name by Jordan Belfort. It recounts Belfort's perspective on his career as a stockbroker in New York City and how his firm Stratton Oakmont engaged in rampant corruption and fraud on Wall Street that ultimately led to his downfall. Leonardo DiCaprio (who was also a producer) stars as Belfort, with Jonah Hill as his business partner and friend Donnie Azoff, Margot Robbie as his wife Naomi Lapaglia and Kyle Chandler as Patrick Denham, the FBI agent who tries to bring him down. Matthew McConaughey, Rob Reiner, Jon Favreau, Joanna Lumley and Jean Dujardin also star. ", 
    "movieName": "The Wolf of Wall Street", 
    "rating": [
      "Rotten Tomatoes: 78% and average: 7.8/10", 
      "Metacritic Score: 75/100", 
      "CinemaScore: C"
    ], 
    "year": "2013"
  }, 
  "1": "In 1987, Jordan Belfort procures a job as a Wall Street stockbroker for L.F. Rothschild, employed under Mark Hanna, who quickly entices him with the sex and drugs fueled stockbroker culture and teaches him that a stockbroker's only job is to make money for himself. Jordan soon finds his career terminated following Black Monday and takes a job at a boiler room brokerage firm on Long Island that specializes in penny stocks. Thanks to his aggressive pitching style and the high commissions, Jordan makes a small fortune. ", 
  "2": "Jordan befriends his neighbor, Donnie Azoff, and the two found their own company. They recruit several of Jordan's friends, whom Jordan trains in the art of the 'hard sell'. The basic method of the firm is a pump and dump scam. To cloak this, Jordan gives the firm the respectable-sounding name of Stratton Oakmont. After an expose  in Forbes, hundreds of ambitious young financiers flock to his company. Jordan becomes immensely successful and slides into a decadent lifestyle full of prostitutes and drugs. He has an affair with a woman named Naomi Lapaglia. When his wife finds out, they divorce, and he marries Naomi. Meanwhile, the SEC and the FBI begin investigating Stratton Oakmont. Jordan illegally makes $22 million in three hours upon securing the IPO of Steve Madden. This brings him and his firm to the attention of the FBI. To hide his money, Jordan opens a Swiss bank account with corrupt banker Jean-Jacques Saurel in the name of Naomi's Aunt Emma, who is a British national and thus outside the reach of American authorities. He uses the wife and in-laws of his friend Brad Bodnick, who have European passports, to smuggle the cash into Switzerland. ", 
  "3": "Two years later, the FBI arrests Jordan because Saurel, arrested in Florida on an unrelated charge, has also informed on Jordan. Since the evidence against him is overwhelming, Jordan agrees to gather evidence on his colleagues in exchange for leniency. Fed up with Jordan's lifestyle, Naomi tells Jordan she is divorcing him and wants full custody of their children. Jordan loses his mind and tries to run off with his daughter Skylar in his car, but he ends up crashing in the driveway. The next morning, Jordan wears a wire to work but slips a note to Donnie warning him. Donnie keeps the note and rats out on Jordan to the FBI. Jordan is arrested for breaching his co-operation deal. The FBI raids and shuts down Stratton Oakmont. Despite this one breach, Jordan receives a reduced sentence for his testimony and serves three years in a minimum security prison. After his release, Jordan makes a living hosting seminars on sales technique. ", 
  "wikiDocumentIdx": 28
}