{
  "0": {
    "cast": [
      "Sally Hawkins as Elisa Esposito, a mute cleaner who works at a secret government laboratory.", 
      "Michael Shannon as Colonel Richard Strickland, a corrupt military official in charge of the project to study the \"asset\".", 
      "Richard Jenkins as Giles, Elisa's closeted neighbor and close friend who is a struggling advertising illustrator.", 
      "Octavia Spencer as Zelda Delilah Fuller, Elisa's co-worker and friend who serves as her interpreter.", 
      "Michael Stuhlbarg as Dimitri Mosenkov, a Soviet spy working as a scientist studying the creature, under the alias \"Dr. Robert Hoffstetler\"."
    ], 
    "critical_response": [
      "one of del Toro's most stunningly successful works... also a powerful vision of a creative master feeling totally, joyously free.", 
      "Even as the film plunges into torment and tragedy, the core relationship between these two unlikely lovers holds us in thrall. Del Toro is a world-class film artist. There's no sense trying to analyze how he does it.", 
      "The Shape of Water has tenderness uncommon to del Toro films. ... While The Shape of Water isn't groundbreaking, it is elegant and mesmerizing.", 
      "refer Sally Hawkins' mute character as 'mentally handicapped' and for erroneously crediting actor Benicio del Toro as director."
    ], 
    "director": "Guillermo del Toro", 
    "genre": "Fantasy, Drama", 
    "introduction": "The Shape of Water is a 2017 American fantasy drama film directed by Guillermo del Toro and written by del Toro and Vanessa Taylor. It stars Sally Hawkins, Michael Shannon, Richard Jenkins, Doug Jones, Michael Stuhlbarg, and Octavia Spencer. Set in Baltimore in 1962, the story follows a mute custodian at a high-security government laboratory who falls in love with a captured humanoid amphibian creature.", 
    "movieName": "The Shape of Water", 
    "rating": [
      "Rotten Tomatoes: 92% and average: 8.4/10", 
      "Metacritic Score: 87/100", 
      "CinemaScore: A"
    ], 
    "year": "2017"
  }, 
  "1": "Elisa Esposito, who as an orphaned child, was found in a river with wounds on her neck, is mute, and communicates through sign language. She lives alone in an apartment above a cinema, and works as a cleaning-woman at a secret government laboratory in Baltimore at the height of the Cold War. Her friends are her closeted next-door neighbor Giles, a struggling advertising illustrator who shares a strong bond with her, and her co-worker Zelda, a woman who also serves as her interpreter at work.  The facility receives a mysterious creature captured from a South American river by Colonel Richard Strickland, who is in charge of the project to study it. Curious about the creature, Elisa discovers it is a humanoid amphibian. She begins visiting him in secret, and the two form a close bond. ", 
  "2": "Elisa keeps the creature in her bathtub, adding salt to the water to keep him alive. She plans to release the creature into a nearby canal when it will be opened to the ocean in several days' time. As part of his efforts to recover the creature, Strickland interrogates Elisa and Zelda, but the failure of his advances toward Elisa hampers his judgment, and he dismisses them. Back at the apartment, Giles discovers the creature devouring one of his cats, Pandora. Startled, the creature slashes Giles's arm and rushes out of the apartment. The creature gets as far as the cinema downstairs before Elisa finds him and returns him to her apartment. The creature touches Giles on his balding head and his wounded arm; the next morning, Giles discovers his hair has begun growing back and the wounds on his arm have healed. Elisa and the creature soon become romantically involved, having sex in her bathroom, which she at one point fills completely with water. ", 
  "3": "Hoyt gives Strickland an ultimatum, asking him to recover the creature within 36 hours. Meanwhile, Mosenkov is told by his handlers that he will be extracted in two days. As the planned release date approaches, the creature's health starts deteriorating. Mosenkov leaves to rendezvous with his handlers, with Strickland tailing him. At the rendezvous, Mosenkov is shot by one of his handlers, but Strickland shoots the handlers dead and then tortures Mosenkov for information. Mosenkov implicates Elisa and Zelda before dying from his wounds. Strickland then threatens Zelda in her home, causing her terrified husband to reveal that Elisa had been keeping the creature. Strickland searches Elisa's apartment and finds a calendar note revealing when and where she plans to release him. At the canal, Elisa and Giles bid farewell to the creature, but Strickland arrives and attacks them all. Strickland knocks Giles down and shoots the creature and Elisa, who both appear to die. However, the creature heals himself and slashes Strickland's throat, killing him. As police arrive on the scene with Zelda, the creature takes Elisa and jumps into the canal, where, deep under water, he heals her. When he applies his healing touch to the scars on her neck, she starts to breathe through gills. In a closing voiceover narration, Giles conveys his belief that Elisa lived 'happily ever after' with the creature. ", 
  "wikiDocumentIdx": 27
}