{
  "0": {
    "cast": [
      "Ryan Gosling as Noah Calhoun", 
      "Rachel McAdams as Allison \"Allie\" Hamilton", 
      "Joan Allen as Anne Hamilton", 
      "James Marsden as Lon Hammond, Jr."
    ], 
    "critical_response": [
      "striking in its rich, saturated effects' and 'actors are blessed by good material.", 
      "Gosling and especially McAdams give all-star performances, doing just enough to hand the reins over to the pros, who take what's left of the film and finish the audience off with some touching scenes that don't leave a dry eye in the house.", 
      "the scenes between the young lovers confronting adult authority have the same seething tension and lurking hysteria that the young Warren Beatty and Natalie Wood brought more than 40 years ago to their roles in Splendor in the Grass.", 
      "Never mind that McAdams and Gosling don't for a minute call to mind 1940s America; they're both suitably attractive and appealing. Gosling, who delivered a searing and largely unseen screen debut performance in the 2001 drama The Believer, is particularly convincing as a young man who charms his way past a girl's strongest defenses.' ", 
      "Amid the sticky-sweet swamp of Jeremy Leven's script, Rowlands and Garner emerge spotless and beatific, lending a magnanimous credibility to their scenes together. These two old pros slice cleanly through the thicket of sap-weeping dialogue and contrivance, locating the terror and desolation wrought by the cruel betrayals of a failing mind.", 
      "Audiences craving big, gooey over-the-top romance have their must-see summer movie in The Notebook.", 
      "already one of the most intriguing young thesps, Gosling extends his range to pure romance without sacrificing a bit of his naturally subversive qualities, and even seems comfortable looking beautiful in a manly American way. The head-turner is McAdams, doing such a different perf from her top bitch in Mean Girls that it's hard to tell it's the same actor. She skillfully carries much of the film's emotional weight with a free and easy manner."
    ], 
    "director": "Nick Cassavetes", 
    "genre": "Drama, romantic", 
    "introduction": "The Notebook is a American romantic drama film based on the 1996 novel The Notebook by Nicholas Sparks. The film stars Ryan Gosling and Rachel McAdams as a young couple who fall in love in the 1940s. Their story is narrated from the present day by an elderly man (portrayed by James Garner) telling the tale to a fellow nursing home resident (played by Gena Rowlands, who is Cassavetes's mother).", 
    "movieName": "The Notebook", 
    "rating": [
      "Rotten Tomatoes: 52% and average: 5.7/10", 
      "Metacritic Score: 53/100"
    ], 
    "year": "2004"
  }, 
  "1": "In 1940, Seabrook Island, South Carolina, Noah Calhoun is smitten with 17 year old heiress Allison 'Allie' Hamilton after seeing her at a carnival, and they have a summer love affair. Noah takes Allie to an abandoned house that he intends to buy for them. They try to make love, but are interrupted by Noah's friend Fin with the news that Allie's parents have the police looking for her. When Allie and Noah return to her parents' mansion, Allie's mother Anne calls Noah trash and they ban her from seeing Noah. Noah walks out and Allie chases after him. The ensuing argument between the two ends in a break up and the next morning, Anne announces that the family is returning home to Charleston.  ", 
  "2": "Noah writes to Allie every day for a year but Anne intercepts the letters and they never reach Allie. Noah enlists with Fin to fight in World War II, where Fin is killed in battle. Allie volunteers in a hospital for wounded soldiers, where she meets officer Lon Hammond Jr., a young lawyer who comes from old Southern money. The two become engaged, to the delight of Allie's parents.  When Noah returns from the war, his father has sold their home so that Noah can buy the abandoned house. While visiting Charleston, Noah witnesses Allie and Lon kissing at a restaurant; he convinces himself that if he restores the house, Allie will come back to him. Allie is startled to read in the newspaper that Noah has completed the house to the specifications she made years before. ", 
  "3": "Allie returns to Seabrook to find Noah living in the restored house. The two renew their relationship and make love. In the morning, Anne appears on Noah's doorstep, warning Allie that Lon has followed her to Seabrook. Anne reveals that in her youth she had been in love with a lower-class young man and still thinks of him. She then gives Allie the letters that Noah wrote to her, admitting that she hid them from Allie. Allie confesses to Lon that she has been spending time with Noah, and tells him she knows she should be with him, but she remains indecisive. Ultimately, she goes back to her relationship with Noah. ", 
  "wikiDocumentIdx": 12
}