{
  "0": {
    "cast": [
      "Leonardo DiCaprio as Jay Gatsby, a famous billionaire who hosts wild parties at his house in the hope that Daisy will show up.", 
      "Tobey Maguire as Nick Carraway, a would-be writer who is also Gatsby s neighbor and friend. He is the narrator of this movie.", 
      "Carey Mulligan as Daisy Buchanan, Gatsby s former lover and Tom s wife.", 
      "Emily Foreman as Pamela \"Pammy\" Buchanan", 
      "Joel Edgerton as Tom Buchanan, Upper class socialite who hates Gatsby because of his new money status and relationship with Daisy"
    ], 
    "critical_response": [
      "intractably wrong with the film is that there's no reality to heighten; it's a spectacle in search of a soul.", 
      "less a conventional movie adaptation than a splashy, trashy opera, a wayward, lavishly theatrical celebration of the emotional and material extravagance that Fitzgerald surveyed with fascinated ambivalence", 
      "the best way to enjoy the film is to put aside whatever literary agenda you are tempted to bring with you.", 
      " the stand-out actor is Joel Edgerton as Tom Buchanan doing an excellent job of showing the character s gruffness, despite the one-dimensionality given to him"
    ], 
    "director": "Baz Luhrmann", 
    "genre": "Romantic, Drama", 
    "introduction": "The Great Gatsby is a 2013 period romantic drama film based on F. Scott Fitzgerald's 1925 novel of the same name. The film was co-written and directed by Baz Luhrmann and stars Leonardo DiCaprio as the eponymous Jay Gatsby, with Tobey Maguire, Carey Mulligan, Joel Edgerton, Isla Fisher and Elizabeth Debicki.[5] Production began in 2011 and took place in Australia, with a $190 million budget. The film follows the life and times of millionaire Jay Gatsby and his neighbor Nick Carraway (Tobey Maguire), who recounts his encounter with Gatsby at the height of the Roaring Twenties in New York state.", 
    "movieName": "The Great Gatsby", 
    "rating": [
      "Rotten Tomatoes: 48% and average: 5.8/10", 
      "Metacritic Score: 55/100", 
      "CinemaScore: B"
    ], 
    "year": "2013"
  }, 
  "1": "In 1931, Nick Carraway, a World War I veteran, is receiving treatment for alcoholism at a psychiatric hospital. He talks about Jay Gatsby, the most hopeful man he had ever met. Nick's doctor suggests that he writes his thoughts down, since writing is Nick's passion. In the summer of 1922, Nick moves from the Midwest to New York after abandoning writing. He rents a small house in the North Shore village of West Egg, next to the mansion of Gatsby, a mysterious business magnate who often holds extravagant parties. One day, while Nick has dinner with his cousin, Daisy Buchanan, and her husband, Tom, he is introduced to Jordan Baker by Daisy, who hopes to make a match between them. When Nick returns home, he sees Gatsby standing on the dock, reaching towards the green light coming from the Buchanan dock. ", 
  "2": "At the Plaza, Gatsby tells Tom of his affair with Daisy. Tom accuses Gatsby of having never attended Oxford and having made his fortune through bootlegging with mobsters. Daisy says she loves Gatsby but cannot bring herself to say she never loved Tom. Eventually, both Gatsby and Daisy leave. After fighting with George over her infidelity, Myrtle runs into the street and is fatally struck by Gatsby's car after mistaking it for Tom's. After learning about Myrtle's death, Tom tells George that the car belongs to Gatsby and that he suspects Gatsby was Myrtle's lover. Nick deduces Daisy was the driver, though Gatsby intends to take the blame. Nick overhears Daisy accepting Tom's promise to take care of everything, but he does not tell Gatsby. Gatsby admits to Nick that he was born penniless; his real name is James Gatz, and he had asked Daisy to wait for him until he had made something of himself. ", 
  "3": "The next day, Gatsby hears the phone ringing and thinks it's Daisy. Before he can answer it, he is shot and killed by George, who then commits suicide. Nick is the only person other than reporters to attend Gatsby's funeral, as Daisy and Tom are leaving New York. The media paints Gatsby as Myrtle's lover and killer. Disgusted with both the city and its inhabitants, Nick leaves after taking a final walk through Gatsby's deserted mansion and reflecting on Gatsby's ability to hope. In the sanatorium, Nick finishes typing his memoir, titling it The Great Gatsby. ", 
  "wikiDocumentIdx": 25
}