{
  "0": {
    "cast": [
      "Meryl Streep as Katharine Graham", 
      "Tom Hanks as Ben Bradlee", 
      "Sarah Paulson as Antoinette \"Tony\" Pinchot Bradlee", 
      "Bob Odenkirk as Ben Bagdikian", 
      "Tracy Letts as Fritz Beebe"
    ], 
    "critical_response": [
      "The Post passes the trickiest tests of a historical drama: It makes us understand that decisions that have been validated by the lens of history were difficult ones to make in the moment, and it generates suspense over how all the pieces fell into place to make those decisions come to fruition.", 
      "Nobody needs to be reminded that history tends to go in circles, but The Post is so vital because it captures the ecstasy of trying to break the chain and bend things towards justice; defending the fundamental tenets of the Constitution hasn't been this much fun since Hamilton.", 
      "has all the makings of an awards season hit, but is too calculated to reflect today's ragged, tenuous sociopolitical climate.", 
      "Spielberg makes these crucial days in American history easy to follow. But if you look at The Post next to something like All the President's Men, you see the difference between having a story passively explained to you and actively helping to untangle it. That's a small quibble with an urgent and impeccably acted film. But it's also the difference between a very good movie and a great one."
    ], 
    "director": "Steven Spielberg", 
    "genre": "Historical, Political", 
    "introduction": "The Post is a 2017 American historical political thriller film directed and produced by Steven Spielberg and written by Liz Hannah and Josh Singer. It stars Meryl Streep as Katharine Graham, the first female publisher of a major American newspaper, and Tom Hanks as Ben Bradlee, the executive editor of The Washington Post, with Sarah Paulson, Bob Odenkirk, Tracy Letts, Bradley Whitford, Bruce Greenwood, Carrie Coon, and Matthew Rhys in supporting roles. Set in the early 1970s, The Post depicts the true story of attempts by journalists at The Washington Post to publish the Pentagon Papers, classified documents regarding the 30-year involvement of the United States government in the Vietnam War.", 
    "movieName": "The Post", 
    "rating": [
      "Rotten Tomatoes: 88% and average: 7.9/10", 
      "Metacritic Score: 83/100", 
      "CinemaScore: A"
    ], 
    "year": "2017"
  }, 
  "1": "In 1966 Vietnam, State Department military analyst Daniel Ellsberg accompanies U.S. troops in combat, documenting the progress of U.S. military activities in the region for Secretary of Defense Robert McNamara. On the return flight home, McNamara expresses to Ellsberg and William Macomber his view that the war in Vietnam is hopeless, yet, upon landing, McNamara expresses his confidence in the war effort. Ellsberg overhears this, and becomes disillusioned. Years later, now working for the RAND Corporation, a civilian military contractor, Ellsberg surreptitiously photocopies classified reports documenting the country's decades-long involvement in the conflict in Vietnam, dating back to the Truman administration. Ellsberg then leaks these documents to reporters at The New York Times. ", 
  "2": "Post assistant editor Ben Bagdikian tracks down Ellsberg as the source for the leak, who provides Bagdikian with copies of the same material given to the Times. A hand-picked team of Post reporters sorts through the piles of papers, searching for the headline stories. The lawyers for the Post advise against publishing the material, lest the Nixon administration bring criminal charges against them. Graham talks to McNamara, Bradlee, and trusted Post chairman Fritz Beebe, agonizing over the decision of whether to publish. The situation is made even more complicated when the Post's lawyers discover that Bagdikian's source is the same as the Times's, possibly putting Graham in contempt of court. If charges are brought against the company, Graham could destroy the newspaper she sees as a family legacy. Alternately, if she were to win any legal challenge, the Post could instead establish itself as an important journalistic institution. She chooses to run the story. ", 
  "3": "The White House retaliates, and in short order the Post and Times appear together before the Supreme Court to plead their First Amendment argument for the right to publish the material. Meanwhile, newspapers across the country pick up the story in solidarity with the Post and Times. The court rules 6 3 in the newspapers' favor, vindicating Graham's decision. Nixon demands that the Post should be barred from the White House. One year later, a security guard discovers a break-in in progress at the Watergate complex. ", 
  "wikiDocumentIdx": 26
}