{
  "0": {
    "cast": [
      "Robert Downey Jr. as Tony Stark / Iron Man", 
      "Chris Evans as Steve Rogers / Captain America", 
      "Mark Ruffalo as Bruce Banner / Hulk", 
      "Chris Hemsworth as Thor, the crown prince of Asgard. ", 
      "Scarlett Johansson as Natasha Romanoff / Black Widow", 
      "Jeremy Renner as Clint Barton / Hawkeye"
    ], 
    "critical_response": [
      "Whedon and his cohorts have managed to stir all the personalities and ingredients together so that the resulting dish, however familiar, is irresistibly tasty again.", 
      " Like a superior, state-of-the-art model built from reconstituted parts, Joss Whedon's buoyant, witty and robustly entertaining superhero smash-up is escapism of a sophisticated order, boasting a tonal assurance and rich reserves of humor that offset the potentially lumbering and unavoidably formulaic aspects of this 143-minute team-origin story. ", 
      "Ruffalo is the revelation, turning Banner into a wry reservoir of calm ready to become a volcano", 
      "His Iron Man is certainly a team player, but Mr. Downey comes to the party with two insuperable superpowers: a character of established sophistication the industrialist/inventor Tony Stark, a sharp-tongued man of the world and his own quicksilver presence that finds its finest expression in self-irony. "
    ], 
    "director": "Joss Whedon", 
    "genre": "Drama, Superhero", 
    "introduction": "Marvel's The Avengers is a 2012 American superhero film based on the Marvel Comics superhero team of the same name, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures.1 It is the sixth film in the Marvel Cinematic Universe. The film was written and directed by Joss Whedon and features an ensemble cast that includes Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsga rd, and Samuel L. Jackson. In the film, Nick Fury, director of the peacekeeping organization S.H.I.E.L.D., recruits Iron Man, Captain America, the Hulk, and Thor to form a team that must stop Thor's brother Loki from subjugating Earth.", 
    "movieName": "The Avengers", 
    "rating": [
      "Rotten Tomatoes: 92% and average: 8/10", 
      "Metacritic Score: 69/100", 
      "CinemaScore: A+"
    ], 
    "year": "2012"
  }, 
  "1": "The Asgardian Loki encounters the Other, the leader of an extraterrestrial race known as the Chitauri. In exchange for retrieving the Tesseract, a powerful energy source of unknown potential, the Other promises Loki an army with which he can subjugate Earth. Nick Fury, director of the espionage agency S.H.I.E.L.D., and his lieutenant Agent Maria Hill arrive at a remote research facility during an evacuation, where physicist Dr. Erik Selvig is leading a research team experimenting on the Tesseract. Agent Phil Coulson explains that the object has begun radiating an unusual form of energy. The Tesseract suddenly activates and opens a wormhole, allowing Loki to reach Earth. Loki takes the Tesseract and uses his scepter to enslave Selvig and a couple of other agents, including Clint Barton, to aid him in his getaway. ", 
  "2": "The Avengers become divided, both over how to approach Loki and the revelation that S.H.I.E.L.D. plans to harness the Tesseract to develop weapons as a deterrent against hostile extraterrestrials. As the group argues, Barton and Loki's other possessed agents attack the Helicarrier, disabling one of its engines in flight and causing Banner to transform into the Hulk. Stark and Rogers work to restart the damaged engine, and Thor attempts to stop the Hulk's rampage. Romanoff fights Barton, and knocks him unconscious, breaking Loki's mind control. Loki escapes after killing Coulson and ejecting Thor from the airship, while the Hulk falls to the ground after attacking a S.H.I.E.L.D. fighter jet. Fury uses Coulson's death to motivate the Avengers into working as a team. Stark and Rogers realize that for Loki, simply defeating them will not be enough; he needs to overpower them publicly to validate himself as ruler of Earth. Loki uses the Tesseract, in conjunction with a device Selvig built, to open a wormhole above Stark Tower to the Chitauri fleet in space, launching his invasion. ", 
  "3": "Rogers, Stark, Romanoff, Barton, and Thor rally in defense of New York City, the wormhole's location. Banner arrives and transforms into the Hulk, and together the Avengers battle the Chitauri while evacuating civilians. The Hulk finds Loki and beats him into submission. Romanoff makes her way to the wormhole generator, where Selvig, freed from Loki's mind control, reveals that Loki's scepter can be used to shut down the generator. Meanwhile, Fury's superiors from the World Security Council attempt to end the invasion by launching a nuclear missile at Midtown Manhattan. Stark intercepts the missile and takes it through the wormhole toward the Chitauri fleet. The missile detonates, destroying the Chitauri mothership and disabling their forces on Earth. Stark's suit runs out of power, and he falls back through the wormhole just as Romanoff closes it. Stark goes into freefall, but the Hulk saves him from crashing into the ground. In the aftermath, Thor returns Loki and the Tesseract to Asgard, while Fury expresses confidence that the Avengers will return if and when they are needed. ", 
  "wikiDocumentIdx": 7
}