{
  "0": {
    "cast": [
      "Leonardo DiCaprio as Dom Cobb, a professional thief who specializes in conning secrets from his victims by infiltrating their dreams.", 
      "Joseph Gordon-Levitt as Arthur, Cobb's partner who manages and researches the missions.", 
      "Ellen Page as Ariadne, a graduate student of architecture who is recruited to construct the various dreamscapes, which are described as mazes.", 
      "Tom Hardy as Eames, a sharp-tongued associate of Cobb."
    ], 
    "critical_response": [
      "wildly ingenious chess game,' 'the result is a knockout.", 
      "DiCaprio, who has never been better as the tortured hero, draws you in with a love story that will appeal even to non-sci-fi fans.", 
      "I found myself wishing Inception were weirder, further out ... the film is Nolan's labyrinth all the way, and it's gratifying to experience a summer movie with large visual ambitions and with nothing more or less on its mind than (as Shakespeare said) a dream that hath no bottom.", 
      "have no idea what so many people are raving about. It's as if someone went into their heads while they were sleeping and planted the idea that Inception is a visionary masterpiece and hold on ... Whoa! I think I get it. The movie is a metaphor for the power of delusional hype a metaphor for itself."
    ], 
    "director": "Christopher Nolan", 
    "genre": "scientific", 
    "introduction": "Dominick \"Dom\" Cobb and Arthur are \"extractors\", who perform corporate espionage using an experimental military technology to infiltrate the subconscious of their targets and extract valuable information through a shared dream world. Their latest target, Japanese businessman Saito, reveals that he arranged their mission himself to test Cobb for a seemingly impossible job: planting an idea in a person's subconscious, or \"inception\". To break up the energy conglomerate of ailing competitor Maurice Fischer, Saito wants Cobb to convince Fischer's son and heir, Robert, to dissolve his father's company.", 
    "movieName": "The inception", 
    "rating": [
      "Rotten Tomatoes: 86% and average: 8.1/10", 
      "IMDB: 8.8/10"
    ], 
    "year": "2009"
  }, 
  "1": "When the elder Fischer dies in Sydney, Robert Fischer accompanies the body on a ten-hour flight back to Los Angeles, which the team (including Saito, who wants to verify their success) uses as an opportunity to sedate and take Fischer into a shared dream. At each dream level, the person generating the dream stays behind to set up a 'kick' that will be used to awaken the other sleeping team members from the deeper dream level; to be successful, these kicks must occur simultaneously at each dream level, a fact complicated due to the nature of time which flows much faster in each successive level. The first level is Yusuf's dream of a rainy Los Angeles. The team abducts Fischer, but they are attacked by armed projections from Fischer's subconscious, which has been specifically trained to defend him against such intruders. The team takes Fischer and a wounded Saito to a warehouse, where Cobb reveals that while dying in the dream would normally wake Saito up, the powerful sedatives needed to stabilize the multi-level dream will instead send a dying dreamer into 'limbo', a world of infinite subconscious from which escape is extremely difficult, if not almost impossible, and a dreamer risks forgetting they are in a dream. Despite these setbacks, the team continues with the mission. ", 
  "2": "Cobb reveals to Ariadne that he and Mal went to Limbo while experimenting with the dream-sharing technology. Sedated for a few hours of real time, they spent fifty years in a dream constructing a world from their shared memories. When Mal refused to return to reality, Cobb used a rudimentary form of inception by reactivating her totem (an object dreamers use to distinguish dreams from reality) and reminding her subconscious that their world was not real. However, when she woke up, Mal still believed that she was dreaming. In an attempt to 'wake up' for real, Mal committed suicide and framed Cobb for her death to force him to do the same. Facing a murder charge, Cobb fled the U.S., leaving his children in the care of Professor Miles. ", 
  "3": "Through his confession, Cobb makes peace with his guilt over Mal's death. Ariadne kills Mal's projection and wakes Fischer up with a kick. Revived at the mountain hospital, Fischer enters a safe room to discover and accept the planted idea: a projection of his dying father telling him to be his own man. While Cobb remains in Limbo to search for Saito, the other team members ride the synchronized kicks back to reality. Cobb eventually finds an aged Saito in Limbo and reminds him of their agreement. The dreamers all awake on the plane and Saito makes a phone call. Upon arrival at Los Angeles Airport, Cobb passes the U.S. immigration checkpoint and Professor Miles accompanies him to his home. Using his totem a spinning top that spins indefinitely in a dream world but falls over in reality Cobb conducts a test to prove that he is indeed in the real world, but he ignores its result and instead joins his children in the garden. ", 
  "wikiDocumentIdx": 5
}