{
  "0": {
    "cast": [
      "Quinton Aaron as Michael \"Big Mike\" Oher", 
      "Sandra Bullock as Leigh Anne Tuohy", 
      "Tim McGraw as Sean Tuohy", 
      "Jae Head as Sean \"S.J.\" Tuohy, Jr.", 
      "Lily Collins as Collins Tuohy"
    ], 
    "critical_response": [
      "The film received moderately positive reviews, with critics praising Sandra Bullock's performance.", 
      "It might strike some viewers as a little too pat, but The Blind Side has the benefit of strong source material and a strong performance from Sandra Bullock."
    ], 
    "director": "John Lee Hancock", 
    "genre": "Biographical, Sports, Drama", 
    "introduction": "The Blind Side is a 2009 American biographical sports drama film written and directed by John Lee Hancock, based on the 2006 book The Blind Side: Evolution of a Game by Michael Lewis.[2][3] The storyline features Michael Oher, an offensive lineman who was drafted by the Baltimore Ravens of the NFL. The film follows Oher from his impoverished upbringing, through his years at Wingate Christian School (a fictional representation of Briarcrest Christian School in Memphis, Tennessee),[4] his adoption by Sean and Leigh Anne Tuohy, to his position as one of the most highly coveted prospects in college football, then finally becoming a first-round pick of the Ravens.", 
    "movieName": "The Blind Side", 
    "rating": [
      "Rotten Tomatoes: 69% and average: 6.1/10", 
      "Metacritic Score: 53/100", 
      "CinemaScore: A+"
    ], 
    "year": "2009"
  }, 
  "1": "Michael has been in foster care with different families in Memphis, Tennessee, due to his mother's drug addiction. Every time he is placed in a new home, he runs away. His friend's father, on whose couch Mike had been sleeping, asks Burt Cotton, the coach of Wingate Christian School, to help enroll his son and Mike. Impressed by Mike's size and athleticism, Cotton gets him admitted despite his poor academic record. Later, Michael is befriended by a younger student named Sean Jr. ('SJ'). SJ's mother, Leigh Anne Tuohy, is a strong-minded interior designer and the wife of wealthy businessman Sean Tuohy. ", 
  "2": "Leigh Anne's friends wonder what she is doing; they suggest that Collins might not be safe around Michael, but Leigh Ann rebukes them. She later asks Collins how she feels about it. Collins replies that they cannot just throw Michael out. When Leigh Anne seeks to become Michael's legal guardian, she learns he was taken from his drug-addict mother when he was seven and that no one knows her whereabouts. She is also told that, although he scored poorly in a career aptitude test, he was ranked in the 98th percentile in 'protective instincts'. When Michael appears to be hesitant to use his strength and size while learning to play football, Leigh Anne tells him, as an offensive lineman, he must protect his quarterback. From that moment, Michael improves drastically, well enough to play at the college level. However, to do that, he must meet the minimum grade point average to get in so the Tuohys hire a private tutor for him, the outspoken and kind Miss Sue. ", 
  "3": "Michael runs away before the interview is over and confronts Leigh Anne about her motives for taking him in. He then proceeds to find his biological mother in Hurt Village. A gang leader welcomes him back, offers him a beer, and makes sexually offensive insinuations about Leigh Anne and Collins. When the gang leader threatens to go after them, Michael battles with him and other thugs. After thinking things over and questioning Leigh Anne, Michael tells Granger he chose Ole Miss because 'it's where my family goes to school'. Michael is accepted into college and says his farewells to the Tuohy family. ", 
  "wikiDocumentIdx": 18
}