{
  "0": {
    "cast": [
      "Tom Hanks as Woody, a pull-string cowboy doll.", 
      "Tim Allen as Buzz Lightyear, a space ranger action figure and Woody's rival, who later becomes his best friend.", 
      "Don Rickles as Mr. Potato Head, a cynical potato-shaped doll with put-together pieces on his body.", 
      "Jim Varney as Slinky Dog, a dachshund slinky toy.", 
      "Wallace Shawn as Rex, a nervous green Tyrannosaurus Rex figurine."
    ], 
    "critical_response": [
      "... razzle-dazzle technique and unusual look' ", 
      "Starting with Tom Hanks, who brings an invaluable heft and believability to Woody, Toy Story is one of the best voiced animated features in memory, with all the actors ... making their presences strongly felt.", 
      "It has the purity, the ecstatic freedom of imagination, that's the hallmark of the greatest children's films. It also has the kind of spring-loaded allusive prankishness that, at times, will tickle adults even more than it does kids.", 
      " 'a work of genius. It got people to understand what toys are about. They're true to their own character. And that's just brilliant. It's got a shot that's always stuck with me, when Buzz Lightyear discovers he's a toy. He's sitting on this landing at the top of the staircase and the camera pulls back and he's this tiny little figure. He was this guy with a massive ego two seconds before... and it's stunning. I'd put that as one of my top ten films, period."
    ], 
    "director": "John Lasseter", 
    "genre": "Comedy, Animation,Adventure", 
    "introduction": "Toy Story is a 1995 American computer-animated buddy comedy adventure film produced by Pixar Animation Studios for Walt Disney Pictures. The directorial debut of John Lasseter, Toy Story was the first feature-length computer-animated film and the first feature film produced by Pixar. Taking place in a world where anthropomorphic toys pretend to be lifeless whenever humans are present, the film's plot focuses on the relationship between Woody, an old-fashioned pullstring cowboy doll (voiced by Tom Hanks), and Buzz Lightyear, an astronaut action figure (voiced by Tim Allen), as they evolve from rivals competing for the affections of Andy, their owner, to friends who work together to be reunited with Andy as his family prepares to move to a new home. The screenplay was written by Joss Whedon, Andrew Stanton, Joel Cohen and Alec Sokolow, based on a story by Lasseter, Pete Docter, Stanton and Joe Ranft. The film features music by Randy Newman, and was executive-produced by Steve Jobs and Edwin Catmull.", 
    "movieName": "Toy Story", 
    "rating": [
      "Rotten Tomatoes: 100% and average: 9/10", 
      "Metacritic Score: 95/100", 
      "CinemaScore: A"
    ], 
    "year": "1995"
  }, 
  "1": "In a world where toys are living things who pretend to be lifeless when humans are present, a group of toys, owned by six-year-old Andy Davis, are caught off-guard when Andy's birthday party is moved up a week, as Andy, his mother, and infant sister Molly, are preparing to move the following week. The toys' leader and Andy's favorite toy, a pull-string cowboy doll named Sheriff Woody, organizes the other toys, including Bo Peep the shepherdess, Mr. Potato Head, Rex the Dinosaur, Hamm the Piggy Bank, and Slinky Dog, into a scouting mission. Green army men, led by Sarge, spy on the party, and report the results to the others via baby monitors. The toys are relieved when the party appears to end with none of them having been replaced, but then Andy receives a surprise gift   an electronic toy space ranger action figure named Buzz Lightyear, who thinks he is an actual space ranger. ", 
  "2": "Buzz impresses the other toys with his various features, and Andy begins to favor him, making Woody feel left out. As Andy prepares for a family outing at Pizza Planet, his mother allows him to bring one toy. Fearing Andy will choose Buzz, Woody attempts to trap Buzz behind a desk, but ends up accidentally knocking him out a window, and the other toys rebel against Woody by accusing him of knocking Buzz out of jealousy. Before they can exact revenge, Andy takes Woody instead and leaves for Pizza Planet. When the family stops for gas, Woody finds that Buzz has hitched a ride on the car as well, and fight, only to find the family has left without them. They manage to make their way to the restaurant by stowing away on a pizza delivery truck, where Buzz, still thinking he is a real space ranger, despite Woody's attempts to convince him otherwise, gets them stuck in a crane game, where they are salvaged by Andy's mischievous neighbor, Sid Phillips. ", 
  "3": "The duo tries to make it to the moving truck, but Sid's dog, Scud, sees them, and gives chase. Buzz gets left behind while saving Woody from Scud, and Woody tries rescuing him with Andy's RC car, but the other toys, thinking Woody eliminated RC as well, attack and toss him off the truck. Having evaded Scud, Buzz and RC retrieve Woody, and continue after the truck. Upon seeing Woody and Buzz together on RC, the other toys realize their mistake, and try to help them get back aboard, but RC's batteries become depleted, stranding them. Woody ignites the rocket on Buzz's back and manages to throw RC into the truck before they soar into the air. Buzz opens his wings to free himself from the rocket before it explodes, gliding with Woody to land safely into a box in the car, right next to Andy. On Christmas Day, at their new house, Woody and Buzz stage another reconnaissance mission to prepare for the new toy arrivals. As Woody jokingly asks what might be worse than Buzz, they discover Andy's new gift is a puppy, and the two share a worried smile ", 
  "wikiDocumentIdx": 29
}