{
  "0": {
    "cast": [
      "Gal Gadot as Diana Prince / Wonder Woman, an immortal Amazon warrior who is the crown princess of Themyscira, and the daughter of Queen Hippolyta and Zeus given to the Amazons to raise, and half-sister of Ares.", 
      "Chris Pine as Steve Trevor, an American pilot and the love interest of Diana.", 
      "Robin Wright as Antiope, the sister of Hippolyta, General of the Amazonian army, Diana's aunt and mentor.", 
      "Danny Huston as General Erich Ludendorff, an iron-fisted general of the German Army during World War I."
    ], 
    "critical_response": [
      "Never prone to stewing in solitude, and taking more notes from Richard Donner than from Christopher Nolan, Patty Jenkins' Wonder Woman provides a welcome respite from DC's house style of grim darkness boisterous, earnest, sometimes sloppy, yet consistently entertaining with star Gal Gadot proving an inspired choice for this avatar of truth, justice, and the Amazonian way.", 
      "Wonder Woman is a war movie. Patty Jenkins' first and we hope not last entry into the DC Expanded Universe is primarily set  during World War I, but while the feature doesn't balk at war-time violence, it's the internal battles of its compelling  heroine that are most vital.", 
      "Diana's scenes of action are thrilling precisely because they're meant to stop war, not to foment it; the idea of a demi-god using love to fight war might sound goofy in the abstract, but Jenkins makes the concept work."
    ], 
    "director": "Patty Jenkins", 
    "genre": "Drama, Superhero", 
    "introduction": "Wonder Woman is based on the DC Comics character of the same name, distributed by Warner Bros. Pictures.  It is the fourth installment in the DC Extended Universe(DCEU). Wonder Woman is the second live action theatrical film featuring the titular character, following her debut in 2016's Batman v Superman: Dawn of Justice. Jenkins's role as director makes her the first female director of a live-action, theatrically released comic book superhero film. The film tells the story of Princess Diana, who grows up on the Amazon island of Themyscira. After American pilot Steve Trevor crashes offshore of the island and is rescued by her, he tells the Amazons about the ongoing World War. Diana then leaves her home in order to end the conflict.", 
    "movieName": "Wonder Woman", 
    "rating": [
      "Rotten Tomatoes: 92% and average: 7.6/10", 
      "Metacritic Score: 76/100", 
      "CinemaScore: A"
    ], 
    "year": "2015"
  }, 
  "1": "In present-day Paris, Diana Prince receives a photographic plate of herself and four men taken during World War I, prompting her to recall her past. Daughter of Queen Hippolyta, Diana was raised on the hidden island of Themyscira, home to the Amazonian warrior women created by Zeus to protect mankind. Hippolyta shares the Amazonian history with Diana, including how Ares, Zeus's son, became jealous of humanity and orchestrated its destruction. When the other gods attempted to stop him, Ares killed all but Zeus, who wounded Ares and forced his retreat. ", 
  "2": "Initially forbidding Diana to train as a warrior, Hippolyta allows her sister Antiope to train Diana, only more rigorously than any other warrior. In 1918, Diana, now a young woman, rescues American pilot Captain Steve Trevor when his plane crashes off the Themysciran coast. The island is soon invaded by a German ship pursuing Trevor. The Amazons kill the crew, but Antiope sacrifices herself to save Diana. Steve is interrogated with the Lasso of Hestia, and reveals that a war is consuming the outside world, and that he is an Allied spy. He has stolen a notebook of the Spanish chief chemist Isabel Maru, who is attempting to engineer a deadlier form of mustard gas, under the orders of General Erich Ludendorff. Believing Ares to be responsible for the war, Diana arms herself with the 'Godkiller'sword, the lasso, and her armor before leaving Themyscira with Steve to find and destroy Ares. ", 
  "3": "Sir Patrick appears and reveals himself as Ares. He tells Diana that although he has subtly given humans ideas and inspirations, using Ludendorff and Maru as pawns in the process, it is ultimately their decision to resort to violence as they are inherently corrupt. When Diana attempts to kill Ares with the 'Godkiller'sword, he destroys it, then reveals Diana to be the 'Godkiller', as the daughter of Zeus and Hippolyta. He fails to persuade Diana to help him destroy mankind to restore paradise on Earth. While the two battle, Steve's team destroys Maru's laboratory. Steve hijacks and pilots the bomber carrying the gas to a safe altitude and detonates it, sacrificing himself in the process. Ares attempts to direct Diana's rage and grief at Steve's death by convincing her to kill Maru, but the memories of her experiences with Steve cause her to realize that humans have good within them. She spares Maru and redirects Ares'lightning into him, killing him. Later, the team celebrates the end of the war. In the present day, Diana sends an email to Bruce Waynethanking him for the photographic plate of her and Steve, and reaffirms her new mission to fight and give on the world's behalf. ", 
  "wikiDocumentIdx": 8
}