{
  "0": {
    "cast": [
      "Ginnifer Goodwin as Officer Judy Hopps, an optimistic rabbit from Bunnyburrow who is a newly appointed member of the Zootopia Police Department assigned to the 1st Precinct.", 
      "Jason Bateman as Nick Wilde, a red fox who is a small-time con artist.", 
      "Idris Elba as Chief Bogo, an African buffalo who is the police chief of the Zootopia Police Department's 1st Precinct.", 
      "Jenny Slate as Dawn Bellwether, a diminutive sheep who is the assistant mayor of Zootopia."
    ], 
    "critical_response": [
      "The brilliantly well-rounded Zootopia offers a thoughtful, inclusive message that's as rich and timely as its sumptuously state-of-the-art animation   all while remaining fast and funny enough to keep younger viewers entertained.", 
      "funny, smart, [and] thought-provoking. ", 
      " 'very funny, and very likable holiday treat.", 
      "[Zootopia] is constantly asking its characters to look past species stereotypes, and not use species-ist language or repeat hurtful assumptions.... This all seems clever and noble until you realize that all the stereotypes about various animals are to some extent true, in particular the most basic one: carnivores eat herbivores because it's in their nature."
    ], 
    "director": "Byron Howard, Rich Moore", 
    "genre": "Comedy, Adventure, Animation", 
    "introduction": "In a world populated by anthropomorphic mammals, Judy Hopps from rural Bunnyburrow fulfills her childhood dream of becoming a police officer in urban Zootopia. Despite being the academy valedictorian, Judy is delegated to parking duty by Chief Bogo, who doubts her potential because she is a rabbit. On her first day, she is hustled by a con artist fox duo, Nick Wilde and Finnick.", 
    "movieName": "Zootopia", 
    "rating": [
      "Rotten Tomatoes: 98% and average: 8/10", 
      "IMDB: 8/1"
    ], 
    "year": "2016"
  }, 
  "1": "After determining Nick was a suspect seen in Otterton's last known sighting, Judy blackmails him into assisting her by covertly recording his confession to tax evasion with her carrot pen. They track Otterton to a limousine owned by crime boss Mr. Big, who reveals Otterton went 'savage'   reverted to a feral state   and attacked his chauffeur Manchas. At his home, Manchas mentions Otterton yelled about 'night howlers' before the attack. Moments later, Manchas himself turns savage and chases the pair. Judy saves Nick by trapping Manchas and calls the ZPD for help, but when they arrive, Manchas has vanished. Bogo demands Judy's resignation, but Nick reminds Bogo that Judy still has ten hours to solve the case. Judy learns from Nick that he was bullied as a child when he tried to join the Ranger Scouts, who stereotyped him as untrustworthy for being a fox. ", 
  "2": "At City Hall, Bellwether offers Judy and Nick access to the city's traffic cameras. They discover Manchas was captured by wolves, who Judy surmises are the 'night howlers'. They locate the missing predators - all gone savage - imprisoned at Cliffside Asylum, where Mayor Leodore Lionheart hides them from the public while a scientist tries to determine the cause of their behavior. Lionheart and those involved are arrested for false imprisonment and Bellwether becomes the new mayor.  Judy, praised for solving the case, has become friends with Nick and asks him to join the ZPD as her partner. However, she upsets him at a press conference by suggesting a predatory biological cause for the recent savage behavior, and her comments cause tension between predators and prey throughout the city. Feeling guilty for the results of her words, Judy quits her job. ", 
  "3": "Back in Bunnyburrow, Judy learns that the night howlers are actually toxic flowers that have severe psychotropic effects on mammals. After returning to Zootopia and reconciling with Nick, the pair confront Weaselton, who tells them the bulbs he stole were for a ram named Doug. They find Doug in a laboratory hidden in the city subway, developing a drug made from night howlers, which he has been shooting at predators with a dart gun.  Judy and Nick obtain the serum as evidence, but before they can reach the ZPD, Bellwether confronts them in the Natural History Museum and takes the evidence, revealing herself as the mastermind behind a prey-supremacist conspiracy. Judy and Nick are trapped after Nick refuses to abandon an injured Judy. Bellwether shoots a serum pellet at Nick to make him kill Judy, and summons the ZPD for help, but Judy and Nick have replaced the serum pellets in Bellwether's gun with blueberries. Enraged, Bellwether threatens to frame the pair for the attacks, but Judy has recorded Bellwether's confession. Bogo and the ZPD arrive and Bellwether is arrested. ", 
  "wikiDocumentIdx": 4
}