{
  "date": "2018-02-17T00:55:40.416Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "ah mean girls. such a funny movie. have you seen it? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T00:56:51.368Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, even though I love comedies, this wasn't 1 of my faves", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T00:57:33.150Z"
    }, 
    {
      "docIdx": 0, 
      "text": "how come. thought tina fey's writing was fantastic in it. she did an amazing job adapting a self help book", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T00:58:10.124Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I loved the story & how true they made it in how  teen girls act but I honestly don't know why I didn't rate it highly as all the right ingredients were there. I cannot believe it was 2004 it was released though, 14 years ago!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:00:43.677Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I see. i didn't realize it was 14 years ago. you're right. Man. now I feel old. i remember seeing this in the theaters. i guess you disagree that it's one of top 50 teen comedies, at least according to rotten \ntomatoes", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:02:07.266Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I suppose it's just all about personal preference, my favourite American comedy films include anything with Will Ferrol & Seth Rogan so more slapstick films. I'm sure this was the movie that made Lindsay Lohan huge even though she had starred in m\novies from her early years", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:07:24.872Z"
    }, 
    {
      "docIdx": 0, 
      "text": "This was one of lindsay lohan's bigger successes. it made her very well known. although i think it made amanda seyfried well known too. she was so pretty in this film. it made a fan out of me.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:08:42.000Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well I'm glad it was as big as it was as the message it sent out to teenage girls hopefully got through to some because high school days are stressful enough to be worrying about why you are/aren't in a clique. It's good to be different!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:11:50.287Z"
    }, 
    {
      "docIdx": 0, 
      "text": "sure. That's the point of the self help book. For girls high school can be pretty tough and the movie makes it light of that andat the same time turns it into silly self examination of how kids behave. it's not without a basis that rolling stones called a comic gold. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:13:18.631Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I can still remember the pressure of that stage in life and it was a long time ago although my daughter is nearly 13 so I;m trying to make sure she has the self confidence to not feel the need to follow the in crowd as the damage it can do to teenage girls can be very serious", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:17:52.504Z"
    }, 
    {
      "docIdx": 1, 
      "text": "it's funny how the character was home schooled because her parents were zoologists working in africa. no wonder she had to be educated on the clicks in the beginning\n of the movie. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:19:09.648Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Makes hoe schooling very appealing. I love how the 'mean girls' are known as the plastics, all fake", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:21:13.360Z"
    }, 
    {
      "docIdx": 1, 
      "text": "yeah, that's the part of genius writing on tina fey's part. she's really one of the most talented comedians of our time, in my opinion", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:21:56.441Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Very clever woman. It def stood out from all the other American teen movies that were so popular around that time", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:24:25.919Z"
    }, 
    {
      "docIdx": 1, 
      "text": "yeah. more often than not, teen comedies tend to be slap stick type. this was a lot more cerebral. i wonder if the actress who played regina did any more movies. she was fantastic in the movie ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:25:35.205Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Same with the director, Mark Waters. I cannot think of any other movies he directed but surely he must have made more successful films", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:28:19.153Z"
    }, 
    {
      "docIdx": 2, 
      "text": "yeah can't recall any of his other movies. amanda seyfried did pretty well after the mean girls though ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:29:40.025Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It;s not very often a movie gets a CinemaScore A and I'm glad it did as it sent out a very positive message", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:32:14.659Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I usually don't trust those scores so much. i tend to go with viewer ratings instead of critics ratings. people have better tastes than critics. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:33:18.173Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah I agree especially about Rotten Tomatoes, I've really enjoyed movies before that if having read the reviews beforehand would have maybe put me off & resulted in me missing a good movie!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:36:35.200Z"
    }, 
    {
      "docIdx": 2, 
      "text": "yeah and critics have certain snob appeal. they tend to like movies that are artsy, although it's not all that entertaining. personally i prefer to be entertained. i mean i like some snobbish movies, but still", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:37:43.507Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm really interested to find out the where exactly this film came within the top 50 result of teen comedies", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:40:04.235Z"
    }, 
    {
      "docIdx": 3, 
      "text": "huh. that's a good question. i don't know that either. i'd say pretty high probably in the top 10. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:40:49.221Z"
    }, 
    {
      "docIdx": 3, 
      "text": "hello you there? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:45:36.787Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I will be finding out soon lol. I am going to guess that American Pie being no1.. I love the irony of Cady breaking the plastic crown at the end ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:45:37.584Z"
    }, 
    {
      "docIdx": 3, 
      "text": "american pie is the classic slap stick teen comedy. and it was good. anyway. that's all for me ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:46:17.510Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah me too, was great talking to you. Take care :)", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:47:08.613Z"
    }, 
    {
      "docIdx": 3, 
      "text": "how do we submit the task?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T01:47:19.656Z"
    }, 
    {
      "docIdx": 3, 
      "text": "This is my 1st time! Urs too?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T01:47:44.084Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-17T00:55:40.416Z", 
  "uid1LogOutTime": "2018-02-17T01:47:46.299Z", 
  "uid1response": {
    "feedback": "this partner was an idiot. it took nearly 5 minutes for the person to respond almost every time. this HIT took over 54 minutes. I think the HIT is designed very poorly. . ", 
    "response": [
      1, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-17T00:55:40.487Z", 
  "uid2LogOutTime": "2018-02-17T01:47:51.355Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1400", 
  "user2_id": "USR4873", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 11
}