{
  "date": "2018-02-07T22:51:09.439Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "I wonder why there is a gap in the Rotton Tomatoes score and the Metacritic score for Wonder Woman", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:52:21.766Z"
    }, 
    {
      "docIdx": 0, 
      "text": "hello! that is very strange, maybe they have different audiences, did you originally see this as a war movie? I guess i personally separate war movies from super hero movies", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:53:17.978Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do that too, I think of them both as different genres, even though Wonder Woman was set during World War 1.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:53:59.605Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah I could see them grouping it together, I just usually separate them, I enjoy the actors though, Gal Gadot and Chris Pine are great, how did you feel about their choices?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:54:46.349Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought the casting was great, even though this was the first time I ever heard of Gal Gadot.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:55:14.411Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I was shocked though it was so well received with cirtics considering its a DC film haha, usually Marvel runs the place", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:56:00.956Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree. I think one of the reasons it was well received was because Wonder Woman was trying to end the war, instead of contributing to a growing conflict.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:56:43.180Z"
    }, 
    {
      "docIdx": 0, 
      "text": "yeah, a lot of the marvel movies tend to just make up a conflict and then go with it instead of going off an existing one. I enjoyed it though, It is interesting the difference in opinions though, I don't know if I would see a second one ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:57:32.035Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think if Patty Jenkins directs a sequel, it would be as good as the first one. She did a great job with this movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:58:11.301Z"
    }, 
    {
      "docIdx": 1, 
      "text": "thats true, if they can keep the cast and crew together I think the chances of it being a hit increase. I believe thats more then 3 exchanges we've had about the movie now", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:58:45.174Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The document just updated for me. One of the things that caught my eye of the movie is how the time period was depicted, especially with how Princess Diana received a photographic plate whereas now we can take selfies. It is an interesting disconnect.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:00:03.608Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh mine just updated too, sorry about that. I think thats interesting and a good period for the film, I think the mythology involved behind it was very intriguing ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:01:37.475Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree. Usually whenever Greek or Roman mythology is presented in a movie it is dense and opaque, but it was easily understood in Wonder Woman.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:02:07.410Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah introducing concepts like that can definitely be hard to follow sometimes depending on how they're presented. It's interesting that zues chose amazonian warriors to protect mankind", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:03:43.126Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The way Ares was punished was also interesting, with only Zeus able to wound him in the battle.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:05:08.506Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I liked that it was only them left, zues and ares had to fight to save mankind, it made it interesting with it being in a time period where the first time in history we had a world war", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:06:24.765Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I thought it was interesting that the American pilot crashed near south America, connecting World War 1 to the Amazonian setting was done very well in the film in my opinion.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:07:30.939Z"
    }, 
    {
      "docIdx": 2, 
      "text": "yeah it seems they did a very good job of having the plot points connect with real world situations, the island then being invaded by the germans looking to advance their warfare technology really gives you a sense of good side/bad side", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:08:39.072Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Especially with the Germans trying to engineer an even deadlier version of the chemical weapons they had, I think that ties very well into everyone's ingrained mortality. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:09:35.837Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I also like that Hippolyta allowed her sister to train Diana, giving her the extra she needed to really stand out from the amazonian warriors ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:10:13.711Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I felt that was a very feminist-inspired scene, which I really enjoyed seeing in the film. That was a big dynamic in how the World War was almost exclusively fought by men, with the sole woman wanting to end it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:11:20.278Z"
    }, 
    {
      "docIdx": 3, 
      "text": "that is a really interesting point that I haven't considered, I know that the film was widely proclaimed to give a voice to feminism but that point really solidifys that", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:12:17.454Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I really didnt except Sir Patrick to Ares, its an interesting dynamic that really came out. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:13:11.479Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I thought the scene when Sir Patrick revealed himself as Ares also influenced that, where he wanted to use the Godkiller sword to destroy humanity, but Wonder Woman said no.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:13:14.559Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah I really didn't except wonder women to be the godkiller although it does make sense", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:13:46.538Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think that was another big feminist point in the movie, in my opinion. The ending of the movie was very heartfelt and connected how wars of the past influence our present when Princess Diana emailed Bruce Wayne", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:15:03.793Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah, I think the dynamic between the all the characters fits really well, linking it all togheter, from diana and bruce, to diana and ares, and ares and zues", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:16:28.301Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The casting helped make the movie incredible, the charisma and chemistry between every character showed. The scene where Steve hijacked the bomber showed that very well I think.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:17:40.975Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Steve has a really inteseting role in the movie too, providing a lot of support but still not taking over the main role ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T23:17:44.187Z"
    }, 
    {
      "docIdx": 3, 
      "text": "His character was an excellent supporting character in my opinion.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T23:19:30.753Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-07T22:51:09.439Z", 
  "uid1LogOutTime": "2018-02-07T23:19:48.737Z", 
  "uid1response": {
    "feedback": "I hope my data is helpful!", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-07T22:51:09.453Z", 
  "uid2LogOutTime": "2018-02-07T23:19:32.075Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2100", 
  "user2_id": "USR3069", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 8
}