{
  "date": "2018-03-06T17:38:25.212Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! Today we'll be discussing Batman vs Superman!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:39:06.460Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Great! Do I need to watch any other DC Comic movies prior to watching this one?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:40:09.973Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can't honestly say, however, as a critic noted \"it's better than Man of Steel but not as good as The Dark Knight\". ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:41:44.173Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Who are the lead actors? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:42:26.399Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It follows 2013's Man of Steel so you would probably need to see it just to be safe...", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:42:35.764Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Batman, Superman and even wonder woman makes an appearance!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:43:02.645Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Haha! Do you know which actors play Batman, Superman, and Wonder Woman in this movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:43:41.796Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ben Affleck plays Batman/Bruce Wayne, Henry Cavill plays Clark Kent/Superman. Gal Gadot stars in the film as well as Diane Lane as Martha Kent and Amy Adams as Louis Lane. Are you a fan of any of those actors?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:45:21.453Z"
    }, 
    {
      "docIdx": 0, 
      "text": "All but Ben Affleck. Lest super hero movie I saw him in was Daredevil and that was rough. Let's hope he's better in this. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:48:02.309Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Though, I am a Michael Keaton fan when it comes to Batman. I suspect anyone playing Batman who is not Keaton will be weird to me. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:49:01.054Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Most of the critics wasn't too fond of it, but CinemaScore have it a rating of B, which I feel is about right for this film!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:49:03.686Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Have you seen it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:49:35.551Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I have and would grade it a solid B, just as CinemaScore did. Are you a fan of director Zack Snyder?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:50:28.506Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm not sure. What other movies has he directed? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:50:56.647Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He directed Batman vs Superman. The film takes place 18 months after the battle between General Zod and Superman. Superman becomes a controversial figure while Clark Kent learns of Batman's form of justice and seeks to expose him via Daily Planet articles. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:53:17.963Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Has he directed anything else besides the Batman or Superman movies?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:54:03.316Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can't honestly say. I know he directed this film while David S. Goyer and Chris Terrio cowrote it. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:55:22.408Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Batman and Superman are enemies in this film? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:55:56.638Z"
    }, 
    {
      "docIdx": 2, 
      "text": "They are - Lex Luthor, who is obsessed with defeating Superman, basically manipulates them into fighting each other.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T17:56:47.321Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Whose side is Wonder Woman on?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T17:57:21.904Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well to be honest, Batman has Superman beat and just before he can kill Superman, Superman utters \"save martha\" to which Lane enterenters and explains Martha is his mother. Batman rescues Martha while Superman confronts Luther on the scout ship. At this point, Wonder Woman hasn't debuted yet ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T18:00:56.572Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Dang! Crazy that Batman has Superman beat! Isn't Batman just a millionaire with a lot of fancy gadgets? Superman at least has real super powers. You would think that would give him a one-up. Did Batman have kryptonite\n or something?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T18:03:26.639Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I do very much agree with you! It is puzzling but Batman has a spear he plans to kill superman with just before he utters the \"Save Martha\" line, halting Batman from killing him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T18:05:36.346Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do the join forces after that?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T18:06:29.699Z"
    }, 
    {
      "docIdx": 3, 
      "text": "they*", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T18:06:41.842Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They do thankfully - Batman actually saves Martha while Superman travels to the scout ship to Confront Luther.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T18:07:35.908Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Does he kill Luther? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T18:07:58.061Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Luther was also the one who kidnapped Martha. He doesn't kill Luther but Luther is arrested to which Batman confronts him while he's in prison, warning that he'll always be watching.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T18:09:01.090Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So basically leaving an opening for another movie in the franchise?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T18:09:41.463Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I've heard debates on Superman's and Batman's outfits in this movie. Some say that they are awesome and some say that they are ridiculous and too different form their b\neloved originals. What are your thoughts on this?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T18:11:00.415Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They do... Sadly, Superman dies, however, Bruce Wayne intends to form a team of Metahumans, starting with the Metahumans he found in Luthor's files to protect the world in Sueprmans absence. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T18:11:23.630Z"
    }, 
    {
      "docIdx": 3, 
      "text": "While it did seem like 153 minutes of a grown man whacking two dolls together, I still found it better than Man of Steel.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T18:12:44.200Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wait, Superman dies? How??", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T18:15:49.231Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well to be honest, at the end of the film, the dirt atop Sueprman's coffin does begin to levitate! I think we're at the finish line! I enjoyed chatting with you about Batman vs Superman! I highly recommend you seeing it one day. If you agree with CinemaScore, they rated it a B so I think you'll enjoy it and encourage you to watch it! Take care and have a great day!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T18:17:32.836Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-06T17:38:25.213Z", 
  "uid1LogOutTime": "2018-03-06T18:17:56.951Z", 
  "uid1response": {
    "feedback": "While I feel that Ben Affleck is a poor choice for Batman, I will probably watch this. I liked Wonder Woman and would like to see Justice League so having the back story would be helpful. ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-06T17:38:26.043Z", 
  "uid2LogOutTime": "2018-03-06T18:18:24.574Z", 
  "uid2response": {
    "feedback": "Everything went smoothly! There were a few questions he asked that I wasn't sure how to answer as it wasn't clearly stated in the document  (like how Superman dies or whose side Wonder Woman was on during the battle) so I dodged them to the best of my ability. But everything was great! I thoroughly enjoyed it! Thank you so much!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR774", 
  "user2_id": "USR3781", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 13
}