{
  "date": "2018-03-02T03:47:31.355Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello! How are you doing?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:47:54.792Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm not able to see the document that we will be discussing. Do you mind telling me what movie it is that we will be talking about?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:48:39.768Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I don't mean to pester you, but could you please confirm that you are receiving my messages?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:50:42.025Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm sorry, but I am going to have to abort the conversation within the next couple of minutes if I don't receive a response from you.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:52:06.596Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It has now been five minutes since we began this chat. If I have not heard from you within the next minute, I will have to abort this conversation. I am sorry for any inconvenience that this may cause for you.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:53:12.950Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is a film directed by Steven Spielberg in 2002 it's a bio graphical crime about the character named Frank Abagnale Whom at a young age ran away from home to commit fraud ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T03:53:29.308Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What is the name of the film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:53:44.893Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Catch me if you can", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T03:53:57.953Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I don't think I've ever seen that, but I do remember hearing about it. Have you seen it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:54:20.154Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes I've seen it and is very good film", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T03:54:39.659Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It definitely sounds interesting. I will definitely watch it at some point. Why does the character run away from home?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:55:13.109Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is starring Leonardo Leonardo DiCaprio as Frank Abignale whom is a master at check fraud and Tom Hanks is the FBI agent who chases him", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T03:55:49.242Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Leonardo DiCaprio and Tom Hanks are both incredible actors. What is his reason for running away from home to commit fraud?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:57:13.253Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He's running away from the character the Tom Hanks plays as the FBI agent agent who is trying to catch up who's trying to catch him for check fraud, Leonardo DiCaprio poses as a pan am American pilot", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T03:57:17.248Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Now that you mention it, I remember seeing the trailer for this and really wanting to see it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:58:14.331Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah it's definitely a very suspense field film and if you like Leonardo DiCaprio you will very much enjoy this film", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T03:58:34.925Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Any film that I've ever seen with him in it was really good. It's ironic that you mention him because for some reason, I've been in the mood to watch Titanic.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:59:09.334Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Has another movie now shown up on your end for us to discuss?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T03:59:45.141Z"
    }, 
    {
      "docIdx": 1, 
      "text": "This movie was really good I think it should have earned Leonardo DiCaprio the Oscar that he will deserves. This movie is definitely well watching it has Tom Hanks and Leonardo DiCaprio and it is very suspense field and will keep you on the edge of your seat the whole", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:00:24.949Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No other than that you mentioned titanic", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:01:06.312Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I like movies that keep me on the edge and that are suspenseful.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:01:19.881Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Which titanic is one of my favorite Leonardo DiCaprio movies ever", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:01:26.228Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think you would really enjoy this movie and you should give it a watch", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:01:48.423Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Me, too. I also really like Black Diamond. Catch Me If You Can will absolutely be the next movie that I watch.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:01:58.760Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I have never seen black diamond does that also star Leonardo DiCaprio", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:02:23.995Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you know if Leonardo DiCaprio was nominated for an Oscar for this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:02:24.182Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh, I'm sorry. I meant Blood Diamond. Blood Diamond does star Leonard Dicaprio, yes.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:02:57.204Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The only movie that I know of that Leonardo DiCaprio was nominated for Oscar wasThe movie named revenant", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:03:01.070Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh yes I have seen blood diamond in that was a very good movie as well", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:03:23.223Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Gotcha. I think he deserves a lot more than that.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:03:34.255Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree it is sad that it took them this long to actually earn his Oscar although the movie the revenant was quite", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:03:55.301Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Amazing", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:04:42.203Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree as well. Given that Catch Me If You Can was released in 2002, I doubt he'll earn an Oscar for that. Any time that I see that a movie will be starring him or even that he'll be in, I'm always interested in watching it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:05:03.525Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes me as well he's a very good actor and deserves a lot more credit than what he has gotten", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:05:35.654Z"
    }, 
    {
      "docIdx": 3, 
      "text": "If you are a Leonardo DiCaprio fan I suggest you also watch a film he starred in called inception", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:06:25.820Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I completely agree. You have definitely convinced me to watch Catch Me If You Can. Thank you for providing me with all of the information about it. Do you happen to know if it is available on Netflix?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:06:27.924Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I've actually seen Inception, and it is a great movie!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:06:41.704Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I wish it was available on Netflix but I'm not very sure that it is I have rented it from my movie store that is close to my home", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:06:54.021Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Okay. Well, thank you for all of the information. It looks like we are finished up with our chat. Thank you again for providing me with the information about the movie! Have a great night.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:07:47.028Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes inception is a great film and Leonardo DiCaprio and Joseph Gordon Levitt star in that film", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T04:08:12.817Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I know. I love them both, and I love that movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T04:08:34.101Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-02T03:47:31.355Z", 
  "uid1LogOutTime": "2018-03-02T04:08:36.119Z", 
  "uid1response": {
    "feedback": "I am a huge fan of suspense films, and I am also a huge fan of Leonardo DiCaprio and Tom Hanks. The way that the other person spoke about this movie has definitely made me want to watch it. In fact, I am planning on watching it this evening.", 
    "response": [
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-02T03:47:31.519Z", 
  "uid2LogOutTime": "2018-03-02T04:08:54.761Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR543", 
  "user2_id": "USR2756", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 19
}