{
  "date": "2018-02-06T20:04:07.071Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "the document i got is on the movie inception, that came out in 2009", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:05:21.726Z"
    }, 
    {
      "docIdx": 0, 
      "text": "have you seen it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:05:25.411Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No, I have not seen it", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:05:56.372Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What does the document say", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:06:21.821Z"
    }, 
    {
      "docIdx": 0, 
      "text": "it highlights some of the cast and gives  a short intro synopsis about the film, along with the ratings the film got", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:07:11.839Z"
    }, 
    {
      "docIdx": 0, 
      "text": "here is the synopsis", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:07:20.159Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Dominick \"Dom\" Cobb and Arthur are \"extractors\", who perform corporate espionage using an\nexperimental military technology to infiltrate the subconscious of their targets and extract valuable\ninformation through a shared dream world. Their latest target, Japanese businessman Saito,\nreveals that he arranged their mission himself to test Cobb for a seemingly impossible job: planting\nan idea in a person's subconscious, or \"inception\". To break up the energy conglomerate of ailing\ncompetitor Maurice Fischer, Saito wants Cobb to convince Fischer's son and heir, Robert, to\ndissolve his father's company.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:07:29.917Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Looks, like it could be either very good or a snooze", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:08:14.848Z"
    }, 
    {
      "docIdx": 0, 
      "text": "it stars leonardo dicaprio and joseph gordon levitt, it is actually one of my favorite movies ever and not sure if you have heard the theories around this film, but it is very complicated to understand and i recommend watching it at least twice if you have any interest", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:08:16.861Z"
    }, 
    {
      "docIdx": 0, 
      "text": "its kinda long i think i forget the run time but at least 2 hours ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:08:37.997Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Will check it out, I like both actors", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:08:40.569Z"
    }, 
    {
      "docIdx": 0, 
      "text": "i will share some critical responses that this document contains so you have some other opinions", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:09:19.094Z"
    }, 
    {
      "docIdx": 0, 
      "text": "\"wildly ingenious chess game,\" \"the result is a knockout.\"\n● \"DiCaprio, who has never been better as the tortured hero, draws you in with a love story\nthat will appeal even to non-sci-fi fans.\"\n● \"I found myself wishing Inception were weirder, further out ... the film is Nolan's labyrinth all\nthe way, and it's gratifying to experience a summer movie with large visual ambitions and\nwith nothing more or less on its mind than (as Shakespeare said) a dream that hath no\nbottom.\"\n● \"have no idea what so many people are raving about. It's as if someone went into their\nheads while they were sleeping and planted the idea that Inception is a visionary\nmasterpiece and—hold on ... Whoa! I think I get it. The movie is a metaphor for the power\nof delusional hype—a metaphor for itself.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:09:30.973Z"
    }, 
    {
      "docIdx": 0, 
      "text": "forgot to mention that christopher nolan directed it", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:10:01.714Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I seem to recall something about it, was talked about by my coworkers, said it was a bit trippy and like you said have to see it more than once to get it", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:11:17.479Z"
    }, 
    {
      "docIdx": 1, 
      "text": "yeah definitely, the first time you see it you will be like what did i just watch haha but after the second or third time things make a lot more sense", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:12:00.877Z"
    }, 
    {
      "docIdx": 1, 
      "text": "My problem is I see a good preview of a movie and if I don't see it right away I forget about it. Luckily these days Netflix and Prime help with that", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:12:25.295Z"
    }, 
    {
      "docIdx": 1, 
      "text": "haha true", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:12:36.282Z"
    }, 
    {
      "docIdx": 1, 
      "text": "i have a note in my notes app of movies / shows i want to see and eventually try to get through them i recommend making a list", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:12:59.827Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah always mean to do it but never do. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:13:30.257Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Besides my wife always seems to hog the tv with hallmark and lifetime and does not like anything violent", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:13:54.154Z"
    }, 
    {
      "docIdx": 2, 
      "text": "haha my girlfriend the same way", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:14:05.299Z"
    }, 
    {
      "docIdx": 2, 
      "text": "although there isnt too too much violence in this movie, though it is an action film", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:14:38.383Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I seem to recall something about an apartment in something that looked like Chinatown", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:15:10.724Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Or could be wrong and thinking something else", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:15:21.851Z"
    }, 
    {
      "docIdx": 2, 
      "text": "hmm that i do not recall", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:15:49.331Z"
    }, 
    {
      "docIdx": 2, 
      "text": "the document updated and provided me with detail of key scenes would you like me to share them with you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:16:12.964Z"
    }, 
    {
      "docIdx": 2, 
      "text": "it may spoil parts of the movie so just let me know", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:16:25.949Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I like to watch a lot of movies and tend to get them mixed up at times. Yes I would like to see them", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:16:37.765Z"
    }, 
    {
      "docIdx": 3, 
      "text": "When the elder Fischer dies in Sydney, Robert Fischer accompanies the body on a ten-\nhour flight back to Los Angeles, which the team (including Saito, who wants to verify their\n\nsuccess) uses as an opportunity to sedate and take Fischer into a shared dream. At each\ndream level, the person generating the dream stays behind to set up a \"kick\" that will be\nused to awaken the other sleeping team members from the deeper dream level; to be\nsuccessful, these kicks must occur simultaneously at each dream level, a fact complicated\ndue to the nature of time which flows much faster in each successive level. The first level is\nYusuf's dream of a rainy Los Angeles. The team abducts Fischer, but they are attacked by\narmed projections from Fischer's subconscious, which has been specifically trained to\ndefend him against such intruders. The team takes Fischer and a wounded Saito to a\nwarehouse, where Cobb reveals that while dying in the dream would normally wake Saito\nup, the powerful sedatives needed to stabilize the multi-level dream will instead send a\ndying dreamer into \"limbo\", a world of infinite subconscious from which escape is extremely\ndifficult, if not almost impossible, and a dreamer risks forgetting they are in a dream.\nDespite these setbacks, the team continues with the mission.\n\n2. Cobb reveals to Ariadne that he and Mal went to Limbo while experimenting with the dream-\nsharing technology. Sedated for a few hours of real time, they spent fifty years in a dream\n\nconstructing a world from their shared memories. When Mal refused to return to reality,\nCobb used a rudimentary form of inception by reactivating her totem (an object dreamers\nuse to distinguish dreams from reality) and reminding her subconscious that their world was\nnot real. However, when she woke up, Mal still believed that she was dreaming. In an\nattempt to \"wake up\" for real, Mal committed suicide and framed Cobb for her death to force\nhim to do the same. Facing a murder charge, Cobb fled the U.S., leaving his children in the\ncare of Professor Miles.\n3. Through his confession, Cobb makes peace with his guilt over Mal's death. Ariadne kills\nMal's projection and wakes Fischer up with a kick. Revived at the mountain hospital,\nFischer enters a safe room to discover and accept the planted idea: a projection of his dying\nfather telling him to be his own man. While Cobb remains in Limbo to search for Saito, the\nother team members ride the synchronized kicks back to reality. Cobb eventually finds an\naged Saito in Limbo and reminds him of their agreement. The dreamers all awake on the\nplane and Saito makes a phone call.\nUpon arrival at Los Angeles Airport, Cobb passes the U.S. immigration checkpoint and\nProfessor Miles accompanies him to his home. Using his totem—a spinning top that spins\nindefinitely in a dream world but falls over in reality—Cobb conducts a test to prove that he\nis indeed in the real world, but he ignores its result and instead joins his children in the\ngarden.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:17:13.881Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I got the last part of it cant seem to scroll up to read the full thing. starts with \"remains in Limbo to search for Saito\". Why were they in the dream world in the first place to steal something?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:19:02.366Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Through his confession, Cobb makes peace with his guilt over Mal's death. Ariadne kills\nMal's projection and wakes Fischer up with a kick. Revived at the mountain hospital,\nFischer enters a safe room to discover and accept the planted idea: a projection of his dying\nfather telling him to be his own man. While Cobb", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:21:09.415Z"
    }, 
    {
      "docIdx": 3, 
      "text": "that is the top piece before \"remains in limbo\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:21:21.611Z"
    }, 
    {
      "docIdx": 3, 
      "text": "they go into a dream to obtain information from various individuals that have highly confident info", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:23:45.317Z"
    }, 
    {
      "docIdx": 3, 
      "text": "at a high level. but it is very complex", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:23:55.085Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Now makes a little more sense, will have to see this one when the kids are not around and have some piece and quiet. Cant watch this type of movie otherwise if I miss parts. Let me tell you enjoy movies now cause once you have kids you'll be a watching a lot of spongebob lol", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:24:27.200Z"
    }, 
    {
      "docIdx": 3, 
      "text": "haha thanks for the advice", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:24:42.454Z"
    }, 
    {
      "docIdx": 3, 
      "text": "have you done this hit before?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:26:43.639Z"
    }, 
    {
      "docIdx": 3, 
      "text": "no ive never done one like this", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:26:54.662Z"
    }, 
    {
      "docIdx": 3, 
      "text": "how about you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:27:03.551Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Pays well and easy, first for me as well. Looks like we can finish. It was nice talking to you.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:27:29.946Z"
    }, 
    {
      "docIdx": 3, 
      "text": "likewise, take care", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:27:39.425Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-06T20:04:07.071Z", 
  "uid1LogOutTime": "2018-02-06T20:27:43.601Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-06T20:04:07.073Z", 
  "uid2LogOutTime": "2018-02-06T20:27:41.653Z", 
  "uid2response": {
    "feedback": "sdrawkcab gnihtyreve gnipyt si xob sihT .sdrawretfa eivom eht ees ot tnaw em edam dna lufpleh yrev saw eH .resu rehto eht htiw noitatsrevnoc eht deyojne I ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3032", 
  "user2_id": "USR4628", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 5
}