{
  "date": "2018-02-13T20:42:40.299Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:43:57.089Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wonder Woman has a really good rotten tomatoes score, which I always look up before watching any movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:44:20.859Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That's cool! I understand this movie has Gal Gadot as Wonder Woman. While not familiar with her before this I thought she did a great job as the Crown Princess of Themyscira.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:45:32.482Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, she did, and I really like that it is a war movie starring a strong female.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:46:47.488Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Warner Bros. Pictures always makes pretty good movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:47:33.633Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do too. I also liked it was set during WW1. You don't see many movies in that time period. Danny Huston was really over the top, in the best way, as General Lundendorff. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:48:01.278Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree with that. I also am a big fan of DC Comics and this is one of the entries in their extended universe. I don't know if you saw it but ever since Diana's appearance\n in Batman v Superman: Dawn of Justice I wanted to see more of her.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:48:52.455Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That was pretty romantic when pilot Steve Trevor crashed offshore of the island and Diana Prince rescued him.  You certainly don't see females rescuing males very much in movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:49:20.394Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I noticed too that the director is Patty Jenkins, which is a female.  That's kinda cool too.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:50:42.932Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was nice how the movie flipped the script and made the strong woman rescue the weaker male instead of the opposite you always see in movies. I think the critics responded to that too. There's a real sense of grounding about how war is bad but without beating you over the head with it. Ms Jenkins did that very well.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:51:30.625Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The year is 2015, but it seems just like yesterday I was watching this\n movie in the theater.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:52:19.321Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree with Richard Donner that this is a good break from the darkness I'm used to seeing in the DC universe. People die still, but without the grimness of other entries. Yeah! It's hard to believe it's been almost 3 years since this movie came out.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:53:22.586Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That was pretty neat that Zeus created an island with all women to protect mankind.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:54:09.706Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What did you think of the scene where Diana takes the picture with the four soldiers and how it ties into her larger history?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:54:37.186Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It was a good idea. I also liked the concept of Ares, the God of War, getting jealous of humanity and trying to undo us.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:55:12.270Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I liked all of the movie. It gave me chills watching it.  I see it received a CinemaScore of an A.  That's really good. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:55:51.674Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I was surprised the Metacritic score was only 76/100 though. I think was movie was stronger than that rating suggests, still I suppose some people will find fault with anything.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:56:40.397Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I know it must have been hard for her to leave her home to end all of the conflict, but she knew she had to do it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:56:57.088Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's true. What did you think about how the old world and the new clashed when the German Army ship landed at Themyscira? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:57:55.710Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That was awful when Antiope sacrificed herself to save Diana and was killed.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:58:02.998Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I was just thinking along the same lines. It's a nice way of giving her purpose though since Steve's mission as an Allied Spy doesn't immediately mean anything for her or the other Amazons.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:59:01.367Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was chaotic and unexpected. Diana got serious though before she left and had herself armed.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:00:10.672Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was good of Diana's mother to let Antiope train her though or she would have been in a mess.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:01:02.946Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's true. I enjoy how her determination to defeat Ares and avenge her mother mirrors Steve's plan to make sure Isabel Maru, Spanish chemist, can't make a stronger form of mustard gas to use against the Allies.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:01:21.497Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I loved how Sir Patrick turned out to be Ares! It looked like he was the only want that actually wanted peace in the earlier sections of the film when he's actually playing at politics to make the war even worse.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:02:05.154Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I knew she wasn't going to give into Ares to help him destroy mankind to restore paradise on Earth.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:03:00.904Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Me too. I thought it was a great twist to find out SHE was the Godkiller though and not her sword. It was good at underlining the message of believing in yourself.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:04:03.604Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That was unreal when it showed her recalling memories of her experiences with Steve.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:04:41.414Z"
    }, 
    {
      "docIdx": 3, 
      "text": "She knew all humans had good within them.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:04:55.781Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was, and it was all the sadder when you see him fly that bomber high enough away to make sure the gas Maru had developed couldn't hurt anyone and then sacrifice himself by blowing up the plane.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:05:36.804Z"
    }, 
    {
      "docIdx": 3, 
      "text": "At least she had a photogenic plate of her and Steve. She had something to hold on to to remember him by.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:06:14.568Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It all turned out good in the end. She kept on being herself and fighting and giving to the world as a whole.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:06:49.067Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's true and it was a nice build up to restoring her faith in humanity. I enjoyed seeing how she told Batman in the present day she'd help fight for the world's benefit again.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:06:51.239Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:07:04.262Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I kinda thought it was sad when Ares killed all but Zeus. Made me feel sorry for him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:07:36.573Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I feel like Ares was probably corrupt like Lundendorff and Maru and couldn't see past his own anger. That's why he, like they, picked violence to solve their problems and to process their grief.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:08:23.615Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I just noticed German Army is underlined in blue. Guess you can click on that and read more about the German Army during World War I.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:08:42.315Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was good the war came to an end and had a good ending though.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:09:45.240Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Mm hmm, but I don't know what link, if any, that has to the task at hand besides background. In spite of the comedic moments in this at times this movie is certainly properly called a drama. Some of the scenes in 1918 are very intense.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:10:10.752Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah and I feel like the actions of Isabel Maru in making the nerve gas and the actions of Steve Trevor in stopping it from being used is a nice way to see the good and bad sides of humanity.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:10:45.338Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, it does seem kind of weird for it to be labeled as a drama.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:11:25.022Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It says Superhero underneath it though.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:11:44.776Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-13T20:42:40.299Z", 
  "uid1LogOutTime": "2018-02-13T21:11:34.378Z", 
  "uid1response": {
    "feedback": "The conversation seemed to go very smoothly and we exchanged at least three replies on each and more than that on other sections.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T20:42:40.335Z", 
  "uid2LogOutTime": "2018-02-13T21:12:02.543Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4881", 
  "user2_id": "USR953", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 8
}