{
  "date": "2018-04-02T15:20:10.424Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! So how did you like Iron Man?", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:20:35.949Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I just started, please give me a second, please.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:21:27.365Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was very amazing how Tony made his exoskeleton!\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:23:07.655Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Agreed. He was a genius inventor! Was he your favorite character?", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:23:54.061Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Friday did good at hiding her feeling for Tony and he did not notice.  He was not my favorite due to that piece.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:25:40.715Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I understand. I didn't really have a favorite as I liked them all but Downey Jr's portrayal of Tony Stark and Iron Man was perfect. I also enjoyed Jeff Bridges as Obadiah Stane. He was the perfect villain!", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:28:01.834Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That he was.  I felt as though he was the tony I have always read about.  The villain had me sitting on the edge of my seat.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:29:34.536Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Agreed. So did you feel the score of  A that Cinemascore gave the film was appropriate?", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:30:32.392Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes,  It was all put together well.  Do you think it was a military thriller?", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:31:55.967Z"
    }, 
    {
      "docIdx": 1, 
      "text": "In all honesty, I've always referred to it as a superhero film but I do see how it could be seen as a military thriller based on the fact that Stark Industries was the chief weapons manufacturer for the military!", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:33:47.750Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It was a good crossover.  I can see both in it.  It was a good adult direction for the movie to go into so we did not feel like a singalong was going to come on screen.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:36:02.727Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So true! Did you enjoy the Jericho missile demonstration in the beginning? It was exciting but it took a turn for the worst when their convoy was ambushed!", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:37:13.048Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That was not my favorite part.  I knew it would happen somehow, but kinda wished I was watching after that event happened.  I assume he wished he knew that the missile worked another way.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:42:06.534Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I know what you mean. I thought it was sad to see Stark critically wounded by one of his company's own weapons. So what did you think of the imprisonment scene in the cave?", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:44:16.737Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You have to have a villain.\n  They were kinda nice about letting him get his wound treated and not killing him or letting him die.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:47:45.227Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Agreed. I'm glad Yinsen was there to implant the electromagnet into Tony's chest to keep the shrapnel from reaching his heart. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:49:20.876Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was a great test of his armor to fly to Afghanistan without a shorter first test flight.  Should he have revealed hi\ns secret identity to Rhodes?", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:52:43.985Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think he did the right thing by revealing his identity because it ended the attack. No telling what would have happened if he hadn't! It was all worth it though to save those innocent villagers!", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:54:31.555Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Having a love interest like Potts comes in handy when asking to do an illegal activity like hacking into a database and not be turned in in\nstead.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T15:58:10.607Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Agreed. It was justified as well. I was surprised to find out Stane hired Ten Rings to kill Tony. He was Tony's mentor and friend!", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T15:59:48.695Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That was a horrible way to reveal the unexpected turn in the plot.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T16:02:04.098Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So true! Thankfully Ten Rings reneged on Stane! I enjoyed seeing SHIELD in the film! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T16:03:55.355Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I thought Shane was nice until he takes the arc reactor from Stark's Chest.  Good thing Tony had a the original for backup.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T16:06:57.840Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I know, right? Thankfully Stark was able to get to the original to replace it! Stane and State's fight was epic! Did you enjoy their battle?", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T16:08:39.881Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, it was action-packed. I wonder why SHIELD could not handle a man in armor though?  I thought that they were supposed to deal with that kind of thing better than a rich playboy Stark.  It is good he defies suggestions from SHIELD for everyone's sake.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T16:11:57.375Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah going against their suggestions and admitting he was Iron Man was a huge surprise!", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T16:12:59.451Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Hey, now they know.  Now he can maybe donate money to the charity Iron Man once he creates it.  It would help fund it and be a great tax deduction. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T16:16:03.331Z"
    }, 
    {
      "docIdx": 3, 
      "text": "With thrilling entertainment, \n20 min goes to past an hour quickly.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T16:17:40.850Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Very true! I really thought Jon Favreau did a great job directing this film!", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T16:17:54.368Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well I enjoyed discussing the 2008 superhero movie Iron Man with you! Have a great day!", 
      "uid": "user2", 
      "utcTimestamp": "2018-04-02T16:18:21.500Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That he did.  Goodby and it was good to talk to you.", 
      "uid": "user1", 
      "utcTimestamp": "2018-04-02T16:18:47.390Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-04-02T15:20:10.424Z", 
  "uid1LogOutTime": "2018-04-02T16:18:49.893Z", 
  "uid1response": {
    "feedback": "ConAI kinda makes me think I may have been talking to a robot rather than a person.  It was a good and fun conversation.  I wished the conversation could continue going.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-04-02T15:20:10.742Z", 
  "uid2LogOutTime": "2018-04-02T16:18:39.741Z", 
  "uid2response": {
    "feedback": "Everything was perfect! I thoroughly enjoyed it! Thank you so much!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR217", 
  "user2_id": "USR3781", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 21
}