{
  "date": "2018-02-13T18:43:28.699Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi. What did you think about this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:45:26.610Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I didn't really like Zootopia, specifically because the message about stereotypes confused me. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:45:34.013Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought the message was confusing too. Why did it confuse you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:45:55.161Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was confusing because it seemed like the stereotypes were based on what was actually true about animals. Lions are carnivores and that's normal.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:46:56.391Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hmm that's a good point. I think relating racism to animals doesn't really work because the animals react out of justified fear. If i saw a lion on the subway I would also be scared", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:47:41.170Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It works in that world but comparing it to real world racism makes it messy.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:48:03.465Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Haha yes, I agree. I also thought the relationship between Judy and Nick raised some questions for me\n. But again,  I suppose since this is for younger viewers, they wouldn't think too much about it. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:49:37.860Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you like animated movies?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:50:43.712Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, young kids won't think much on it. However, if a kid were to ask questions about it I think it would be good to have a conversation about it. Animals act because it's in their nature but humans build rules and concepts off of what they know and learn.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:51:00.011Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do like animated movies!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:51:07.467Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Do you think this one was good enough to receive a 98% on Rotten Tomatoes, compared to other animated movies?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:51:46.873Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think so. If 98% of the people who view your film like it then you did your job as a movie maker.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:52:28.336Z"
    }, 
    {
      "docIdx": 1, 
      "text": "In the scene where Otterton went \"savage,\" a friend of mine believes the savage state in this universe of Zootopia isn't the natural one. What do you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:54:00.535Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What do you mean by the natural one?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:54:21.938Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That in real life animals are predators, but in Zootopia, the savage thing is like a sickness. Like a flu or something.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:55:05.402Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh that's interesting. I dont know what to think to be honest. The savage thing was used as a story element to further the plot along. However if an animal in real life were pushed to the brink it would react the same way.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:56:12.378Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Actually it is kind of strange. The movie says that animals evolve out of savagery but that could also be another allegory for racist myths.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:56:56.454Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, but then in this movie they really did seem to evolve from real savagery, and not just percei\nved savagery. What do you think about Nick being bullied for being a predator? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:58:03.274Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It made me sad. But I think the scene was real  done. And a kid who is bullied would watch it and relate more to Nick.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:59:51.548Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Showcasing the bullying and microaggressions the animals face building up to tension and fallout between Judy and Nick is a nice example of how actions and words can affect people.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:01:42.140Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's interesting. Well, what about when Judy says at the press conference that the attacks are happening because of the predators. How did you feel about that scene? I didn't like it, If the whole racism allegory was still in play, I don't think Nick should've ever forgiven her for a thing like that. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:02:02.085Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It made me mad but it's realistic. Judy, being the one in power, reduces the savagery issue to it being \"biology.\" Even though the predators worked to undo that animals in power can undo all of that with ignorant statements.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:03:26.052Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It is a Disney movie. I agree Nick shouldn't have forgiven Judy but the movie teaches forgiveness by having Nick look past that.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:04:17.678Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I see. Well, on the lighter side -- I really liked Jason Bateman as Nick! I l think he brought a lot of spunk to that character.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:05:29.067Z"
    }, 
    {
      "docIdx": 2, 
      "text": "They're friends but there's a clear power imbalance between the two of them. Nick is with Judy because she blackmails him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:05:32.827Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, the actors were great! I liked the chubby white tiger.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:05:48.381Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes! Yeah I was thinking about the blackmail. It was odd because I can't understand what the message for kids is!? Manipulate people into doing what you want?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:06:46.236Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The cops will be your friends whether you want them to or not.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:08:08.774Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well that's terrifying! How about the scene where Doug is making drugs in the laboratory. Did you like that scene?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:09:03.822Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah I found the image of a sheep making drugs to be funny. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:09:27.158Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's a nice hint, too. The sheep - or the prey - were the bad guys all along.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:10:24.629Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, if I recall, I think it was kind of similar to Breaking Bad. I also really liked the doublecross scene where the gun was filled with blue berries. We got to see some hilarious acting on Nick's part.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:10:45.347Z"
    }, 
    {
      "docIdx": 3, 
      "text": "True! Nice turn of events.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:11:22.306Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I like the animation. The sheep fur being bouncy was cool.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:12:53.778Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I guess the Bellwhether character being the bad guy was a kind of reversal of expectations. She was a lamb. So the sheep and lambs are usually innocent, but in this movie they defied expectations.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:13:20.152Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah they use audience expectations against you. A sheep in sheep's clothing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:13:56.473Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Even when I saw Doug in the lab it still didn't occur to me the other sheep would be the bad guy.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:14:37.927Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yep. Do you think this movie would have worked without the anthropomorphic\n animals? Like, if they were just humans?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:14:45.917Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That would be a very different movie if they relied on the \"savagery is biological\" thought. I don't think Disney would have made that movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:15:29.705Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Haha, no way. But maybe they should just be overt about the message instead of all these confusing comparisons. Okay, well, anything else you want to add?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:16:06.768Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, I think the movie does a good job of relaying the whole \"racism is bad\" message to a young audience. Kids who grow up knowing there's injustice won't be so ignorant and will want to help.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:17:05.338Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't think so. To me, it won't work at all. Because if they're going to get the message, they'll also get the message that people are biologically different unless they're on some type of serum! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:19:15.967Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-13T18:43:28.699Z", 
  "uid1LogOutTime": "2018-02-13T19:20:24.909Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T18:43:28.704Z", 
  "uid2LogOutTime": "2018-02-13T19:19:36.379Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR85", 
  "user2_id": "USR209", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 4
}