{
  "date": "2018-02-08T23:18:21.745Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:20:20.542Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello. What did you think of Zootopia?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:20:44.644Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It sounds like a very interesting movie, I really like that they used anthropomorphic\n animals.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:21:25.724Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes! The anthropomorphic animals were very interesting. The movement and quality of the movie was fabulous.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:22:16.252Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really like the message of looking past stereotypes, it was a great was to present how prejudice and assumptions can hurt others.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:23:26.966Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely, I was very impressed. Though it was a children's comedy, the movie had large themes and important points. Stereotypes are harmful and can drive people to extremes like \nwhat happened in the movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:25:00.626Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, definitely. The characters were very relate able and the story line was really engaging. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:26:02.332Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you have a favorite moment from the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:28:08.106Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm not sure if I have a favorite moment, but I really enjoyed watching Nick's character development through the movie. What about you, do you have a favorite moment?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:31:43.826Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Nick's character really did develop. I think my favorite moment is when Judy is assigned to give out tickets and she tickets hundreds of cars. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:32:43.472Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I liked that she did the best she could even thought the job sucked and she did a crazy good job. Do you generally like this type of movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:34:54.751Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I think that movies that provoke thought are great. Talking about our society as a whole is important. Like in key scene number one where they are calling certain animals bad names. It is important to think about what we are saying to others. What about you, d\no you generally like this type of movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:36:35.081Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I really enjoy animated movies and shows in general. I know that Zootopia was really highly rated by critics, do you usually pay attention to that before watching a movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:37:37.701Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Animated movies and shows are great. I sometimes do pay attention. It depends. If I really want to watch a movie, I will not care too much. However, if I am going in theatres or to pay for a movie, I like researching it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:39:18.469Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:39:22.829Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Pretty much the same haha. If it's a genre I'm really into then I don't usually care what the ratings are. The animation and music was really good in this one too. I can't really think of any part of it I didn't enjoy.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:41:25.870Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The only thing is that I thought it did get a little dark at times. It was amazing quality. Did you agree with the Rotten Tomatoes score? I would say it was accurate.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:42:44.812Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah it did get a little dark, my kids got scared a few times but they are 3 and 5. I think it's a pretty awesome rating, like almost perfect. It got pretty tense after Judy had the press conference.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:44:31.980Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I could definitely see how they would get scared. It was intense. It really made you care about the characters.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:45:20.135Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah I agree. I think one downside for me was it started to get long for my kids, I think it was little long for younger kids.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:46:16.604Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I could see that. The plot got kind of complicated and a little drawn out.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:47:36.543Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes it did get complicated, which was great for older kids and adults. I like that they put so much detail into it but wish it was a little shorter.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:48:45.010Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I need a little recording carrot pen like Judy had.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:50:05.161Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's true. It a good thing to have a lot of detail. I loved that carrot pen! It was hilarious. Very convenient.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:50:41.251Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was, I think it would be handy to have in real life. How do you think the voice actors did?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:51:44.420Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think the voice actors did a great job. Everyone had a distinct tone and expressed themselves very well. It adds a lot to a movie when the voice actors are so committed as they were in Zootopia. \nWhat did you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:53:04.202Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think they did really great as well, each character sounded very unique and easy to recognize. The ending was a really good plot twist too.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:54:10.840Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I did not suspect the sheep was behind it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:54:24.269Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I had a theory that she could have been behind it. She was acting so sweet, but I got that it was a little fake. Again, the actors were great. I really enjoyed Nick's acting.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:56:00.733Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Me too, they did a really great job in the art of each animal too. It was very cool the size differences you'd see.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:56:59.723Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Okay we can finish the conversation now! Thanks, it's been fun!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:57:26.890Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thank you! Have a good one! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:57:37.864Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-08T23:18:21.745Z", 
  "uid1LogOutTime": "2018-02-08T23:57:40.726Z", 
  "uid1response": {
    "feedback": "This took much longer than the expected 20 minutes but that's probably because we responded to each other slower.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-08T23:18:21.767Z", 
  "uid2LogOutTime": "2018-02-08T23:57:42.364Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4545", 
  "user2_id": "USR4479", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 4
}