{
  "date": "2018-03-02T22:42:37.543Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T22:43:11.575Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello. I think you should watch a movie called The Social Network.  It got a 96% on Rotten Tomatoes and a metacritic score of 95 out of 100.  Plus it stars Jesse Eisenberg as Mark Zuckerberg.  It is a biographical drama about the founding of Facebook.  Critics have even called it, \"the movie of the year\".", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T22:45:11.941Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I've heard about it, but I never got a chance to watch it when it was in theaters.  How accurate to the true story do you think it is?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T22:46:27.275Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well, one critic was noted as saying that the biographical part takes liberties with its subject.  So I would believe that it has been a little exaggerated upon to make for better cinema.  Also neither Zuckerberg nor any other Facebook staff were involved with the project.  It was however adapted from a book, so I guess that would depend on how accurate the book portrayal was to real life.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T22:49:19.537Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That makes sense, and I wasn't sure if Zuckerberg was actually involved or not.  I can't place the actor that plays him, but I know I've heard his name.  What other movies has he been in lately?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T22:50:23.153Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am not sure of any other movies that Jesse Eisenberg has been in although the name does sound familiar to me as well.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T22:51:53.784Z"
    }, 
    {
      "docIdx": 0, 
      "text": "He looks like the guy from Zombieland, maybe that's where I've seen him.  Are there a\nny other major actors in the movie that you know of?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T22:53:06.786Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes.  Justin Timberlake is in this movie.  He is the only other name I am familiar with but this movie also stars Andrew Garfield, Armie Hammer, and Max Minghella.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T22:54:48.842Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I never knew Justin Timberlake was in it.  Does the soundtrack have any of his music in it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T22:55:41.387Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do not have any information on the soundtrack.  But I think any soundtrack can be improved by Justin Timberlake.  Another thing that surprises me is that this movie is already eight years old, it was released in 2010.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T22:57:45.381Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Really?  Wow, you're making me feel incredibly old right now.  Does the movie get into any of the controversies around Facebook itself, like how they handle news feeds or anything like that?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T22:59:05.775Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Based on the material I am given about this movie, I can see that it discusses some controversies regarding Zuckerberg hacking into college databases to steal photos of female students and then allowing his site visitors to rate their attractiveness.  He received six months of academic probation for this.  Zuckerberg then goes on to revamp the site into a social network aimed at dating for Harvard students.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:02:07.233Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh yeah, I remember when that news came out.  He only got academic probation for that and nothing else?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T23:03:18.698Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That is how it is portrayed in the movie.  The traffic the stunt created even crashed parts of Harvard's computer network.  I am surprised one would not be expelled for hacking into such a database.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:06:18.446Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, especially with all those private records.  But I guess people are more sensitive about that now.  Does the movie get into his personal life at all?  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T23:07:29.054Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I am not sure if the movie gets into his personal life at all but the movie does start when Zuckerberg is 19 years old.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:08:22.213Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That makes sense.  Anything else especially interesting about the movie I should know?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T23:08:49.526Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It does discuss the lawsuits that facebook eventually faces although I do not have more details on what those lawsuits pertained too.  It was Napster co-founder Sean Parker that first sees Facebook as a \"billion dollar\" vision.  It is Timberlake that portrays Parker and Parker is the one for taking Facebook from being for United States college kids to being accessible globally.  At this time Zuckerberg is still managing Facebook from out of a house.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:11:58.289Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh interesting - so Zuckerberg had the concept, but it was Parker that actually monetized it and made it global?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T23:13:09.244Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes.  Also, it used to be called Thefacebook but Parker was the one who decided to change it to just Facebook.  It is around this time that facebook started being used as a verb.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:14:18.600Z"
    }, 
    {
      "docIdx": 2, 
      "text": "You know, Parker's movie might be interesting too.  Did you actually see the movie when it came out in theaters?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T23:15:29.187Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I did not actually see this movie when it came out in theaters, although I've always meant to.  My instructions are to read this one page document they have given me on this movie with some key points and respond only with answers I can gleam from this short document.  I agree Parker's movie would also be interesting.  I hadn't actually heard of him until I read this document.  The director was David Fincher.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:17:49.583Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, I hadn't known about Parker until you mentioned him either.  I'm not familiar with that director, do you know what other movies he's been involved in?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T23:19:02.656Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I am also not familiar with him.  I just received new information that the film is actually frequently cut with scenes from the Winklevoss twins' lawsuits against Zuckerberg.  Apparently the twins did most of the work and Zuckerberg took most of the benefits.  Apparently Zuckerberg settled because his lawyer found his callous attitude would make him unsympathetic to a jury.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:21:38.159Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's interesting, and not too surprising really.  As much as he tries, he doesn't seem to be terribly personable.  Whatever happened with the lawsuits?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T23:23:10.121Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The most I know that came of the lawsuits was that he settled with them out of court for an undisclosed amount of money.  He seems to be painted as a rather selfish person in this movie.  He had many people come after him claiming they did not get the money they deserved once Facebook became incorporated.  It seems he settled with all of them rather than fight it.  I assume this happens to a lot of people once an idea takes off and a large amount of money starts coming in.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:26:59.196Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's kind of like winning the lottery, you find family and friends that you never knew you had. Do you think the movie portrays him fairly, or does it seem to be really biased against him personally?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T23:28:04.393Z"
    }, 
    {
      "docIdx": 3, 
      "text": "From what I can gather, it does appear to be rather biased against him personally.  I do not think they tried to tell his point of view or give an unbiased opinion.  I think it was more dramatic to paint the Facebook father as a bad guy.  Although it may cause you to have some sympathy towards him as it looks like after his fame he had a lot of new problems to deal with.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T23:30:36.161Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-02T22:42:37.543Z", 
  "uid1LogOutTime": "2018-03-02T23:31:40.558Z", 
  "uid1response": {
    "feedback": "I'm behind on so many movies right now, I don't think I'll actually make time to watch this one.  ", 
    "response": [
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-02T22:42:37.567Z", 
  "uid2LogOutTime": "2018-03-02T23:33:02.397Z", 
  "uid2response": {
    "feedback": "The user left the chat.  I am hoping we had an adequate number of responses as we did get to the end of the document.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2256", 
  "user2_id": "USR3456", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 17
}