{
  "date": "2018-03-20T01:36:10.335Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Good evening!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:36:25.414Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Good evening!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:36:38.791Z"
    }, 
    {
      "docIdx": 0, 
      "text": "So I normally don't like Leonardo DiCaprio, but I think he was great in The Wolf of Wall Street.  What did you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:37:09.886Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think he did alright, but I think most of the credit goes to Martin Scorsese", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:38:12.231Z"
    }, 
    {
      "docIdx": 0, 
      "text": "True.  What a great director.  I didn't expect Jonah Hill in that type of role.  I also think Margot Robbie was perfectly cast in this movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:38:53.568Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I was just about to say that! I think she played Naomi Lapaglia really well. What did you think about the FBI agent? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:40:04.884Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I had never heard of Kyle Chandler, who played the FBI agent.  But I think he did ok.  I was surprised to see Matthew McConaughey in the movie too!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:42:45.462Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can't believe they didn't give McConaughey a bigger part. There was review about how the characters only seemed interesting because they were high. Do you feel like that was good review of them?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:44:53.611Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did think that the drug use got to be a little too much.  But I guess they really want to harp on how influential it was.  Most reviews seemed to give it a C.  I think I may have been more inclined to give it a B.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:46:23.202Z"
    }, 
    {
      "docIdx": 1, 
      "text": " I do agree that they judged it too harshly. the drug use was a bit much, I wish they would have dug deeper into other aspects of Belforts downfall. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:49:33.520Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That whole stockbrocker lifestyle is crazy.  Drugs and constantly working is so crazy.  Do you remember the scene about when Jordan takes a job in penny stocks?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:51:27.912Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do remember that scene, he took the job on Long Island. What did you think about his pitching style when he got hired there?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:53:24.092Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He was so aggressive but he got the money made!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:55:01.851Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I wish I had those skills.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:55:11.035Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He did, I feel like he was overly aggressive though, but maybe he felt like he had to after Black Monday. that had to be a crazy time.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:56:51.596Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah I can't believe he got fired then.  It's hard to believe that this was all set in 1987. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:58:30.992Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It doesn't feel like it should be 1987, feels more like a Greet Depression movie. That had to be crazy to find out your career had ended so suddenly ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:59:46.785Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can't believe that he met his wife Naomi by having an affair with her on his first wife.  All while using prostitutes and more drugs.  I don't know how he could be such a good business man and still have all this going on in his life.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:01:48.636Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I know! I can't believe she married him after he left his wife. Did you see where he made 22 million in three hours! How crazy was that?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:05:11.791Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I know!  Was something to do with getting Steve Madden!  I like how he opened up a Swiss bank account to hide money.  People always do that in the movies...I've never known anyone in real life to do that ha!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:06:51.465Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can't believe he got his friends wife and in-laws to smuggle the money over there! I know I wouldn't be able to do that. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:07:58.958Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I guess they were getting a chunk of it!  I love that he had an expose in Forbes.  All the young financiers ran to his company without knowing all the craziness that would ensure.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:09:17.180Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I wonder if he knew doing the expose in Forbes would bring in all the young people and make his company take off ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:10:33.935Z"
    }, 
    {
      "docIdx": 3, 
      "text": "When everything starts to go crazy, I'm glad that Naomi decided to leave him.  But I was really pissed when he put his daughter in the car and tried to speed off with her and crashed in the driveway.  He didn't even care about the kids.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:11:53.968Z"
    }, 
    {
      "docIdx": 3, 
      "text": "No, he really didn't care about the kids. I can't believe he went from trying to run away with his child to wearing a wire the very next morning. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:14:08.063Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I am so happy that Donnie ratted Jordan out first though!  I thought it was nice that Jordan slipped him a note to try to help Donnie, but Donnie finally had enough.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:15:31.628Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I feel like Jordan just made the deal with the FBI to save himself. I can't believe they still reduced his sentence though.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:16:32.091Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Three years is crazy short!  And then he goes on to teach seminars on his sales technique!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:18:37.295Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I feel like he shouldn't have been allowed to teach what he did you know? Since most of what he did was illegal.\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:19:36.811Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah it's like he was rewarded for his crimes, and then ratting out his colleagues.  He still gets to make money teaching people his crazy ways.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:20:39.425Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-20T01:36:10.335Z", 
  "uid1LogOutTime": "2018-03-20T02:21:00.774Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-20T01:36:10.410Z", 
  "uid2LogOutTime": "2018-03-20T02:21:03.597Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR592", 
  "user2_id": "USR973", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 28
}