{
  "date": "2018-01-30T00:11:12.469Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi. How are you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:12:58.565Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello, we are talking about the movie Inception today.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:13:11.049Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Really? Is it any good?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:13:36.466Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was rated highly on rotten tomatoes and IMDB, both over 80%.  It is a good story about a complex futuristic mind control technology.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:14:38.872Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Interesting. Who is in it? Anyone good?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:15:23.639Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It has some pretty big names.  Leonardo DiCaprio is the lead, and the supporting actors are Joseph Gordon-Levitt, and Ellen Page.  They are all really good in the movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:16:36.516Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like Leonardo DiCaprio's newer work. He grew up a lot. He is a lot better than he used to be. I'm not sure if I can place the other two names. Is it an action movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:18:02.526Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The basic plot is that there is a technology that can enter the subconscious mind of another person, and the idea of the title, Inception, is that they can potentially spark an initial subconscious thought in the person that will then lead them down a thought path towards a decision they want the person to make in the future.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:19:35.513Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Joseph Gordon-Levitt has been in many things, but is most known as the long haired kid in the sitcom Third rock from the sun.  Ellen Page was also acting from a young age in many movies, many of them romantic comedy types.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:21:08.512Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Wow. That sounds like an interesting flick. It sounds like it might be hard to follow the plot. It sounds pretty complicated. I've never watched Third Rock From the Sun. I'm also not big into romantic comedies. I've heard that she was good in Juno, but I've never seen it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:22:12.378Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It is a movie that requires some thought.  It gets very complicated when they are in scenes that take place in a shared dream world.  Gets hard to tell what is real and what is not.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:23:52.897Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Shared dreaming? That sounds pretty out there. I do enjoy a good movie that requires some thought, if I'm in the right mood.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:25:00.107Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It is very interesting how they try to plant a simple notion in a persons head, that will later down the road lead the person to take a specific action.  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:26:20.630Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Do they use drugs or machines to plant the ideas or is it all done with the mind, like psychically?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:27:41.024Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think they kidnap and sedate the person, and use a machine of some sort to hook into his mind", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:29:08.569Z"
    }, 
    {
      "docIdx": 2, 
      "text": "When they did the shared dreaming thing, did they hook everyone up to the same machine? When they're hooked up to the machine, do they plant orders to assassinate people like in the Manchurian Candidate?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:31:00.208Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It gets very complicated when the team enters the persons dream world.  There are risks to all of them that they can become fooled into forgetting where they are, and never be able to get out of it.  There are levels of depth to the persons dream, and each level deeper gets riskier", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:31:16.922Z"
    }, 
    {
      "docIdx": 2, 
      "text": "They go into different dream levels? How do they get out? Do they have someone helping them from the outside? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:32:40.378Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It is more like gently subconscious suggestions.  Here they ultimately want a very rich man to split up his huge company into separate divisions and they do this by planting seeds of doubt in his mind about various people and situations", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:32:50.291Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, I think there is a team member who stays outside to keep them all safe and monitor everything.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:33:33.901Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Why do they want to split the company? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:34:16.096Z"
    }, 
    {
      "docIdx": 2, 
      "text": "To weaken it for eventual takeover I think.  There is also this issue that they could get lost in the dream, and the several of them have had it happen before, and were lucky to escape, so the risk of it happening again is really big.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:35:42.299Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I wonder if it's something like the longer they stay in the dream, the more likely they are to forget who they are or forget the real world.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:36:43.280Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think also time is way different in the dream world.  The main character and his girlfriend once got trapped in it, and lived a 50 year lifetime inside.  While he got out eventually, and then got her out, she lost her grip on reality and killed herself.  So the dangers of going in are really serious.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:38:16.616Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wow. That must be hard to deal with. You would seriously have to weigh the risk against the rewards of going into someone else's dream. Then there is also the obvious ethical dilemma of whether or not you SHOULD go into someone else's dream and plant ideas.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:40:12.683Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Very true.  I guess that is what the movie so good.  So many complex ethical issues.  Anyways, if you have not seen it, you should!", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T00:41:02.003Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think that I might have to check it out some time!", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:41:27.909Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Is there anything else interesting about the movie? How's the music?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T00:45:04.860Z"
    }
  ], 
  "rating": 3, 
  "status": 0, 
  "uid1LogInTime": "2018-01-30T00:11:12.470Z", 
  "uid1LogOutTime": "2018-01-30T00:52:14.183Z", 
  "uid1response": {
    "response": [
      2
    ], 
    "type": "abandon"
  }, 
  "uid2LogInTime": "2018-01-30T00:12:44.349Z", 
  "user1_id": "USR1721", 
  "user2_id": "USR1768", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 5
}