{
  "date": "2018-03-24T06:17:43.402Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:18:04.463Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:18:45.261Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What movie would you like to talk about?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:19:04.245Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you like to watch animated movies? Like this, Monster University?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:19:14.062Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do! What is it about?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:19:30.419Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's about monsters being thought on how to scare people.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:20:15.429Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Is it as good as the prequel?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:20:55.138Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I think so, it's also made by Pixar, so I guess you will like it if you enjoyed Monsters Inc.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:21:47.402Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did enjoy it quite a bit. Is there anything bad about it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:22:40.723Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Most of the critics enjoyed it, they said it's colorful, cute and funny, but the story is generic, predictable. But I think it's not that bad. It's really hard to say anything negative about this movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:25:20.241Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That is really encouraging to hear. Sometimes a predictable movie is nice to watch. Would you say it's one of your favorite Pixar movies?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:26:02.599Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Not my favorite actually, but it's definitely a good re watch. Something to enjoy through those boring rainy\n days.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:28:20.098Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It sounds like a movie I would probably be interested in. Are you generally a fan of animated movies?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:30:45.357Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I generally love watching animated movies and series, I would easily admire cool graphics. Are you interested in animated movies with animals or creatures in it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:33:29.971Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, those kinds of movies are usually the best. Do you think that adults would enjoy this movie as much as children?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:35:30.662Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Not all adults I guess, especially those who do not appreciate animation. How about companies that make these animated movies, do you have any opinions about them? Like Pixar for example, I think they have improved over these years.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:42:32.183Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree. I think Pixar is far better than Dreamworks at this point, but Dreamworks still makes decent quality movies", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:43:53.421Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes I think they are both good. Oh and by the way, I would like to add that I am trying to avoid sad movies, you know like Marley and Me, to be honest, I still haven't watched that movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:47:32.462Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I haven't watched that movie either. I am pretty sensitive to movies, especially horror, so I avoid most of them, which is why I'm so into animated movies. Are you easily scared by movies?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:49:21.707Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I don't actually, I find them a bit boring now, especially the gory-disgusting ones. But if it has a good story in it I would watch it. I just hate it when they are just trying to use \"screamers\" just to surprise their audience and say \"this is the most frightening movie ever\".", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T06:53:29.179Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree. Jump scares are what I don't like, in addition to gore. But horror with a decent plot is okay. They're few and far between though. Monsters University isn't scary, thank goodness", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T06:55:30.734Z"
    }, 
    {
      "docIdx": 3, 
      "text": "A very good example of horror movie that I liked would be The Autopsy of Jane Doe. I think it's a really creative movie, they only used like 5 characters in it, the scenes literally happened in one place, but it's full of twists. The movie will make you think every second of it without using too much gore or predictable jump scares.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T07:01:17.361Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thank you for the recommendation! I haven't heard of that one. I haven't seen many horror films in general because they're what I avoid. Do you like the newer Disney, non pixar movies? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T07:03:53.013Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, although I can't really remember of which is which. Kung fu Panda was entertaining, and also the Lego movies, it was really creative.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T07:05:33.793Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I really enjoyed Moana, more than Frozen. Kung fu Panda and Lego movies were really good as well.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T07:11:08.269Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I still haven't watched Moana and Frozen, but I am really planning to. Why do you think Moana is a lot better than Frozen?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-24T07:12:44.463Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I love Frozen, but Moana just has an energy to it that Frozen lacks. Hard to explain!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-24T07:16:26.177Z"
    }
  ], 
  "rating": 3, 
  "status": 0, 
  "uid1LogInTime": "2018-03-24T06:17:43.402Z", 
  "uid1LogOutTime": "2018-03-24T07:18:29.224Z", 
  "uid1response": {
    "response": [
      2
    ], 
    "type": "abandon"
  }, 
  "uid2LogInTime": "2018-03-24T06:17:44.250Z", 
  "uid2LogOutTime": "2018-03-24T07:18:35.333Z", 
  "uid2response": {
    "feedback": "Thank you very much!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2420", 
  "user2_id": "USR4573", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 23
}