{
  "date": "2018-02-09T19:49:34.170Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! So have you seen the movie Frozen?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T19:50:22.866Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really enjoy animated comedies. Frozen was alright, seemed like every other Disney movie to me, but it definitely had some catchy songs in it. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T19:52:32.637Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello. Yes I have seen it on 3D and it was amazing. Very funny Kristoff performance. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T19:53:47.326Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I haven't read the tale \" The Snow Queen\" but after seeing the movie I am interested on reading it. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T19:54:44.800Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have not seen it in 3D, I haven't read \"The Snow Queen\" either, but I suppose I might have to now! That must be great. Is Kristoff your favorite character? I think Jonathan Groff did really well with the voicing. What do you think of the critics responses? Do you agree with the ratings?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T19:56:32.440Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes for sure Kristoff was the best one for me. He brought a lot of comedy to the history. Strange to say but in this case I agree with the critics. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T19:57:56.235Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think there was a decent message in the movie, for once in the history of Disney. They actually tell you that you can't fall in love with the first guy you meet, especially when you know nothing about him. I also loved the sisterly bond that happened and how it's message conveyed how important family is. It was definitely emotional.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T19:59:48.634Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes I agree with you. Do you agree it was the best animated musical since the death of Howard Ashman?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:01:01.576Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I don't think it's the best, per say, but it was definitely good. I mean just about every Disney movie has music in it, this one most certainly had a great deal of catchy songs, The Little Mermaid and Beauty and the Beast will forever be my favorites.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:02:10.926Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's an alright script, but like I said, it's a typical Disney movie, someone falls in love, there's villains, there's magic, there's singing and dancing, problems to overcome. I would probably give it a B+ rating instead of an A+, but that's just me.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:04:47.734Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes it is right. Personally I love Pixar movies and this one seems to have the same approach of one of then, maybe this is why I liked it. What about th\ne end of history did you expected more?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:05:13.310Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I didn't. I kind of predicted what would happen. Seemed logical. How do you feel about the scene where they are kids playing and Elsa accidentally hits Anna with her \"ice power\" and injures her? I feel like her parents went about it the wrong way, making her fear her powers.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:07:08.068Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes for sure. They pressured her to avoid using the power instead of learning how to control then. That was the main cause of all the future problems. What about the trolls village, did you like then?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:09:05.362Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Even the trolls tell her she must learn to control her powers, but instead she just suppresses what makes her unique. Pretty sad in my opinion. The trolls are great! They definitely add a lot of humor to the movie. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:10:04.540Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I really hated the scene where her parents died at sea. It was kind of messed up, leaving them orphans in a way, I know Elsa was older, but it seemed like there was no one to really guide them through their teenage years. I feel like there was something missing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:10:20.937Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I didn't understand why Anna had to have her memories of Elsa's magic erased. That seemed kind of dumb to me, like wouldn't it make more sense to keep them there, so she could learn from her mistake. Next time she wouldn't jump around so foolishly and quickly. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:11:52.674Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Agree with you but it was necessary for the movie. Actually Elsa's insecure was the main component of the drama. But maybe the history could be achieved in a different way as you mentioned. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:13:22.736Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I understand. I hate how they closed the doors and everything and just left them isolated. I feel like she wouldn't have been so insecure about her powers if they had been more supportive.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:15:15.595Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Completely agree, trying to keep then apart and without knowing the reason is a bad decision. For sure they were creating problems for the future. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:15:54.327Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Isolation created on Elsa insecure to control her powers and makes Anna willing to fall in love for the first man she meets outside the castle. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:18:55.500Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Why do you think Elsa remained so distant from Anna even after they opened the doors for the coronation?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:19:28.892Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Difficult to know, maybe because she knew that Anna loved her but at the same time was the purpose of so many troubles when they where child. Although it was no Anna's fault maybe Elsa was afraid to happen again. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:21:45.371Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Elsa tried to create the ice castle to stay alone as she was in her normal castle right", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:23:05.682Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I feel like if she had just been open about her powers and that her family hadn't hid it from the citizen's, that maybe someone could have helped her learn how to control them. She was so afraid that they'd learn about them, I think the biggest trigger for her was fear. If people had just known from the start, the Duke wouldn't have been able to label her a monster. I guess it all  had to happen for there to be a movie though. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:24:47.376Z"
    }, 
    {
      "docIdx": 2, 
      "text": "She creates the ice castle to get away from everyone after her powers are accidentally released. If I remember correctly, Anna pulls off one of Elsa's gloves while she's upset and that's what causes it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:25:47.353Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That is right and she so used to be isolated that was the only thing she could looked for. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:26:05.673Z"
    }, 
    {
      "docIdx": 3, 
      "text": "She was upset about Prince Hans proposing to her sister after they just met. I can't blame her, that was a dumb move.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:26:21.660Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I really love the scene of Anna meeting Kristoff and their journey to find Elsa. Olaf is awesome.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:27:01.021Z"
    }, 
    {
      "docIdx": 3, 
      "text": "His whole scene where he sings about summer is hilarious. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:27:13.141Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That is right, and Hans' intentions were very suspicious\n since the begging. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:28:12.894Z"
    }, 
    {
      "docIdx": 3, 
      "text": "For a moment I supposed he was really in love but it was not difficult to realize the real intention.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:28:35.289Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Also the giant creature Marshmallow was very interesting\n. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:29:18.842Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Did you like the part where they get to the ice castle and Elsa accidentally freezes Anna's heart? Or did you have a favorite part in that scene?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:29:22.749Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes! I loved the marshmallow creature. That thing was awesome. Definitely brought some action to the scene. What better way to get Anna and her companions to leave than to create a larger, more evil version of Olaf?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:30:18.133Z"
    }, 
    {
      "docIdx": 3, 
      "text": "No for sure this is the most surprising scene. And it is a turning point for the movie. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:30:27.674Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Hans is a creep. Locking Anna in a room to die was terrible. Not that his kiss would have saved her anyways.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:30:54.507Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes for sure, and using the fear of the people he could created a lie that was going to destroy everyone. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:31:36.603Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I hate how he manipulated everyone into thinking Else would kill her own sister, while she's alive in a room in the castle. Such a scum bag move.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T20:31:41.653Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes that is right", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:31:58.820Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I also hated that part.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T20:32:16.596Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-09T19:49:34.170Z", 
  "uid1LogOutTime": "2018-02-09T20:31:47.140Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-09T19:49:34.298Z", 
  "uid2LogOutTime": "2018-02-09T20:32:38.502Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR842", 
  "user2_id": "USR4843", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 0
}