{
  "date": "2018-02-15T03:40:33.021Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "It sounds like a good movie to me ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:42:21.239Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Agreed. A 92% on rotten tomatoes stirs a lot of confidence as a rating.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:43:03.561Z"
    }, 
    {
      "docIdx": 0, 
      "text": "a good mix of culmination of characters and good actors as well", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:43:17.862Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Robert Downey Jr. is awesome, he brings wit and energy to every role he's in.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:44:01.497Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you like superhero movies?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:46:09.172Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Mark Ruffalo has a good cycnical side in his movies as well to balance out the other actors. it sounds like a good mixture to me and with the A+ rating it recieved It seems like a good movie to watch. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:46:24.349Z"
    }, 
    {
      "docIdx": 0, 
      "text": "very much so what about yourself?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:46:37.328Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah I agree with that, all the actors are great here, it really shines through in the movie too, especially with the humor. everyone seems like they're having fun. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:49:02.764Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do, and The Avengers is one of my favorites. Who is your favorite superhero in this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:49:22.519Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I would have to go with Thor or Hawkeye personally. What about you? What was you favorite scene of the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:51:06.830Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The Special effects for the Chitauri were excellent in the movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:53:10.488Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Personal Favorite would be Captain America. But I do love Hawkeye, I think he really grounds the film. A movie about a bunch of superheroes can quickly get out of hand, so having him without superpowers in the mix is really. cool. I didn't like how Loki brainwashes him for most of the movie and makes him a villain though.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:53:39.096Z"
    }, 
    {
      "docIdx": 1, 
      "text": "oh I agree. The Tesseract looked super cool as well", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:53:59.393Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Completely agree there Clint does bring his own type of superpowers though to his scenes. I also thing Samuel L. Jackson pulled off Director Fury really well. The effects were Grade A to say the least. Loki has the smug attitude though that makes you want them to get him in the end.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:57:12.788Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh yeah, Loki was a scene stealer in this movie. Especially in the introductory scene where comes through the wormhole. So badass. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:58:51.315Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What did you think of what Joss Whedon did as a Director for this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:59:10.920Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Definitely a scene stealer in multiple scenes. I think he did an excellent job he made sure the movie had a good mix of humor as well as plenty of action to give it a good balance and feel to the whole of the movie. What did you think of Scarlett Johansson's  black widow?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:02:44.236Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The scene where the Hulk Rampaged on the Helicarrier was awesome I would hate to be in his warpath.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:05:44.068Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah Joss Whedon seems to have a knack for seemingly blending tones in movies, especially this one. And I thought she was great. Scarlett Johansson always brings great energy to her roles. Black Widow was another character that I think really grounded the film, which didn't stop her from being incredible in every scene. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T04:06:24.446Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh yeah, that was so cool. I loved how they all tussled with each other. Thor vs. Hulk was brief but incredibly cool. Also, like we were just talking about with Scarlett, this is another scene where she really shined. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T04:07:30.824Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I hated that they had to kill Coulson but his scene against Loki was great", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:07:34.512Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Definitely anyone who can take on such a physically challenging role like that deserves every bit of Merit that can be mustered\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:08:48.559Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah Coulson dying was tragic, but also was great for the story. The Avengers really snapped into gear after that, which lead into an amazing 3rd act. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T04:09:37.321Z"
    }, 
    {
      "docIdx": 3, 
      "text": "BY far my Favorite scene of the entire movie was Hulk facing Loki in Stark Tower", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:11:27.219Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The way he smashed him into the ground like that was so satisfying, especially since all the trouble Loki caused. That beat-down felt so justified. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T04:12:55.653Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Seeing the Chitauri ships leads me to think that there is no way this can be the end and the emotional response from Tony Stark Really set the final tone of the scene, \"Puny God!\" lol", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:14:12.886Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Seeing the massive ground force in Manhattan vs the Avengers really shows what they are capable of when they all work together and dismiss the tension between one another.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:15:52.681Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The way they filmed the ending was great because it launched an amazing direction for the other movies that would later come out. Including some interesting storylines for Tony. That wormhole experience really messed with him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T04:16:25.365Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Agreed I think in some ways seeing what was on the other side broke him in more ways than can be explained setting him in a new direction all together.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:17:35.340Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, I agree. and I LOVE the way Joss Whedon filmed that, the continuous shot with all the avengers in action was incredible. It visually showed how connected they had become as a team, which I thought was a really cool visual representation of the core concept of the movie. I gotta give Whedon props on the directing in this. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T04:17:54.618Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Completely agreed there he was the perfect match for this movie I believe and the choreography between everyone was amazing in itself. \n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T04:19:13.888Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-15T03:40:33.021Z", 
  "uid1LogOutTime": "2018-02-15T04:19:12.853Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-15T03:40:33.038Z", 
  "uid2LogOutTime": "2018-02-15T04:19:21.148Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR823", 
  "user2_id": "USR3330", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 7
}