{
  "date": "2018-03-23T03:15:55.981Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hey", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:16:13.826Z"
    }, 
    {
      "docIdx": 0, 
      "text": "hello!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:16:23.714Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you seen wolf of wallstreet?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:17:07.473Z"
    }, 
    {
      "docIdx": 0, 
      "text": "did you get the screen where it shows information about the movie?  I did not get one this time so you will be initiating the conversation more often.  Yes, I have seen the wolf on wallstreet", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:17:28.436Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well, I am here to convince you to watch that amazing martin scorsese directed film again!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:18:00.778Z"
    }, 
    {
      "docIdx": 0, 
      "text": "yeah, I thought that was a pretty funny movie", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:18:43.211Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you ever traded stocks?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:18:50.250Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The sheet dosent do it justice, honestly. I liked it alot. Jonah hill was very surprising. Some critics hated it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:19:08.842Z"
    }, 
    {
      "docIdx": 0, 
      "text": "i have never traded stocks, have you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:19:19.836Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Margot Robbie plays Naomi very well. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:20:22.157Z"
    }, 
    {
      "docIdx": 0, 
      "text": "They refer to it as a black comedy and i can understand why, but I tend to think the term black in reference to comedy is tossed around a bit willy nilly.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:21:15.105Z"
    }, 
    {
      "docIdx": 0, 
      "text": "hello?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:22:04.651Z"
    }, 
    {
      "docIdx": 1, 
      "text": "the sheet doesn't do it justice?  Is that like a review?  I like wolf of wall street a lot too, I think it was one of the better movie that year just because it depicts things in a different light, the way things are and it was funny.  I have traded stocks a long time ago, there was another movie about stock trading and fraud on wall street recently, sometimes one has to wonder hihi.  Naomi in that movie is so hot.  Yeah, I think the term black comedy may be misleading, maybe it was kind of dark but it is more realistic than telling a fairy tell cover up", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:22:09.939Z"
    }, 
    {
      "docIdx": 1, 
      "text": "some of our conversation disappear", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:22:28.557Z"
    }, 
    {
      "docIdx": 1, 
      "text": "true true. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:22:35.155Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, I like the scene where she was giving him blue ball right befor ethe ipo, that was kind of funny", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:23:12.882Z"
    }, 
    {
      "docIdx": 1, 
      "text": "the part about how they manipulate the stock price of the shoes company in the ipo and the scene where he was hiring a bunch of guys to sell penny stocks was kind of funny too", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:24:15.030Z"
    }, 
    {
      "docIdx": 1, 
      "text": "there was a movie in the eighties with michael douglas about wall stret that i cant recall the name of, it was excellent. i thought wolf of wall street was funny, but i do kind of agree with critics that it tended to glorify the idiocy and drug use of the characters instead of really filling them out.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:24:42.412Z"
    }, 
    {
      "docIdx": 1, 
      "text": "he made a fortune with that jazz\n tho. for as dumb as they were, the shit worked.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:25:32.987Z"
    }, 
    {
      "docIdx": 1, 
      "text": "i always forget that matthew mcconaughey was in there. he was awesome!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:26:41.787Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That is right, he was called the gecko or something where he return after a big loss.  And yes, but wall street is money, and that is where the drug and other spending such as tits and ass expense account in wolf of wall street was also a part of it.  Though I think one could easily remove these out of the equation, as I do not think all stock traders are drug users or whore mongrel.   The market manipulation and insider trading are a big deal in stock trading, and it gets more and more sophisticated nowadays.  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:27:07.269Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Haha, the scene about matthew mmcounghey talking about jacking off every day because of the stress and how they want to steal money from client's pocket was pretty decent too", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:27:56.083Z"
    }, 
    {
      "docIdx": 2, 
      "text": "ah, the movie with Michael douglas was playing Gordon gecko I think was the character's name, is that the movie you were referring to?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:28:40.308Z"
    }, 
    {
      "docIdx": 2, 
      "text": "boiler room was about all that, it was like wolf of wall street with more bussiness talk and less shenanigans. the cash smuggling scenes in wolf of wallstreet were pretty funny. it did a good job of breaking down how swiss bank accounts actually work.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:29:34.772Z"
    }, 
    {
      "docIdx": 2, 
      "text": "that is the movie i was talking about! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:30:07.183Z"
    }, 
    {
      "docIdx": 2, 
      "text": "gordon gecko, and he does a big speech about closing or something?!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:30:32.492Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, the no snooping completely anonymous swiss bank policy is a good way to launder funds, I was surprised about the part where airport security let them funnel that much money every flight in the wolf on wall street hahaha, tape and all.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:30:41.250Z"
    }, 
    {
      "docIdx": 2, 
      "text": "the other movie I think was about insider trading and market manipulation ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:30:58.481Z"
    }, 
    {
      "docIdx": 3, 
      "text": "watching movies like this and american psycho make me wonder how rampant the drug use really is in among white collar guys like that.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:31:43.089Z"
    }, 
    {
      "docIdx": 3, 
      "text": "in the end though, they scammed a lot of people with the whole pump and dump scam.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:32:30.293Z"
    }, 
    {
      "docIdx": 3, 
      "text": "he is still out there too, making millions.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:32:59.928Z"
    }, 
    {
      "docIdx": 3, 
      "text": "haha, I grew up in Hawaii and I don't think drug are just rampant among the white color guy, though there is so many different kind of drugs from low budget relatively like marijuana to the cocaine that can burn through one's wallet really quickly.  Yeah, the price manipulation of stocks.  He meanings the one in wolf of wall street?  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:33:15.579Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I read the movie was based on true story but I did not follow through with research  on that character to know what he was doing after the event where the movie ended", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:34:24.386Z"
    }, 
    {
      "docIdx": 3, 
      "text": "he hosts seminars on sales techniques\n now.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:35:10.756Z"
    }, 
    {
      "docIdx": 3, 
      "text": "i cant believe it came out in 2013, that seems like yedterday!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:36:01.679Z"
    }, 
    {
      "docIdx": 3, 
      "text": "haha, yeah, four years since, times flies", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:36:46.247Z"
    }, 
    {
      "docIdx": 3, 
      "text": "sales techniques? meaning selling penny stocks and those who wants clients to purchase stocks?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:37:13.462Z"
    }, 
    {
      "docIdx": 3, 
      "text": "that can really affect the prices of stock in the market, when a big intuition tries to get clients to buy a certain stock, in a way that is stock price manipulation, one has to wonder", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:37:43.830Z"
    }, 
    {
      "docIdx": 3, 
      "text": "i think it is more about how to be super aggressive with clients and decisions", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:37:49.355Z"
    }, 
    {
      "docIdx": 3, 
      "text": "between pumping them up and insider trading i think there are plenty of ways to manipulate the market. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:39:13.473Z"
    }, 
    {
      "docIdx": 3, 
      "text": "as was shown, in the wonderful martin scorsese directed film, Wolf of Wallstreet.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T03:39:47.179Z"
    }, 
    {
      "docIdx": 3, 
      "text": "ah, I understand that, though ultimately the one selling a particular stock is just selling, but in the grand scheme of things, the one pulling the string behind wall street and money can certainly use this as a tool to manipulate stock price.  yeah, it is really interesting.   I think there are rules against that, but it is more like if you get caught rather than doing it, kind of freaky.  Anyhow, we can finish the conversation now, it was really nice chatting with you :)", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T03:39:59.340Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-23T03:15:55.981Z", 
  "uid1LogOutTime": "2018-03-23T03:40:23.253Z", 
  "uid1response": {
    "feedback": "We had both seen the film before, so it was difficult to stick to information that was on the sheet only. We seemed to veer of topic but always came back to the movie. ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-23T03:15:56.184Z", 
  "uid2LogOutTime": "2018-03-23T03:40:05.110Z", 
  "uid2response": {
    "feedback": "I already watch this movie before", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3143", 
  "user2_id": "USR609", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 28
}