{
  "date": "2018-03-19T18:08:48.565Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hi", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:09:35.301Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:09:39.966Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Let's talk about Toy Story", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:09:48.197Z"
    }, 
    {
      "docIdx": 0, 
      "text": "1995  Comedy,\nAnimation,\nAdventure", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:09:59.853Z"
    }, 
    {
      "docIdx": 0, 
      "text": "\ndirected by John Lasseter", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:10:10.741Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It sounds interesting", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:10:24.461Z"
    }, 
    {
      "docIdx": 0, 
      "text": "1. Rotten Tomatoes: 100% and average: 9/10\n\n2. Metacritic Score: 95/100\n3. CinemaScore: A", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:10:28.640Z"
    }, 
    {
      "docIdx": 0, 
      "text": "● Tom Hanks as Woody, a pull-string cowboy doll.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:10:41.968Z"
    }, 
    {
      "docIdx": 0, 
      "text": "People really like it!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:10:50.899Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Tim Allen as Buzz Lightyear, a space ranger action figure and Woody's rival, who later\nbecomes his best friend.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:10:59.165Z"
    }, 
    {
      "docIdx": 0, 
      "text": "How long is the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:11:32.650Z"
    }, 
    {
      "docIdx": 0, 
      "text": "1 hr 21 m", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:11:58.092Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Are there songs in it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:12:40.303Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes award winning songs by Randy Newman", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:13:04.046Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Toy Story is a 1995 American computer-animated buddy comedy adventure film produced by\nPixar Animation Studios for Walt Disney Pictures. The directorial debut of John Lasseter, Toy\nStory was the first feature-length computer-animated film and the first feature film produced by\nPixar. Taking place in a world where anthropomorphic toys pretend to be lifeless whenever\nhumans are present, the film's plot focuses on the relationship between Woody, an old-fashioned\npullstring cowboy doll (voiced by Tom Hanks), and Buzz Lightyear, an astronaut action figure\n(voiced by Tim Allen), as they evolve from rivals competing for the affections of Andy, their owner,\nto friends who work together to be reunited with Andy as his family prepares to move to a new\nhome. The screenplay was written by Joss Whedon, Andrew Stanton, Joel Cohen and Alec\nSokolow, based on a story by Lasseter, Pete Docter, Stanton and Joe Ranft. The film features\nmusic by Randy Newman, and was executive-produced by Steve Jobs and Edwin Catmull.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:13:15.225Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh, interesting that Joss whedon was a writer on it", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:14:24.165Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah he does a lot of punch-ups", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:14:44.753Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Here's a key scene", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:15:05.647Z"
    }, 
    {
      "docIdx": 1, 
      "text": "In a world where toys are living things who pretend to be lifeless when humans are present,\na group of toys, owned by six-year-old Andy Davis, are caught off-guard when Andy's\nbirthday party is moved up a week, as Andy, his mother, and infant sister Molly, are\npreparing to move the following week. The toys' leader and Andy's favorite toy, a pull-string\ncowboy doll named Sheriff Woody, organizes the other toys, including Bo Peep the\nshepherdess, Mr. Potato Head, Rex the Dinosaur, Hamm the Piggy Bank, and Slinky Dog,\ninto a scouting mission. Green army men, led by Sarge, spy on the party, and report the\nresults to the others via baby monitors. The toys are relieved when the party appears to end\nwith none of them having been replaced, but then Andy receives a surprise gift – an\nelectronic toy space ranger action figure named Buzz Lightyear, who thinks he is an actual\nspace ranger.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:15:07.188Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Uh oh that actually sounds kinda sad", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:16:12.921Z"
    }, 
    {
      "docIdx": 1, 
      "text": "But he must not really replace anyone since he becomes bff with Woody", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:17:29.821Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:19:20.100Z"
    }, 
    {
      "docIdx": 2, 
      "text": "another scene", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:19:33.570Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Buzz impresses the other toys with his various features, and Andy begins to favor him,\nmaking Woody feel left out. As Andy prepares for a family outing at Pizza Planet, his mother\nallows him to bring one toy. Fearing Andy will choose Buzz, Woody attempts to trap Buzz\nbehind a desk, but ends up accidentally knocking him out a window, and the other toys\nrebel against Woody by accusing him of knocking Buzz out of jealousy. Before they can\nexact revenge, Andy takes Woody instead and leaves for Pizza Planet. When the family\nstops for gas, Woody finds that Buzz has hitched a ride on the car as well, and fight, only to\nfind the family has left without them. They manage to make their way to the restaurant by\nstowing away on a pizza delivery truck, where Buzz, still thinking he is a real space ranger,\ndespite Woody's attempts to convince him otherwise, gets them stuck in a crane game,\nwhere they are salvaged by Andy's mischievous neighbor, Sid Phillips.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:19:34.225Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Sid Phillips must be good at crane games", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:22:02.891Z"
    }, 
    {
      "docIdx": 2, 
      "text": "What happens after they get out of the crane game?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:25:49.489Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Does Sid know they're Andy's toys?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:26:11.215Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Did Sid go to Andy's party?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:27:28.727Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I mean are they friends or enemies?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:27:40.128Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh yes", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:27:45.637Z"
    }, 
    {
      "docIdx": 2, 
      "text": "They all become friends", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:27:59.882Z"
    }, 
    {
      "docIdx": 3, 
      "text": "How lovely!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:28:21.875Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The toys reveal their real nature to Sid and scare him, scaring him for life", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:28:22.286Z"
    }, 
    {
      "docIdx": 3, 
      "text": "\n pretty funny", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:28:41.832Z"
    }, 
    {
      "docIdx": 3, 
      "text": "shows him for playing with inanimate toys in a creative way", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:28:42.480Z"
    }, 
    {
      "docIdx": 3, 
      "text": "more key scenes", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:29:00.743Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The duo tries to make it to the moving truck, but Sid's dog, Scud, sees them, and gives\nchase. Buzz gets left behind while saving Woody from Scud, and Woody tries rescuing him\nwith Andy's RC car, but the other toys, thinking Woody eliminated RC as well, attack and\ntoss him off the truck. Having evaded Scud, Buzz and RC retrieve Woody, and continue\nafter the truck. Upon seeing Woody and Buzz together on RC, the other toys realize their\nmistake, and try to help them get back aboard, but RC's batteries become depleted,\nstranding them. Woody ignites the rocket on Buzz's back and manages to throw RC into the\ntruck before they soar into the air. Buzz opens his wings to free himself from the rocket\nbefore it explodes, gliding with Woody to land safely into a box in the car, right next to Andy.\nOn Christmas Day, at their new house, Woody and Buzz stage another reconnaissance\nmission to prepare for the new toy arrivals. As Woody jokingly asks what might be worse\nthan Buzz, they discover Andy's new gift is a puppy, and the two share a worried smile", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:29:01.398Z"
    }, 
    {
      "docIdx": 3, 
      "text": "critical response", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:29:13.877Z"
    }, 
    {
      "docIdx": 3, 
      "text": "● \"... razzle-dazzle technique and unusual look\"\n● \"Starting with Tom Hanks, who brings an invaluable heft and believability to Woody, Toy\nStory is one of the best voiced animated features in memory, with all the actors ... making\ntheir presences strongly felt.\"\n● \"It has the purity, the ecstatic freedom of imagination, that's the hallmark of the greatest\nchildren's films. It also has the kind of spring-loaded allusive prankishness that, at times,\nwill tickle adults even more than it does kids.\"\n● \"a work of genius. It got people to understand what toys are about. They're true to their\nown character. And that's just brilliant. It's got a shot that's always stuck with me, when\nBuzz Lightyear discovers he's a toy. He's sitting on this landing at the top of the staircase\nand the camera pulls back and he's this tiny little figure. He was this guy with a massive\nego two seconds before... and it's stunning. I'd put that as one of my top ten films, period.\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:29:14.892Z"
    }, 
    {
      "docIdx": 3, 
      "text": "and there's 2 sequels. Toy Story 3 is my favorite one", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:29:45.052Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That toy space man had real rockets?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:30:06.382Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Also, scud is a great dog name", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-19T18:30:18.156Z"
    }, 
    {
      "docIdx": 3, 
      "text": "naw they tie a firework to him", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-19T18:30:24.009Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-19T18:08:48.565Z", 
  "uid1LogOutTime": "2018-03-19T18:30:31.287Z", 
  "uid1response": {
    "feedback": "The movie sounded pretty okay from the other person's description, but I don't really like animated movies or shows, so I'm going to miss it", 
    "response": [
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-19T18:08:48.598Z", 
  "uid2LogOutTime": "2018-03-19T18:30:26.534Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      -1
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3622", 
  "user2_id": "USR144", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 29
}