{
  "date": "2018-02-17T19:43:35.371Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "What movie did you watch?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T19:45:27.727Z"
    }, 
    {
      "docIdx": 0, 
      "text": "So the film I saw is John Wick, which came out in 2014. It's an action film starring Keanu Reeves, who comes out of retirement as a hitman because his car was stolen and his puppy was killed. It has a pretty good critical reception too.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:45:41.008Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Why did the critics particularly like it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T19:46:10.686Z"
    }, 
    {
      "docIdx": 0, 
      "text": "One critic liked the \"B-movie fun\" of the film, another liked that Reeves returned to the action/thriller genre, and another really liked the movment of the film.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:47:11.292Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It has an 86% on Rotten Tomatoes, which is a pretty great score overall", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:47:30.501Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That is a pretty good score! Does \"B-movie fun\" mean that the film is shallow but has a lot of engaging \naction?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T19:48:26.986Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think the critic means that the film's plot isn't overly complicated, since it's a pretty easy to follow revenge story, but it has a lot of action and interesting fight scenes, which I also agree with.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:49:28.467Z"
    }, 
    {
      "docIdx": 0, 
      "text": "So the revenge plot is initiated when someone kills Reeves' dog?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T19:50:26.979Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Partly. His character is retired and his vintage car is stolen and his puppy is killed. The puppy was a gift from his wife who had recently died, which is why he's so upset about this and is seeking vengeance.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:51:19.104Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I find the use of the puppy very interesting, as it definitely gets the audience on his side and makes you root for him, even though he's a hitman and generally isn't a character that should be \"rooted for.\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:52:03.554Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh ok.  I like dogs, but that seems like a more appropriate revenge plot.  Were the people who stole his car just a random group of robbers?  Or were they something more organized?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T19:52:55.665Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The main guy that stole his car is the son of a guy named Viggo, who's the head of a crime family.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:54:11.406Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Did Reeves do something in particular to this family, or to Viggo in particular, to cause them to target him for robbery?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T19:54:52.828Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No, he didn't. There's actually a really great scene where the son takes the car into a shop and the guy recognizes the car as being John Wick's and calls his father. When his father finds out that he stole his car and killed his puppy, he's really upset at his son.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:55:25.162Z"
    }, 
    {
      "docIdx": 1, 
      "text": "John Wick was retired, but he has a serious reputation and is known as the \"Baba Yaga.\" It's really interesting because you only learn bits and pieces of John Wick's history, which makes the film have this deep mythos that you don't have all the answers about. I really liked that aspect of the film.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:56:16.136Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Was there anything special to the action scenes?  Were they shot or choreographed i\nn a particularly interesting way?  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T19:57:08.714Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You should definitely look up some of the scenes online, they're incredible! John Wick's legend is initially built up through his reputation and the fear other criminals, like Viggo, have of him, so that when you do finally see him fight later on, it's much more satisfying.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T19:59:34.314Z"
    }, 
    {
      "docIdx": 2, 
      "text": "But is there anything particularly interesting about how the director staged or filmed the fight scenes?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:00:43.027Z"
    }, 
    {
      "docIdx": 2, 
      "text": "There are a lot of fight scenes that are back to back too, which makes the film feel really fast-paced. Like there's a scene where John fights his way to the guy that stole his care who's in a nightclub and escapes, and shortly after, John is back in his hotel room and has to fight off an assassination attempt.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:02:43.095Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Anything cinematically compelling outside of the plot?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:03:50.406Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It's also really thematically interesting too, exploring ideas of mortality, revenge, etc., all while building up the mythos of John and the people around him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:06:10.961Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It's difficult to describe the fight scenes in the film, which is why I'm dancing around it a bit. It's something you should definitely see for yourself. It's definitely something that critics talk a lot about in their reviews, about the fight choreography and the movement and relentlessness of the fight scenes.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:07:01.110Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I see.  How long is the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:07:44.047Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I ask because if it is a tight hour-and-a-half, it sounds like it could be fun.  But if it is a three hour slog, I'm not sure I need that much revenge.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:09:05.711Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh gosh, I can't remember the film's run time. It definitely doesn't feel that long, with all the action scenes in it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:09:15.091Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Haha, completely get you there! I don't remember it being a 3 hour film. It's definitely pretty tight.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:09:41.666Z"
    }
  ], 
  "rating": 3, 
  "status": 0, 
  "uid1LogInTime": "2018-02-17T19:43:35.371Z", 
  "uid1LogOutTime": "2018-02-17T20:09:45.746Z", 
  "uid1response": {
    "response": [], 
    "type": "abandonWithoutAnsweringFeedbackQuestions"
  }, 
  "uid2LogInTime": "2018-02-17T19:43:35.451Z", 
  "uid2LogOutTime": "2018-02-17T20:09:54.841Z", 
  "uid2response": {
    "feedback": "The other user left the chat before we could finish the conversation.", 
    "response": [
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2541", 
  "user2_id": "USR3651", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 6
}