{
  "date": "2018-03-26T17:39:19.616Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! Today we'll be discussing Monsters university!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:40:07.601Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Cool! What's it about? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:40:15.311Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What's the movie about? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:42:05.185Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's a Pixar computer animated comedy about two monsters: Mike and Sully and they're time spent studying at college, starting off as rivals and eventually becoming frienda. Have you ever seen Monsters Inc?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:42:46.490Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, Monsters Inc. was a good movie, but it's been a long time since I've seen it. Is the new one a prequel then? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:43:23.530Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, it's a prequel to the original! In fact, it's the first prequel ever made by Pixar!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:44:28.012Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That's cool. Do you think it's a good movie? Sometimes sequels and prequels kind of stink.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:45:09.855Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought it was cute and funny! Cinemascore gave it a rating of A - and I can't help but agree with that score!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:46:19.375Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What was cute about it? Was it as good as the first movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:46:50.613Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'd say it's definitely true to the spirit of Monsters Inc and matches it's tone. As far as the cute aspect, it has that Pixar animation cuteness to it. Plus you'll recognize a lot of the voices!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:48:58.211Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Very cool. Is Billy Crystal voicing Mike again? He's hilarious ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:49:39.938Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He is and he did a great job! It's quite funny because the film starts out on Mike as a 7 year old monster who dreams of becoming a \"scarer\" after visiting Monsters Inc!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:51:28.004Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Aw, that's pretty cute. I assume they don't have any cute humans in this one though, since that would kind of spoil the plot of the original. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:52:08.346Z"
    }, 
    {
      "docIdx": 1, 
      "text": "True. It primarily focuses on the monsters but it does touch a little on how they harvest the human screams for energy - 11 years later, Mike finds himself as a first  \"scare major\" at Monsters university and that's where he meets the privileged Sulley.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:54:32.234Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So is \"scare major\" like a subject you can major in at the university, or is it like a military rank kind of major? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:55:52.292Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It's a subject you major in at the university. In fact, Sulley came from a family of talented scarers but unfortunately relies on his natural ability and begins to falter.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:58:05.687Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Cool cool. So is it kind of a story where they come from different backgrounds and each teach each other valuable lessons? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:00:00.903Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah basically in a sense. For instance at one point, they are both failed by the dean who claims Sulley does not study enough while Mike isn't scary enough.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:01:56.421Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Ah interesting. So, do you think adults would enjoy this movie, or is it more geared toward kids? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:02:48.936Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I tbink it's a comedy/animation that people of all ages would enjoy! It has humor, friendship and overcoming the odds!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:04:07.212Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Very interesting. What's the run time? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:05:38.666Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't honestly know but it's worth every minute! My favorite scene which I think you would also enjoy is when Mike enters the university's \"scare games\", making a wager with the dean to reinstate he and his team if they win!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:08:16.106Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Cool, why is that your favorite scene? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:09:19.613Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's heartwarming and humorous at the same time because he joins up with a group of misfits who are members of the weakest fraternity on campus. Mike trains the misfit and they eventually win. But mike learns they only won the final round because Sulley tampered with the machine's difficulty setting.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:12:14.457Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So Sully is friends with Mike at that point? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:13:07.773Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They are and they're led away and expelled by the university. As Mike is leaving on the bus, there's a touching moment as Sulley runs after him to lift his spirits. Eventually, they both land a job at Monsters Inc and work their way up to the scarer team!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:15:38.944Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Very neat. Do you know where I could watch Monster's University? Is it still in theaters? On netflix? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:16:44.393Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It came out in 2013 so it's an older film. I strongly encourage you and your family to give it a watch if you're able to find it! Are you a fan of John Goodman by chance?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:18:14.990Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He's alright. Monster's Inc. is probably my favorite of his movies. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:18:52.285Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He returns again as Sulley in Monsters university! Steve Buscemi also voices the character of Randy Boggs in the film!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:20:32.539Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Was Randy Boggs in the original? I can't remember", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:21:01.312Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He was and Steve reprised the role in this one. Well I enjoyed discussing Monsters university with you! I strongly encourage you and your family to give it a watch! Have a great day!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:22:21.350Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You too, thanks : )", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:22:37.125Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-26T17:39:19.616Z", 
  "uid1LogOutTime": "2018-03-26T18:22:39.349Z", 
  "uid1response": {
    "feedback": "I didn't see a document, but I don't think I was supposed to. The other user took a pretty long time with responses though. This took me almost an hour to complete. \n\nAlso, I might not want to watch the movie, because the other user put so many spoilers in their description of it. ", 
    "response": [
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-26T17:39:19.852Z", 
  "uid2LogOutTime": "2018-03-26T18:22:54.037Z", 
  "uid2response": {
    "feedback": "Everything was perfect! I thoroughly enjoyed it! Thank you so much!", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3547", 
  "user2_id": "USR3781", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 23
}