{
  "date": "2018-02-05T15:34:11.871Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "This movie seems to give light to a love story while focusing on a genre of music that is lost.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:37:06.570Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I mean sure, I wonder how realistic the show biz part of this movie was ?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:39:16.388Z"
    }, 
    {
      "docIdx": 0, 
      "text": "True. Was it more about the love story or true to the hardships of the industry", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:40:02.430Z"
    }, 
    {
      "docIdx": 0, 
      "text": "For me it was more a love story - I mean the ending showing \"what it could be if..\"  showed that it was focusing more on the romantic part - I guess that's what people are looking for these days in a movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:41:23.365Z"
    }, 
    {
      "docIdx": 0, 
      "text": "People do look for the romance and positive outcome. But sometimes a movie is more memorable if they dare to focus outside that box. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:42:51.584Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Absolutely, but when You're making a movie like that - with dept I mean and second meaning, I sometimes think most of the audience is totally missing that. I mean I agree that Sebasian was kind of a snob and Mia's lacked of depth, but I strongly think it was intentional... there ARE snobs and no depth characters falling in love out there You know.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:44:53.661Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ha Ha yes that is true, keeping it true to real life. Even snobs fall in love. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:45:52.305Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes ;)  I personally think he was not THAT BIG of a snob, he was just passionate and HE WAS trying to reach out to her to show her and invite her to his world.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:47:13.479Z"
    }, 
    {
      "docIdx": 0, 
      "text": "But I guess that is the beauty of the characters and the movie. People identify enough to form opinions. That means the you were invested to a degree. Therefore the movie was successful at drawing in the audience. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:48:09.950Z"
    }, 
    {
      "docIdx": 1, 
      "text": "As much as I agree with all that, I think Gosling's acting could be a little better. Especially when he is talking about Jazz how every performance is different - it spoiled a movie a little bit for me - detached I want to say - even tho I'm a great fan of the soundtrack and I share his passion to Jazz.\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:51:05.792Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think that is the line you walk in Hollywood. He was able to bring his fan base into the movie and gain a following right away. However, there were probably others that would have been better suited to take on the role with a different level of passion or know how", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:52:46.754Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Agree - but You can not deny that chemistry between him and Emma Stone - I mean how many movies did they do together ? They should marry already or something ;)  I like to think that chemistry is real and not just Emma's great acting \"forcing\" him to fall in love in her ;)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:57:11.521Z"
    }, 
    {
      "docIdx": 1, 
      "text": "They do have great chemistry together. I would imagine they have a true solid friendship outside the movies. Either that or like you said, they are great actors when it comes to pretending to have chemistry! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:58:49.420Z"
    }, 
    {
      "docIdx": 1, 
      "text": "uhh... I could pretend ANYTHING wit Emma ;)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:59:35.786Z"
    }, 
    {
      "docIdx": 1, 
      "text": "*with", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:59:41.983Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think overall the movie was a winner. We can pick it apart, but it was a success as far as telling the love story and adding the musical history. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T16:00:46.660Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Sure, I agree - and the main theme song ( You know, \"city of start\" or something like that ) really worked/helped me to get into the \"mood\" of the movie and go on that smooth trip mixing fairy tale romance with sometimes harsh reality of show biz in LA.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T16:02:58.224Z"
    }, 
    {
      "docIdx": 2, 
      "text": "*stars", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T16:03:10.579Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree. the music sets the mood for this movie so well. The soundtrack was a winner standing alone! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T16:05:41.491Z"
    }, 
    {
      "docIdx": 2, 
      "text": "YES ! Couldn't agree more - but the dancing parts could be a little better :) I mean it looks like Ryan was just not trying - I know he wanted to look \"cool\" like he dance like he doesn't care, but to me it didn't look good ;)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T16:07:25.114Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I wonder if that was his intention, to seem cool and smooth. Or was it lack of professional training prior to the movie. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T16:08:24.381Z"
    }, 
    {
      "docIdx": 2, 
      "text": "this is exactly what I was thinking when I watched it - but in the end I came to the conclusion that it doesn't matter as it simply doesn't look good :) I mean viewer should not ask questions like that :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T16:10:04.893Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree he should of had more training. But I also think that viewers are really good at being critics. If he danced better, would we be talking about another point of the movie in a negative way?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T16:11:22.917Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well that's their job to NOT make points like that in the movie ;) They ( makers of the movie ) should not give us bullets to shoot at them ;) You know what I mean ?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T16:13:31.517Z"
    }, 
    {
      "docIdx": 3, 
      "text": "True statement. I guess that just shows that it was a good movie, not perfection. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T16:14:25.586Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's exactly what it was - a really good movie, but I don't know if it deserved an Oscar ;) I'm not saying it didn't, I'm saying I'm not so sure if that would be my pick...", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T16:15:40.897Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think the Oscar came from the musical/something different aspect. If it was up against other great musicals I am sure it would have not won. Still a good movie. And like we stated, a wonderful soundtrack. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T16:17:51.203Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, but it's not one of those movies I would again ( or couple times ) - there are movies like that for me, but this one is not one of them ( but im not saying I didn't like it )", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T16:19:48.491Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The critics responses are interesting. A wide variety of opinions. Typically with an Oscar win, critics are pretty much in uniform", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T16:21:07.898Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh, I didn't know that - I thought movie was generally liked ;)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T16:21:45.670Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-05T15:34:11.871Z", 
  "uid1LogOutTime": "2018-02-05T16:21:50.674Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-05T15:34:11.922Z", 
  "uid2LogOutTime": "2018-02-05T16:21:10.264Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2499", 
  "user2_id": "USR4067", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 3
}