{
  "date": "2018-03-21T21:18:42.198Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "This movie is about toys that pretend not to be alive when people are around.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:20:50.347Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you seen a movie like this?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:21:39.911Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The two main characters are toys of different eras. Woody is an old-fashioned pull-string cowboy doll, while Buzz is a state if the art astronaut toy representing the progression of technology while Woody represents more old fashioned analog technologies.  Eventually the two become friends and the message is old an new can work together to make something even better than either of them are on their own. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:23:01.502Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes.  Did you enjoy this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:23:42.114Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did.  Of course, Disney Pixar are experts at pulling on everyone's heart strings. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:24:13.900Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you enjoy the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:24:51.979Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was a movie that did that.  I really like movies like this. They are really good for children and adults.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:25:02.615Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Exactly. I loved this movie when I was little, and still, love it when I am now an adult. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:25:50.498Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do too.  It is a classic movie that will stand the test of time.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:26:27.846Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Absolutely. The animation is now considered a little outdated and new movies are better aesthetically,but when it comes down to it, nothing will ever surpass the popularity of the classic Disney movies. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:27:23.466Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I've never met someone who didn't like toy story. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:28:11.670Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree.  They have a way with creating amazing characters.  Just look at Woody and how he and Buzz become friends.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:28:43.471Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes it is a classic story model, of the rivals that eventually become the best of friends, but Disney has a way of making it feel fresh and new, and not overdone. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:30:15.706Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree.  I also think they pick good voices for their characters.  Just like they picked Tom Hanks for Woody.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:31:29.619Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, those two are like America's dads. They have very trustworthy voices. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:32:29.818Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I also think that the secondary characters like Mr. Potato Head and Slinky Dog really add to the enjoyment of the movie.  They give you the comic relief that is needed to make this movie fun and enjoyable.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:34:03.898Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Comic relief is very important, but it is a bad movie that relies solely on comedic moments to carry the storyline.  Toy story doesn't do that. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:34:59.634Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No.  It takes the kid in all of us through a ride toward two characters friendship.  I agree with you that they made that common story plot and made it fresh.  It is amazing how creators can make such amazing ways to convey themes like this.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:36:26.395Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It is clear that most people agree on that, based on it's ratings. 100%, 9/10, and 95/100. Everyone enjoys this movie. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:39:48.215Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes.  I think I that when they describe scenes like when Woody gets upset and thinks that Buzz is becoming the favorite toy, people can see it in their heads.  They can see Woody trying to get Buzz stuck behind the desk.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:41:24.317Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Exactly. Envy and jealousy are very human emotions. Ones that viewers can really relate to. It is clear that woody just doesn't want to be replaced and that is clear from the very beginning when all the toys set up a recon operation at the birthday party to ensure that the presents he receives don't replace them. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:43:41.378Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think that it is a novial idea to have Buzz think he is a real space ranger.  It gives the story depth that other plots of this type don't have because he is unknowingly making the other toys like him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:47:29.189Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It makes me wonder if the other toys thought they were real cowboys, dinosaurs, and potatoes when they first came out of the box. But Buzz sticking to his guns and refusing to break character or acknowledge that he is not a space ranger is what makes him so endearing. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:49:43.276Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think I would like to think that they all thought they were real cowboys, etc.  It gives it a more dynamic thought process to it.  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:51:50.554Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I do too. Also the scene towards the end of the movie where Woody is insisting that Buzz can't fly and Buzz says \"we're not flying were falling with style\" implies that he finally realizes that he isn't a space ranger he is a toy.  And maybe all toys go through this adjustment process. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:53:59.722Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah.  I also am thinking about the scene at the end of the movie where they find go recon Andy's gifts at Christmas.  They give each other worried smiles when they see it's a puppy.  I would like them to be thinking about how to incorporate this pooch into the mix of toys.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:56:06.232Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Its the same worried look that woody had at the beginning of the movie when Buzz was unwrapped, but now he has someone to share it with, who feels the same way. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:57:21.762Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It is now that I think about it.  Completely the same look.  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:57:48.088Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Did you watch more Pixar movies because of your enjoyment with this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T21:58:18.073Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Exactly the same look. They are both dismayed but they eventually come around to the dog, as we see in the second movie.  yes, I love Disney and Pixar movies and I remember seeing Toy story when I was very little and have been watching ever since. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T21:59:44.096Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, thank you for a lovely conversation about this movie.  It has been very enjoyable talking to you.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T22:00:25.636Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-21T21:18:42.198Z", 
  "uid1LogOutTime": "2018-03-21T21:59:56.476Z", 
  "uid1response": {
    "feedback": "The process is a little slower than expected, but still, it was fine. ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-21T21:18:42.215Z", 
  "uid2LogOutTime": "2018-03-21T22:00:30.295Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1601", 
  "user2_id": "USR3953", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 29
}