{
  "date": "2018-03-21T19:50:39.341Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "lets talk about home alone a 1990 film written and produced by john hughes", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T19:51:46.594Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh, I am interested in seeing that movie.  Can you tell me what it is about?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T19:52:09.374Z"
    }, 
    {
      "docIdx": 0, 
      "text": "it is about a boy who is mistakenly left behind when his family goes on vaccation to paris for chrismas", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T19:52:44.079Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Who is the main star of this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T19:52:55.798Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Macaulay culkin is the star he plays the character of kevin", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T19:53:25.475Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Thanks for that info.  Can you tell me, how long is this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T19:53:28.646Z"
    }, 
    {
      "docIdx": 0, 
      "text": "you know i don't know that you may find that info on the web but did yo know it gets a cinemascore of a?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T19:54:17.124Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No, I did not know that.  Thank you for that information. Is this movie a comedy or a drama?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T19:54:47.257Z"
    }, 
    {
      "docIdx": 0, 
      "text": "it is a comedy in witch the boy left behind named kevin creates elaborate booby-traps compared to the rube goldberg machines\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T19:56:11.622Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That sounds really funny. Can you tell me more about the villian or villians?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T19:56:46.459Z"
    }, 
    {
      "docIdx": 1, 
      "text": "the villans are played by joe pesci as harry and daniel stem as marv the movie starts with kevin being left behind due to a power outage caused by einds the morning they left for vaccation", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T19:58:21.026Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh, Joe Pesci.  I love that guy. He plays some amazing characters.  Do you happen to know what time of year the movie was released?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T19:58:47.503Z"
    }, 
    {
      "docIdx": 1, 
      "text": "If that information isn't there, please don't worry about it, I'm just asking questions as directed...trying to keep this going.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T19:59:58.705Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do not but the movie is highly praised for the conversation between kevin and marley as well as the final scens of the movie", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:00:04.830Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Can you tell me are there any scenes that would frighten a young kid?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T20:00:24.532Z"
    }, 
    {
      "docIdx": 2, 
      "text": "well i would have to say the scene when kevin gets left behind that morning could slightly scare a young child as i remember as a child being scared to be left alone but i could also see some children finding it exciting ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:02:09.670Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I have a very sensitive child.  I think he might be disturbed that this happened.  Tell me, how did the parents manage to forget him?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T20:02:41.500Z"
    }, 
    {
      "docIdx": 2, 
      "text": "i think the scene where kate discovers kevin is missing might frighten parents more than any scene would frighten children", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:02:59.112Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Ha, you know, I remember that image from years ago.  What is the name of that actress?  Catherine...something, right?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T20:03:30.171Z"
    }, 
    {
      "docIdx": 2, 
      "text": "you know i am not really sure but i am sure it could be found online her characters name is kate and she does everything she can to get back to kevin but only makes it as far as scranton pennsylvania", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:04:52.422Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think it's Catherine O'Hara.  But no matter.  When was the last time you watched this yourself?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T20:05:21.079Z"
    }, 
    {
      "docIdx": 3, 
      "text": "had to have been when i was a small child i remember the scene when she gets in a van with a polka band that was on there way to milwaukee ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:06:39.922Z"
    }, 
    {
      "docIdx": 3, 
      "text": "and the scenen where kevin returns home and booby traps the house and all the fun begin with harry and marv", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:07:16.996Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Hmmmm....that reminds me of another movie that I loved.  But I guess we are supposed to discuss only this movie.  Did you know that the actor John Heard, who is the Dad in this movie, recently died?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T20:07:26.265Z"
    }, 
    {
      "docIdx": 3, 
      "text": "no i had not heard that thats to bad he was a good acter. in the movie on chrismas day kevin was disappointed his family had not returned i would have felt the same way as a child ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:09:06.551Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I spent one Christmas entirely alone and I do not recommend it for anyone.  it's very hard.  It would crush a child, I am sure.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T20:09:49.125Z"
    }, 
    {
      "docIdx": 3, 
      "text": "didn't seem to affect kevin in the way it would have most children he set up many booby traps that were just ingenious like when the snow shovel hits marley and knocks him out ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:11:06.371Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I actually don't really enjoy comic violence like that.  Is there a lot of that stuff?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T20:11:49.031Z"
    }, 
    {
      "docIdx": 3, 
      "text": "the funniest scene to me is when buzz yells out kevin what did you do to my room", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:11:50.540Z"
    }, 
    {
      "docIdx": 3, 
      "text": "there is the whole movie is based on kevin booby traping the house and hurting the intruders", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T20:12:21.385Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-21T19:50:39.341Z", 
  "uid1LogOutTime": "2018-03-21T20:12:58.374Z", 
  "uid1response": {
    "feedback": "I don't like comic violence, it is a cheap form of humor and not all that funny.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-21T19:50:39.363Z", 
  "uid2LogOutTime": "2018-03-21T20:12:40.181Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR232", 
  "user2_id": "USR309", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 20
}