{
  "date": "2018-02-16T13:56:36.857Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "This movie was like a \"Who's Who\" of early 2000's stars.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:58:23.083Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was!  What did you think about the Rotten Tomatoes review of 84%?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:59:01.124Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It must have been a popular movie because of the star power.  Even CinemaScore gave it an A-.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:59:45.667Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I noticed that.  Do you know anything about the non-fiction book it is partially based on?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:00:32.105Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do not.  In fact, I was surprised to see that.  I was equally surprised to see it was written by Tina Fey.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:01:04.732Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I was surprised too.  Do you think Lindsay Lohan was a good pick for the Cady Heron role?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:01:56.364Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Given the movie's positive critical reviews, she must have been.  I wonder whether Rosalind Wiseman has written any other books that were parlayed into movies.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:03:48.370Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I was curious about that as well.  It's making me want to research that further, I'll probably google Rosalind Wiseman later.  Do you think the movie accurately portrays high school cliques?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:05:55.510Z"
    }, 
    {
      "docIdx": 0, 
      "text": "As with any satire, I'm sure it was exaggerated even though there was probably a strong grain of truth to it.  \nIt's neat that even 8 years later Rotten Tomatoes still considered it one of the Top 50 teen comedies.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:07:07.749Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yep!  But, I was wondering about the Genre being \"Comedy, teeny\".  Do you think there is an appeal to audiences beyond that group?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:08:14.257Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Initially, no.  But as the intended audience gets older, I'm sure it will be re-watched countless time.  Even still, I'm sure all ages can relate to dealing with cliques, especially the \"Plastics.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:10:32.866Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I think the \"Plastics\" exist in all schools.  I think the revenge aspect is pretty prevalent as well.  Do you see it that way?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:12:01.944Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I actually worry that the revenge aspect might give some kids the wrong idea.  It also bothers me that Janis uses Cady to get her revenge.  I worry that Cady would be naive to that kind of thing since she had been homeschooled her whole life.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:13:56.950Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I too, wondered about the homeschooling aspect of it.  I also think the fact that Cady was in Africa for 12 years made her even more naive, and susceptible to playing a role in getting revenge. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:17:10.938Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Most likely, yes.  \nIt would have been best if Janis and Damian would have just stayed friends with Cady and let her be herself.  I'm sure her friendliness would have drawn Gretchen and Karen away from Regina.  In fact, that would have been the perfect revenge because Regina would have lost her power and influence.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:17:39.732Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It's pretty sad when the most infamous group is considered the most popular!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:19:01.953Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes it is!  \nOf course, I'm sure all of this was played for laughs since the movie was a comedy.  If you think about it, Cady's home life was pretty unrealistic.  Zoologist parents, twelve years in Africa...it screams hyperbole.  I guess they were really trying to play up the \"fish out of water\" aspect.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:20:07.039Z"
    }, 
    {
      "docIdx": 2, 
      "text": "And, she was a \"fish out of water, for sure!  There is a dark side to this, however.  Regina's broken spine is pretty bad, don't you think?  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:22:26.740Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm glad that all the deception and backstabbing finally came out when Ms. Norbury made the girls face the way they were treating each other, but I agree it was horrible what happened to Regina! Total shocker.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:23:07.865Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I do love the \"confrontation\" in the gym.  How do you feel about that?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:24:19.443Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That big fight that broke out when the Burn Book was revealed was pretty crazy, but the thing in the gym really took the cake.  Even though it was initiated by a drug-dealing math teacher.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:25:28.507Z"
    }, 
    {
      "docIdx": 3, 
      "text": "In your mind, who is the bigger villain, Regina or Janis?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:26:39.918Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Probably Janis because hers was a latent rage.  \nIt was really tricky how Regina put the fake things about herself in the Burn Book to throw off suspicion.  I hope real teenage girls aren't actually this conniving.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:27:43.527Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I hope so too!  I did find the breaking of the tiara pretty significant.  And passing out the pieces to others was a genius move, don't you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:29:30.837Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm really glad that Cady was able to redeem herself in the end by doing that at the Spring Fling dance.  Do you think being an outcast is what taught Cady her lesson?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:30:36.401Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think being an outcast forced her to evaluate her behavior.  We know she \"gets back to old self\".  I think this evolution occurs for a number of reasons.  Winning the competition, and making amends with Regina were key.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:34:11.233Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Indeed. \nOverall, the movie had a good message.  The only way to overcome guilt is to admit your faults, and there is some good in everybody.  As Cady said, everybody is wonderful in their own way.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:35:03.855Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree with your assessment.  I think for Cady, her declaration on stage was important to her.  It seems she is resilient enough to overcome the negatives and come out on the bright side.  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:37:29.844Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm also really glad Cady was able to make up with Janis, Damian, and of course Aaron.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:37:48.801Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It seems to me that Cady needed to get back to the way she was when she arrived at the school in order for her to like herself again.  There's quite a few lessons for all of us here.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:40:45.863Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yep.  Despite all the treachery, there are some good takeaways for other girls who may find themselves in Cady's situation.  Even though she was only 16, she was able to grow a lot emotionally.  I believe she learned to see people as they are instead of as they want to appear, the face behind the \"Plastic\" mask if you will.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T14:40:58.533Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes.  In many ways the Plastics were not much different than the rest of the kids in school.  Sixteen is a tough age, which is clearly shown in this movie.  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T14:42:39.487Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-16T13:56:36.857Z", 
  "uid1LogOutTime": "2018-02-16T14:43:15.731Z", 
  "uid1response": {
    "feedback": "If they other respondent wasn't a human, I'd never know it.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-16T13:56:36.903Z", 
  "uid2LogOutTime": "2018-02-16T14:43:43.439Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1374", 
  "user2_id": "USR2105", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 11
}