{
  "date": "2018-03-08T05:29:45.888Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Catch me if you can is a biographical crime movie featuring Leonardo DiCaprio and Tom Hanks. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:31:30.833Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I personally like the movie ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:32:25.520Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hi. I am here and looking forward to discussing. I have not done this before. I also like this movie. I chose it because I like movies (and books) that are based upon true stories.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:33:30.922Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I haven't done this before either. The film is about Frank Abagnale and before his 19th birthday he attained millions of dollars based off of con jobs. Although it is frowned upon, I think it is quite impressive. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:35:09.738Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is an amazing feat to do that! And an amazing feat that Spielberg was able to make such an unfavorable character and a series of crimes against other unsuspecting people funny.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:36:53.663Z"
    }, 
    {
      "docIdx": 0, 
      "text": "You're right about Spielberg, I never thought of it like that. The movie got such an amazing review on Rotten Tomatoes, 96%. The really speaks volumes to the directing by Spielberg and the acting by DiCaprio, Hanks, and the rest of the cast. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:38:25.231Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I was hoping you would bring up the cast. I assume I have to respond to you rather than raise a subject. tom Hanks is, in my opinion, the best actor out there. And DiCaprio really turns into his characters as well. Just the names of the stars was enough to recommend the movie to me. and you're right the amazing review only made it clearer that it was a non-miss.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:41:21.633Z"
    }, 
    {
      "docIdx": 0, 
      "text": "In the movie when the FBI turned to Abagnale to help to catch forged checks adds a little humor to the movie and kind of takes the audience away of how serious Abagnale's crimes were. I think that truly worked to the movie's advantage. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:45:45.339Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I find it amazing that a 19-year-old succeeded in impersonating people that were obviously much older than 19. He was an absolute genious..", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:45:47.112Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree! I would have never known he was 19 unless I was told! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:46:14.470Z"
    }, 
    {
      "docIdx": 1, 
      "text": "As for what you wrote at the same time I sent my message. Yes! It was such an ironic turn of events. But he certainly had the mind to get into anyone's mind, including other forgers.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:48:25.840Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think that Frank's family having financial issues and having to drastically downsize led him towards his passion and drive to get money. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:49:48.182Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What do you think of Frank's family?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:50:30.767Z"
    }, 
    {
      "docIdx": 1, 
      "text": "For sure. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:50:47.593Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Furthermore, his parents obviously were not 100% honest either, and certainly laid the foundation for such lack of concern for others.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:52:23.342Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I mean, lots of people have families with financial problems and divorce and they do not go ahead and impersonate other people.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:53:33.310Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He also came into a bunch of situations where the \"system\" was surprisingly vulnerable", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:55:55.513Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You're right! Frank seemed to have taken his financial and family problems to an extreme. Running away and forgery? Those are two things that most people don't think of. He made a lot of money from Pan Am forges, that is crazy. I didn't even know pilots could make so much. Do you think the Pan Am impersonations were impressive? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T05:56:02.143Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think the pilot impersonation was the most impressive of all. One has to go through a heck of a lot of training to become a pilot .", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T05:58:17.045Z"
    }
  ], 
  "rating": 3, 
  "status": 0, 
  "uid1LogInTime": "2018-03-08T05:29:45.888Z", 
  "uid1LogOutTime": "2018-03-08T05:58:38.313Z", 
  "uid1response": {
    "response": [], 
    "type": "abandonWithoutAnsweringFeedbackQuestions"
  }, 
  "uid2LogInTime": "2018-03-08T05:29:45.927Z", 
  "uid2LogOutTime": "2018-03-08T05:58:54.068Z", 
  "uid2response": {
    "feedback": "The other user left during the conversation during the second document. ", 
    "response": [
      1, 
      2, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1059", 
  "user2_id": "USR610", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 19
}