{
  "date": "2018-03-01T03:43:28.373Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello, I really enjoyed this movie, what did you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T03:44:41.982Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really liked it. It was interesting to see how Facebook was first founded. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T03:49:46.703Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was, do you usually like biographical movies like this one?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T03:50:44.148Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I tend to like biographical movies, they usually provide a fascinating look into the life of the subject in the movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T03:51:43.312Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree, I was very surprised to learn the Winklevoss twins were played by a single actor.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T03:52:29.771Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That’s what caught my eye too! I honestly thought they were just a set of twins playing the characters, I wouldn’t have ever guessed that they were played by just one individual.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T03:53:30.879Z"
    }, 
    {
      "docIdx": 0, 
      "text": "He was very convincing as two different people! I was also surprised to learn so many lawsuits were involved in the creation of Facebook.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T03:55:09.561Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah the actor did a great job as the twins. I didn’t realize either before I saw the film how many lawsuits were brought against Zuckerberg after he founded the site.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T03:57:29.674Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I also enjoyed Jesse Eisenberg's performance, he played Zuckerberg how I had always imagined him", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:00:34.195Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I love Jesse Eisenberg as an actor, so it was great to see him in a starring role. I hadn’t ever really thought much about Zuckerberg before I saw the movie, but I feel like Eisenberg played him perfectly - a really smart guy, but somewhat cold to most of the other people in his life and cocky about his success.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:03:46.839Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's how I had thought of him, smart and arrogant but kind of reclusive. I was also unaware and surprised to learn about the whole Facesmash website that happened before the idea for Facebook came around. It's interesting to see how Facesmash evolved into Facebook,", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:06:21.161Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I thought it was really cool to see how Facebook had evolved from the original idea of Facesmash. Kind of makes you think - the whole idea of Facebook came about just because Zuckerberg had made a site to let students rate the attractiveness of their female classmates.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:10:16.970Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It was amazing how it crashed parts of Harvard's network and then he got academic probation for it. And how that all helped lead to Zuckerberg actually meeting the Winklevoss twins and that all lead to the creation of Facebook. It's interesting to see how things like that get started.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:15:46.781Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree, I loved getting what felt like an “inside look” at the various people involved in the making of Facebook, and seeing how Zuckerberg first met the Winklevoss twins and their partner Narendra by chance mostly, because his Facemash site had caught their attention. It made me wonder if he had never met them, if the Facebook we know today would have ever come about. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:21:37.806Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yea, it definitely makes you think about that, I wonder if MySpace would still be big if Facebook hadn't been invented. I also didn't know that so many people were involved, especially since Zuckerberg was always the face of Facebook, I kind of always thought it was all him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:24:06.426Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh definitely, I feel like the advent of Facebook pretty much spelled the end for MySpace. If Facebook hadn’t come about, MySpace would probably have remained a lot more popular. And I agree, I had always been given the impression that Zuckerberg came up with the idea of Facebook all on his own and started it all by himself, so it was neat to see that there had been multiple other people involved in its conception.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:27:57.612Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I was really surprised to see the founder of Napster was involved, too. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:29:12.850Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Absolutely, I didn’t have any idea the two companies had a founder in common. I really liked seeing how Facebook was originally intended just for Harvard students, before it started expanding to include other schools. I remember when it was only available for college students.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:31:29.008Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I remember that, too! You needed a University email to sign up on Facebook, now everyone is on it. I don't remember is being called, \"TheFacebook\" though. I think dropping the \"the\" was a good idea from Sean Parker", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:33:57.929Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh yes, it started allowing anyone at all to join my junior year of high school, and everyone was so excited to get a chance to sign up! I agree that dropping the “the” from Thefacebook at Parker’s suggestion was a good idea, it made the name seem snappier and more memorable.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:37:02.480Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh you're a little younger than me, I was old enough to sign up while it was exclusive to college students my Freshman year. But it was open to everyone soon after that. I do have to say, I wasn't surprised to see the company move to Palo Alto after a while, they joined a lot of other big technology companies out there.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:39:24.187Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Ah, that sounds like it would have been really cool to get to use Facebook when it still only allowed people with university emails to sign up - bet it felt pretty cool and exclusive (which it seems like was the whole point, at that time anyway!). I wasn’t surprised to hear the company had moved to Palo Alto either once it started becoming more popular. Palo Alto is sort of the gathering place for most large tech companies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:43:48.148Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I felt kind of bad for Zuckerberg when he kept getting sued at the end.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:46:11.208Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I sort of did too, but then I remembered how much of a jerk he’d been to his supposed “friend”, Saverin, and how even now he tries to make it seem like Facebook was started solely by him with no help or outside influence. So then I tend to agree with his defense lawyer - that he’s seen as callous and uncaring, which makes him pretty a unsympathetic character. He didn’t even really seem bothered by the whole awful lawsuit with his “friend”.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:49:54.057Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's very true, he did really screw his friend over for a little bit of money. I found it a little funny how he kept refreshing the page after he friend requested his Ex girlfriend. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:51:10.643Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It just seemed so cold to do that to someone who was his friend and had been there with him from the very beginnng of Facebook. And yes, I thought it was petty funny how he just kept refreshing his ex girlfriend’s page, waiting for her to accept his friend request. Kind of showed me that he was still bothee", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:53:05.340Z"
    }, 
    {
      "docIdx": 3, 
      "text": "*bothered, even years later, by her rejection of him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:53:35.920Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yea, it was like it came full circle for him. It looks like there is an error since the last sentence says something about Superman and Clark's coffin.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T04:56:14.024Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Hah yes I saw that bit about Superman, kind of threw me for a loop for a second, but I assume it’s just an error. And yes, I liked how the movie came full circle, like you said.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T04:58:39.668Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-01T03:43:28.373Z", 
  "uid1LogOutTime": "2018-03-01T04:56:34.767Z", 
  "uid1response": {
    "feedback": "This took way longer than the estimated 20 minutes, it was hard to find things to talk about with the semi limited information given in the paragraphs. ", 
    "response": [
      1, 
      2, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-01T03:43:28.395Z", 
  "uid2LogOutTime": "2018-03-01T04:58:46.155Z", 
  "uid2response": {
    "feedback": "I made slight error and accidentally sent one messa before I finished typing it out, which is why I sent another message immediately after, with an asterisk (*) before the text, to show I was correcting an error I had made.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3366", 
  "user2_id": "USR2303", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 17
}