{
  "date": "2018-01-29T22:49:35.993Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello, did you enjoy the Avengers? I enjoyed the casting, as there were lots of familiar faces. It was surprisingly clever at parts, and was more than just a superhero movie to me.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T22:50:12.970Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No, I have not seen this movie, what is it about?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T22:51:02.592Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's a superhero film based on the Marvel team of heroes, it's about the team of heroes, Iron man, Captain America, the Hulk, and Thor, and their objective is to stop Thor's brother, Loki, from endangering Earth. It's pretty well received, and has a good sense of humor in my opinion. What do you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T22:52:13.064Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It sounds like a good movie, who does it have in it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T22:53:09.846Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Robert Downey Junior plays Iron man, Chris Evans is Captain America, and Chris Hemsworth is Thor. Scarlett Johansson is also in the film.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T22:54:18.854Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like Robert Downey a lot, he was great in Iron man. Do you find that the movie is true to the comic?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T22:56:22.484Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am unfamiliar with the comic, however, I know that it tells some of the origin story of the team of the Avengers, so that would be the point to compare.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T22:57:03.757Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do we have to start a new conversation about something else?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T23:02:09.724Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am not getting a new documents, however, I want you to know that if you are going to consider seeing the film, it has a metacritic score of about 70, but a 92% on rotten tomatoes, so it's received pretty well. Additionally, Hawkeye is in the movie. What do you think of that for your response? We are at 8 of 12.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T23:03:36.670Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Who is Hawkeye? I am not a huge fan of superhero movies, other than Spider-Man", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T23:07:30.956Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I believe hawkeye is an archer of sorts, wielding a bow. Additionally, the film has lots of humor, and Iron Man is a big player in this.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T23:08:22.407Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's good, as I said I like Iron man. Who else is in this movie besides Robert Downey?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T23:10:42.900Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Well, Jeremy Renner plays Hawkeye, and Scarlett Johansson is in the film as I said, she plays Black Widow. The film is becoming kind of old now, it came out in 2012, and Loki and Clint Barton are evil, Clint Barton being Hawkeye. I believe Hawkeye is enslaved by Loki in the film.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T23:12:18.352Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I like Scarlett Johansson a lot also. Is the Black Widow an arch villan?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T23:13:41.987Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I believe she is one of the SHIELD agents, but I am not sure if she is on the team with Iron Man. She wears a Black suit and is a hero or former hero to my knowledge. She is likely a main charac\nter.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T23:14:36.214Z"
    }, 
    {
      "docIdx": 2, 
      "text": "What are the Avengers trying to do in this movie?  Free Loki, have there been any other Avenger movies after this one?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T23:16:22.530Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I believe they are trying to defeat Loki and prevent him from enslaving others. Loki cooperates with aliens called the Chitauri, and he attempts to obtain the Tesseract to trade to them for the subjugation of Earth for him. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T23:17:35.275Z"
    }, 
    {
      "docIdx": 2, 
      "text": " So you would recommend this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T23:18:15.306Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I would, it has good reception, a sharp sense of humor, and science fiction elements (the Chitauri and technology the SHIELD org uses). Do any of these aspects interest you? I can answer any questions.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T23:19:05.993Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I've watched agents of shield on TV is that a totally different beast? Or does that have any of the same characters? I've only watched one or two shows when it came out.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T23:22:54.082Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I am unsure personally, but I am sure they cover the same fictional organization.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T23:23:16.628Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The avengers centers around the team of heroes, as well as Loki.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-29T23:23:34.129Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sounds good", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-29T23:26:33.882Z"
    }
  ], 
  "rating": 2, 
  "status": 0, 
  "uid1LogInTime": "2018-01-29T22:49:35.993Z", 
  "uid1LogOutTime": "2018-01-29T23:26:50.781Z", 
  "uid1response": {
    "feedback": "The other respondent was very knowlegable about this subject, but as I said I am not very interested in superhero movies.\n", 
    "response": [
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-01-29T22:49:36.027Z", 
  "uid2LogOutTime": "2018-01-29T23:24:21.966Z", 
  "uid2response": {
    "response": [], 
    "type": "abandonWithoutAnsweringFeedbackQuestions"
  }, 
  "user1_id": "USR4217", 
  "user2_id": "USR3103", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 7
}