{
  "date": "2018-03-30T19:57:23.737Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hi this movie sounds great I mean 9/10 ratings that is pretty epic for a movie a\nnd 100% on rotten tomatos", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T19:58:37.864Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, wow! Pixar first full length feature!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T19:59:56.443Z"
    }, 
    {
      "docIdx": 0, 
      "text": "not to mention being a comedy animation and adventure in one", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:00:23.021Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like the critical response about the scene when Buzz realizes he's a toy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:00:55.041Z"
    }, 
    {
      "docIdx": 0, 
      "text": "yeah that is a good part and critical responses are something to view what is good and what isn't", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:02:03.122Z"
    }, 
    {
      "docIdx": 0, 
      "text": "i liked the term razzle dazzle myself because it gives an unusual look they say", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:02:28.135Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Razzle Dazzle is a great description! Plus I really like the voice cast! They got some big names like Tom Hanks to do it!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:02:53.992Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can just see Don Rickles as Mr. Potato Head, too.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:03:49.086Z"
    }, 
    {
      "docIdx": 0, 
      "text": "haha yeah and tom hanks is the best part of the movie i think hands down of the cast choices", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:04:22.350Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It kind of surprised me that this was done in 1995, which is 23 years ago.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:05:32.870Z"
    }, 
    {
      "docIdx": 1, 
      "text": "yeah same but that makes it a classic worth seeing it seems based on everything read", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:05:56.358Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah,totally a classic worth seeing! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:07:49.984Z"
    }, 
    {
      "docIdx": 1, 
      "text": "i love when they talk about its the work of genius it tells you that the plot and the story itself on top of the ratings tell you it is a must see movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:08:09.341Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I guess I might sort of bugged about that, except in this case, it's probably true. Interesting that Steve Jobs was a producer on it. I am guessing that this is THE Steve Jobs from Apple.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:09:14.129Z"
    }, 
    {
      "docIdx": 1, 
      "text": "you know I did not catch that until you mentioned it but wow I would think the man from apple as well. Well that being said it might make this a even more must-see because I never knew the man did anything more than computers", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:11:14.395Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So the last reviewer puts this movie in his top ten list. Would it be in your top 10 list of movies? Or maybe top 10 list of kids' movies?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:12:04.023Z"
    }, 
    {
      "docIdx": 2, 
      "text": "that is a good question I mean I would think movies in general honestly based on the ratings itself I mean I wouldn't separate it into kids movies due to the rating cause very few movies get that kind of rating from rotten tomatoes.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:13:24.314Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Great points! I love how Disney movies always have life lessons for kids and adults. The relationship evolution between Buzz and Woody and the lessons about jealousy when Buzz shows up are great messages for all of us.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:15:43.417Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Plus the humor appeals to kids and adults.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:17:03.474Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I do agree disney movies are really great for doing that. I love that with this story, in particular, it gives you an idea that imagination happens. The fact that these toys are lifeless around humans present but alive when they are gone is a great touch to the imagination in our every day lives as kids. But yes the humor appeals to everyone so that's what drags us adults into them as well", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:18:12.076Z"
    }, 
    {
      "docIdx": 2, 
      "text": "What a great job to make a living using your imagination to come up with stories like this! And then write the dialogue. The one reviewer talked about the toys being true to their character. It's a real gift to be able to bring toys to life!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:20:45.575Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I normally don't sit down and watch movies these days like this one but this movie is worth every minute of time. It's too interesting not to watch no matter your age. but I do agree to be able to do this for a living making something so artistic is a dream come true.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:22:01.620Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Plus the scenarios they come up with like being trapped in a crane game, knocking Buzz out of the window, etc. How fun and how much they really make this movie great.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:23:22.877Z"
    }, 
    {
      "docIdx": 3, 
      "text": "when the family left without them after getting gas though was a kind of sad part in the movie to me. I mean I still think the movie is great but it is still a sad point.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:25:34.576Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I suppose every great movie makes us feel a range of emotions. What a triumph when Buzz and Woody use the rocket and then glide to a safe landing!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:27:33.303Z"
    }, 
    {
      "docIdx": 3, 
      "text": "But the part that I did love that was pretty funny was when woody and buzz couldn't imagine a new toy being worse than buzz then they see its a puppy i laughed at their expressions on their face when they looked so worried", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:27:40.517Z"
    }, 
    {
      "docIdx": 3, 
      "text": "oh yes i was so happy they made a safe landing we didn't need a tragedy to happen :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:28:16.128Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, that was a great moment! I wondered if we would get a sequel to this movie. I hope, I hope!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:28:37.398Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That would be great if we did. I think the director John Lasseter did an amazing job with this movie and writing technique.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:29:19.191Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I wondered if the puppy would get to see the toys in action or if they go lifeless for the puppy, too. I agree that the director did a super job! It makes me want a Toy Story 2.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T20:30:17.975Z"
    }, 
    {
      "docIdx": 3, 
      "text": "sam here and yeah would be kind a cool to see if they talk to the puppy or if they can communicate or not", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T20:31:18.042Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-30T19:57:23.737Z", 
  "uid1LogOutTime": "2018-03-30T20:31:20.556Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-30T19:57:23.754Z", 
  "uid2LogOutTime": "2018-03-30T20:33:03.450Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3685", 
  "user2_id": "USR4649", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 29
}