{
  "date": "2018-02-16T02:37:14.069Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Have you ever seen the 2004 hit The Notebook starring Ryan Gosling and Rachel McAadams?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:38:25.364Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No I have not seen that movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:38:47.765Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you enjoy romance movies in general?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:39:29.521Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I really love romance movies Does the movie involve two people who fall in love?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:40:03.733Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I don't want to spoil this movie, but yes it is an epic romance that takes place over the lifetime of two young people from days gone by.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:40:59.738Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Does the romance movie have funny moments like a romantic comedy would have or is it a serious romantic movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:41:55.167Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I would say there is a healthy amount of both. There are moments of pure drama and some sadness, but there are also moments of pure elation that can be felt very deeply by the person watching. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:42:58.818Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you like the movie enough that you got absorbed into the story line?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:44:12.094Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes definitely. It almost feels like you are in the movie with them. I especially loved one of the scenes in the middle where they are fighting and it seems like they hate each other but they end up kissing. It feels very realastic.\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:45:57.304Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Is there any foul language or sex in the movie? What is the rating?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:47:21.192Z"
    }, 
    {
      "docIdx": 1, 
      "text": "There are some sensitive scenes and mild foul language, but nothing that would be more than a PG 13 rating.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:48:55.983Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So would you recommend a teenager watch this movie if I took my daughter to it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:49:58.211Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Every teen is different but i personally saw this movie when i was a teenager and i still love this movie to this day. The romance between the two main characters Noah and Allie is such a classic love story. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:51:27.618Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Was there any religious theme to the movie regarding God or morality?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:52:27.626Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No there isn't much regarding religion in this movie. It is more of the \"wrong kid from the wrong tracks\" falls in love with a wealthy girl and her parents doesn't\n approve of the match, but that doesn't stop their love story from unfolding. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:54:40.661Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Did they have any children together in this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:55:23.008Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes but you find that out later on in the movie.  While watching you realize alongside Allie and Noah that their relationship might be to hard to keep from falling apart and they both move on from each other, even though their love is still very much a part of them.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:57:09.084Z"
    }, 
    {
      "docIdx": 2, 
      "text": "How did a rich girl meet the poor boy from the wrong side?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:58:44.235Z"
    }, 
    {
      "docIdx": 2, 
      "text": "They met how many people did before internet dating. They met at a social gathering among friends at a carnival. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:00:15.962Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Did both characters realize right away that it was love between them?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:01:29.781Z"
    }, 
    {
      "docIdx": 2, 
      "text": "In their relationship Noah is the sure and steady one. He knew right away he had to meet this girl. Allie was smitten but was more reserved than Noah.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:02:36.309Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What made Allie realize that Noah was the one for her?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:03:35.364Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think it is Noahs persistence and tenacity. I personally really like the continuing theme of houses throughout the m ovie. As a labor of love Noah completely rebuilds Allie and his dream house, it becomes his obsession even after they broke up because of the pressure of Allies family, particularly\n mother. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:06:05.675Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Is it a superficial material love since Noah builds Allie a dream home to win her heart?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:08:01.356Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh no it is anything but a superficial love. Noah's father sold his tiny home to buy Noah the run down dream home that he knew his son and Allie both treasured. Noah after returning from the war decided to fix it up, not knowing if he would ever even see Allie again. If he couldnt have Allie because\n she was to be married to another man then Noah figured he at least could fix up the house. But Allie did come back.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:10:27.093Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So when Allie came back and saw what Noah did it touched her heart? Would that be the main climax of the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:12:00.166Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, that is when she realized he was still very m uch in love with her just as she was with him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:15:26.257Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So was that the end of the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:15:55.074Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Not quite, the few last scenes of the movie show a much older Noah and Allie rehashing their love story. only Allie cannot remember most of it.  Noah spends day in and day out trying to \"bring his Allie back to him\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:17:40.663Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Does he ever get her back? Is it a happy ending?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:18:19.350Z"
    }, 
    {
      "docIdx": 3, 
      "text": "In many ways it is a happy ending, only not a typically hollywood happy ending. Allie remembers Noah and their life together. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:19:22.448Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sounds like a wonderful movie that I will go and see. Thank you so much for the information and sharing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:20:02.832Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-16T02:37:14.069Z", 
  "uid1LogOutTime": "2018-02-16T03:20:05.114Z", 
  "uid1response": {
    "feedback": "I will definitely watch the movie", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-16T02:37:14.092Z", 
  "uid2LogOutTime": "2018-02-16T03:20:29.721Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2456", 
  "user2_id": "USR1423", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 12
}