{
  "date": "2018-03-03T03:31:14.921Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "have you seen this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:32:31.498Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I watched it, but I think I wasn't paying very close attention to it, actually.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:32:54.986Z"
    }, 
    {
      "docIdx": 0, 
      "text": "can you remember any funny parts? (I have no idea what to ask LOL)", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:33:43.654Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I recall a scene in a warehouse space, where he goes to open a filing cabinet, and it keeps going, and going, and going... like the drawer is infinitely expanding. It was kindof a cool sight gag at the time. Do you like Morgan Freeman as God?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:35:15.494Z"
    }, 
    {
      "docIdx": 0, 
      "text": "that part was funny. I think Morgan Freeman was great as God. Do you think Bruce over did it when he got the chance to be God?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:36:28.994Z"
    }, 
    {
      "docIdx": 0, 
      "text": "He was pretty rotten. But, you know, God/Reporter is not really a great pairing for jobs, IMO. That Cirtical Response though; OUCH! It might be a bad movie, but I'm not sure I think calling him not a real actor was called for. You?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:38:22.129Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think he over did his part as well. Not always a bad actor no. Do you think they should have chose someone else other than Jennifer Aniston to play Grace?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:39:43.533Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah. I never really saw her appeal. She seems to land a lot of kindof preachy roles, and not really a great fit for Carrey, who is so rubber-faced. Maybe they were hoping she could get her fans in the seats?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:41:56.521Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Very much agreed. Do you watch many of these types of slap stick comedy movies?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:42:42.619Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I seem to end up watching this sort of thing at home, but I almost never pay to see it in the theater. Nine dollars is too much to gt a chuckle. Did you see it with friends or on your own?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:43:45.991Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I don't seek them out, either. They're just on, and I fail to change the channel.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:45:03.959Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I watched it at home as well, with friends. How do you like Steve Carell in this movie as Evan Baxter? Was he funny to you at all? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:45:44.131Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I love Steve Carell. They tried to make him pretty unsympathetic, here. I guess you are supposed to root for the put upon reporter, who's clearly willing to cheat on his girlfirend, and has no work-life balance?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:47:14.215Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The role can't have been that good, though. Can't remember a single piece of Evan/Carrel's\n dialogue.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:48:08.931Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I love Steve Carell as well. I think they just made Bruce look bad because he was jealous of Evan's success..etc.. I kind of thought that scene was funny where Bruce made Evan say other stuff on live TV, other than his lines. Do you remember that part? What are your thoughts?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:49:04.213Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh! Ha! Yeah, I remember that, just not the words. I do remember it being pretty cringe-worthy. But it was kindof unbelievable that a news station in a city like that would give anyone an on-air promotion. That's little-town stuff, you know? I had trouble suspending disbelief for that.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:52:29.833Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree with that! I think the movie deserved a lower rating! It wasn't too terrible but some times Jim Carrey mocies can be too much over the top.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:54:39.335Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It kindof did a disservice to women, with the \"hoping for a proposal\" thing. I don't know, maybe that's just me.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:55:51.436Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Why do you think CinemaScore gave it an A?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T03:57:15.744Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can so agree with that. I have no idea about CinemaScore. I should probably look into that. Do think Bruce's email and sticky note systems were sufficient? Do you think you'd do something differently?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:58:45.228Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The voices from prayers in my head would make me think I was crazy too!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T03:59:20.238Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, there are all sort of cultivation flows an omni-benevolent, omnipotent diety might set up to automate things. Like, maybe, an importance/urgency rating? A tag system? And where are the office workers. I would assume if you're god you can magic yourself up topical angels. And didn't they kindof overlook the \"all-knowing\" facet of God, too? Why not ask: Would granting this prayer make things worse or better? ... And HA! Yes, if I heard voices like he was, not only would I think I was going crazy, but I would GO crazy. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:03:42.693Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes! I think I would be bad and use it a little bit to my advantage by making myself win the lottery instead of all those people that were praying to win the lottery.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T04:05:01.977Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Can you imagine using those powers that Bruce did like discovering Jimmy Hoffa's body! He did it in such a bad way to earn his job back", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T04:06:20.587Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I would probably dink around with karmic rewards/punishments, myself. It would be really tough to manage in a WEEK, though, right?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:06:29.558Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Bruce Nolan clearly doesn't think big enough.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:07:04.991Z"
    }, 
    {
      "docIdx": 3, 
      "text": "No he definitely doesn't. The ending somewhat ended well given the movie with Bruce and Grace getting back together. Do you find it ironic that Bruce started praying in the end?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T04:09:24.744Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Knowing that God had very little bandwidth? Yeah. I didn't care about the couple getting back together. I think she was actually better off without. But I did appreciate the greater sense of contentment, a little? So it says he was being revived... do you remember how he came to be in need of reviving?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:12:37.266Z"
    }, 
    {
      "docIdx": 3, 
      "text": "In Buffalo NY, no one would care about a local anchor proposing on live tv. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:13:37.744Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That part I cannot remember. Yea that live proposal was a little too much and dramatic for the news! Do you remember what the sign said the \"homeless man\" was holding in the end?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T04:15:11.501Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't actually. But it played with that idea people sometimes trot out, of what if the crazy person that says he hears god actually IS hearing god. Kindof just wanted Morgan Freeman to narrate the credits at that point. I was done.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:17:08.753Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm trying to figure out if we covered everything. Morgan Freeman is definitely a great narrator! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T04:18:08.001Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do ratings matter to you when you're choosing whether to flip the channel or not?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:18:26.945Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Somewhat for me yes. I mean I'm definitely not going to watch something that rated 1 out of 5 stars", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T04:19:41.626Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Haha. Me either. But I probably am not as eager to watch the 5 star Oscar pick either.  With comedies, you are not really ever looking for stellar performances so much.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:21:02.651Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And it looks like we're done! Thanks for the chat! I hope you have a great evening!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-03T04:21:22.087Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thank you!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-03T04:21:51.471Z"
    }
  ], 
  "rating": 2, 
  "status": 1, 
  "uid1LogInTime": "2018-03-03T03:31:14.921Z", 
  "uid1LogOutTime": "2018-03-03T04:21:54.908Z", 
  "uid1response": {
    "feedback": "It was fun!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-03T03:31:14.964Z", 
  "uid2LogOutTime": "2018-03-03T04:22:00.589Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4694", 
  "user2_id": "USR1912", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 15
}