{
  "date": "2018-03-07T06:03:10.030Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hi", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:03:43.872Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello, this movie looks pretty disappointing, don't you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:04:47.329Z"
    }, 
    {
      "docIdx": 0, 
      "text": "which movie ?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:05:11.928Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Batman v Superman: Dawn of Justice. I'm looking at all the reviews and they are not positive.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:05:39.796Z"
    }, 
    {
      "docIdx": 0, 
      "text": "when did it come out?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:06:05.424Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm pretty sure it came out in 2016. Have you seen it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:06:26.350Z"
    }, 
    {
      "docIdx": 0, 
      "text": "not yet> have you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:06:51.372Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah. It has Su\nperman, Batman, Wonder Woman, and Lex Luthor. The premise of Luthor causing Batman and Superman to fight each other seems neat enough, but from the critical reception, I wouldn't recommend it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:08:08.424Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wow. Who is your favorite super hero?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:08:56.325Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I have always liked Batman, but it sounds like this film doesn't do him justice. Ben Affleck starring as him also isn't really a high point. Did you know the others actors/actresses in the film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:10:21.496Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Right, I liked the other guy,, forgot his name. Who are the bad guys...the joker ? etc.\n  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:11:43.946Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No Joker, but I see there was one critic who said Jesse Eisenberg's Lex Luthor acted like a combination between Joker and Riddler. I find it interesting that this film links so closely to the 'Man of Steel' film from a couple years ago. Do you know the connection?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:13:39.360Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Right , I follow you . who played wonder woman?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:15:38.571Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think that would be Gal Gadot. Its funny she doensn't have such a big role in the movie. She only gets briefly mentioned whenever they are describing the plot. Does this movie sound like one you'd like to go see?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:17:18.299Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think I would like it. I really like the super heros. so I think I would like a group of them. \n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:18:53.225Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I did too until I saw the reviews. Its nice to see an older batman in a movie where he already has a lot of experience. He already has the contacts and the knowledge to track down Lex while he is importing kryptonite that he claims is a deterrent for superman. We all know Lex always has alternative plans though. Sounds a bit nonsensical if you ask me. Have you enjoyed Zack Snyder movies in the past? (He's the director)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:21:33.721Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Becareful of the reviews. I have found some movies that were very good that were poorly reviewed.  Yes, I remember Zack. Good stuff . AS far as kryptonite goes, a superman movie without it is impossible.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:23:00.024Z"
    }, 
    {
      "docIdx": 2, 
      "text": "In that case, I may give it a try. The part where Batman and Superman meet sounds cool. Lex kidnapping Superman's mother, and trying to get Superman to kill Batman or else his mother will die. Can you guess how that turns out?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:24:43.420Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Wow, I can remember supermans mother from the other movies. A super hero kidnapping . I would put my money on superman over batman. How about lois lane. is she kidnapped?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:26:37.012Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Batman actually turns the tables on him and is about to kill him when Superman asks him to \"Save Martha\" (which happens to be the name of Batman's deceased mother). This stops batman until an unkidnapped lois lane shows up to explain how Lex has pitted them against each other. They then team up, Batman going to rescue Martha, and Superman going to confront Lex. The more I think, this movie may not be as bad as people think. What do you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:28:48.171Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The plot sounds good. I would check it out. I like the story line you presented.  Lots of good things can happen", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:30:40.201Z"
    }, 
    {
      "docIdx": 3, 
      "text": "A lot of the criticisms seem to revolve around there being a lot of senseless action and no plot. But personally, I like a good fight scene, and the plot seems good enough to be interesting. If you had to guess, what kind of rating do you think this has?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:32:11.570Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I would guess an 8. But sometimes I don't trust the ratings. Do you think they ccan be manipulated?  I like action , especially with action hearos.\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:33:18.552Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The score was sadly 4.9/10 on average. With such a cool ending, I don't see how that was the case. Superman ends up dying and Lex in prison, but this sets up for something even greater. Lex says the world is vulnerable to alien threats now, so what do you think Batman will do?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:35:30.769Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well. That set s up a nice sequal. I would think that batman will be able to handle the aliens. Especially with help from the others. Poor rating. I don't beleive it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:37:09.717Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, he starts planning to bring together a team of metahumans to combat this threat. Luckily, earlier in the film he saw some of Luthor's files on other metahumans that are known about. Even with Superman's death, the ending doesn't seem to be all. Superman's coffin levitates a little bit right before the movie is over. Truly the sign of a great movie if you ask me.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:39:03.576Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think they will all join forces and fight the aliens together. Do you think that might happen/?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:39:47.112Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think that's exactly what would happen. I'm glad the film closed with such a touching funeral scene with Wonder Woman, and Batman consoling Superman's mother. Just think of the emotion in the next film. After considering it, I would highly recommend this movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:41:06.008Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, that is a nice ending. I think I will see it soon. The future is going to be interesting for them . I hopw the aliens come soon so I can see the next movie. Do you think they will use the same cast?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:42:30.049Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Likely. I hope to see Affleck, Cavill and Gadot again. I think I could do without Eisenberg's Luthor though.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T06:43:11.343Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Interesting. Why don't you like eisenberg as luther?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:44:20.937Z"
    }, 
    {
      "docIdx": 3, 
      "text": "great ... cya at the movies...\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T06:45:08.080Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-07T06:03:10.030Z", 
  "uid1LogOutTime": "2018-03-07T06:44:33.667Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-07T06:03:10.320Z", 
  "uid2LogOutTime": "2018-03-07T06:45:12.979Z", 
  "uid2response": {
    "feedback": "sounds like a good movie", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4557", 
  "user2_id": "USR4050", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 13
}