{
  "date": "2018-03-27T15:10:18.905Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi, how are you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:10:59.993Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Good, Yourself? What do you think about the movie Ironman? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:12:08.442Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm ok. I liked the movie Iron Man, and I thought the cast was good", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:13:36.723Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I agree. Robert Downey Jr. as Tony stark was a great pick! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:14:47.387Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree. And I feel like Jeff Bridges playing the part of a bad guy was a good pick too", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:16:08.530Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I didn't realize the movie got such a good review from Rotten Tomatoes-- I feel like they always rate fairly low", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:16:46.132Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes! Thats probably why it got such a great review on rotten tomatoes and metacritic. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:17:07.752Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I forgot it was the first marvel movie in the series as well. One the best in my opinion.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:17:39.510Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did too. I haven't kept up with most of the newer ones and the whole superhero genre isn't really my thing, but I really liked this one", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:18:31.812Z"
    }, 
    {
      "docIdx": 0, 
      "text": "You dont think having a super powered exoskeleton would be cool!?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:19:55.603Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The special effects in the movie are very well done as well.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:20:16.778Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I totally think it would be cool! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:20:41.016Z"
    }, 
    {
      "docIdx": 1, 
      "text": "One of my favorite parts of the movie is when the captive doctor invents the magnet to keep the shrapnel from reaching his heart-- it was really nice of him to do that, and genius as well", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:22:04.747Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That was a very interesting part of the movie, I agree. How did it make you feel when he was ambushed and then almost died? I was afraid for Tony!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:23:23.842Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree, that a scary part of the movie. I thought for sure that he was going to die", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:24:46.459Z"
    }, 
    {
      "docIdx": 1, 
      "text": "But at the same time, it was kind of an ironic moment since it was his missile that almost killed him", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:26:13.541Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That is a funny way of thinking, actually! A missle put him there and they he needed to build one to get his freedom back. Would you have trusted Raza and built a missle for him?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:27:43.578Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Definitely not! I'm sure that even if I were to build the missile that he would kill me anyway, and if he didn't I would still be scared of what his intentions were with the missile. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:28:26.847Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's a terrorist group, they don't have any kind of good intentions in my opinion", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:29:14.387Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm with you on that, but he did have shrapnel shards in his chest. It's crazy that Tony stark could build a Jericho missile in such bad shape. Imagine the pain he must have felt.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:30:52.078Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah... honestly I'm not sure how he moved at all", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:32:27.272Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I loved when Tony saved that village ! g", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:33:13.731Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Great part of the movie. You could start to see he wasnt acting as selfish anymore..", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:33:28.216Z"
    }, 
    {
      "docIdx": 2, 
      "text": "And I would have been really mad to find out someone who I trusted (Stane) was secretly and illegally selling my companies products for profit and planning to overthrow me. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:33:35.232Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, I love that the movie goes from him being a somewhat selfish and arrogant billionaire to caring about other people and what happens to them.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:34:42.015Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I would feel so betrayed. Especially that those weapons can kill so many innocent people. Not only that but he wanted his spot as CEO! I would be so angry.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:36:24.272Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, and if he had been CEO I can only imagine what kind of havoc would have been unleashed. I'm kind of glad that he died at the end because I don't think there was any bringing his character back", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:38:33.836Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, when you're at the point of killing so many people for profit I dont think you could come back even if you wanted to.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:39:25.531Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I liked how for once in a superhero movie he actually let everyone know he was actually iron man. Most of the time the hero hides their identity.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:40:01.503Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree although I somewhat wondered if it was a bit of arrogance showing that he wanted people to know it was him ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:41:22.844Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Or if he just wanted to get it out there so no one would wonder", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T15:41:46.348Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You are right. He was one that liked attention and being ironman was probably the best way to get that, and credit for saving everyone. Kinda irritates me in a way. People like that are pretty annoying.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T15:43:08.673Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-27T15:10:18.905Z", 
  "uid1LogOutTime": "2018-03-27T15:43:18.731Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-27T15:10:18.987Z", 
  "uid2LogOutTime": "2018-03-27T15:43:29.186Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2963", 
  "user2_id": "USR3681", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 21
}