{
  "date": "2018-02-12T19:31:19.442Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:31:34.615Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you seen Wonder Woman?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:32:50.705Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hi! I was reading about the movie Wonder Woman! Saw the Rotten Tomatoes score. It's very rare a movie receives a score that high (92%)!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:33:22.315Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think rotten tomatoes can be a bit biased with triple-A movies personally, however, I think it got a fair score. What did you think of the movie from 1 to 10?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:34:25.299Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely a 9! What about you? I never knew she was an Amazon Warrior!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:35:33.066Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree with most of the critics with a 7 score. I think the movie was great, but I don't think it was immaculate. How do you think Gal Gadot did as Wonder Woman?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:36:48.411Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought she did a great job. Loved Chris Pine as well (and I'm honestly not a big fan of his either). Patty Jenkins did a great job directing it!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:38:36.363Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I didn't think Gadot would be able to pull off the role, but I was surprisingly wrong. I am not a fan of Pine either. As for the director she made a good impression considering I've never heard of her.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:40:22.282Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think the story setting was done properly, not too much deviation from the comic books which I liked a lot. What did you think of the story?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:41:10.604Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Same here. I hadn't heard of her either. I liked ththe story. I honestly wasn't familiar with the comic but never would have guessed her backstory took place during a World War. What did you think of it - story wise!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:43:07.737Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought it was properly done, and I would have rathered Wonder Woman be introduced in this movie instead of Batman VS Superman. I felt her character just took away from the movie, but in this one, I had no complaints.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:45:08.630Z"
    }, 
    {
      "docIdx": 0, 
      "text": "How did you like the action scenes?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:45:47.726Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Agreed! I enjoyed them for the most part. The scene where Steve crashes onto the island shore was well done. How about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:47:33.645Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I liked all the action scenes. They reminded me of Christoper Nolan's Batman action scenes. They were gritty, properly shot, etc. Since you've never read the comics, how did you perceive the origins of Diana? Being born of clay and living on an island of warrior women?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:50:01.429Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So true! It was very informative and I learned a lot about the character that I didn't know previously. I also loved how they incorporated Ares and Zues into the story. Had no idea it dealt with gods. Did you know that beforehand?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:53:49.887Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I knew the mythology behind the story, but really didn't pay attention to it in the movie. I was more absorbed in the story of the war. I always thought the idea of a \"hidden\" island out in the middle of nowhere was silly because eventually lots of people will find it. In addition to the gods being present just didn't seem right. I mean if I was a soldier in a war and see two gods fighting next to me I'm not gonna really be fighting anyone.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:57:14.692Z"
    }, 
    {
      "docIdx": 1, 
      "text": "How believable did you find the story or did you just ignore the impossible parts? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:57:59.411Z"
    }, 
    {
      "docIdx": 1, 
      "text": "For most comic book films, I try to suspend disbelief so in terms of believability, I suppose for that realm it was believable enough. I do agree with your views. If I was a soldier surrounded by two gods, I wouldn't be fighting anyone either. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:01:17.524Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Also, the who was being \"orchestrated\" by Ares was a bit of a stretch. I think they would of been better off leaving the real reason the war happened in.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:02:43.110Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What did you think of the supporting cast?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:03:13.977Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I was a fan of Robin Wright beforehand  (or used to be) and thought her portrayal of Antiope was great. Wasn't familiar with Danny Huston but loved his performance. What about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:05:19.578Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think everyone did a good job overall. None of the actors seemed overbearing if that makes sense.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:06:15.745Z"
    }, 
    {
      "docIdx": 2, 
      "text": "What did you think of the villain Isabel Maru? I feel she was a bit forced, but the character was interesting enough to not be annoying.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:07:43.487Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree. How did you like Isabel Maru?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:07:54.376Z"
    }, 
    {
      "docIdx": 2, 
      "text": "She ok, but not really memorable compared to everyone else.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:08:28.673Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Now that I think about it, this conflict was over mustard gas which is a bit comical. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:09:19.540Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I thought she was unique in terms of the character but that's about it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:09:47.946Z"
    }, 
    {
      "docIdx": 2, 
      "text": "What did you think of General Erich?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:10:13.947Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Erich was good, he was believable in terms of a villain and wasn't over the top which is really important in my opinion.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:10:58.972Z"
    }, 
    {
      "docIdx": 3, 
      "text": "True. I loved the twist: Sir Patrick ended up being Ares. That was my favorite part in the film. What about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:12:37.156Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I liked the beginning of the movie, to be honest, keeping true to wonder woman's backstory. I like movies that don't deviate from the real origins of the super hero\n.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:13:59.919Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What did you think about Steve's sacrafice?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:14:15.967Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was sad but needed to be done in order to get rid of the poison gas. I loved how he made her realize humans do have good within.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:16:12.977Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm glad Bruce Wayne was referenced in the film.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:16:50.706Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah\n, now that you mention it. I guess his death was needed to further the story. I think he could of just flown the thing over the ocean and crashed it but oh well.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:17:35.807Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, all the superhero movies like to give a nod to each other it's pretty cool.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:18:08.868Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Whelp, we made it stranger! Have a good day!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:18:33.818Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I suppose that would have been the more rational thing to do.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:18:38.986Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And same to you! I enjoyed it!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:18:54.190Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Movies are never rational unfortunately", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:18:54.938Z"
    }, 
    {
      "docIdx": 3, 
      "text": "lol have a good one.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T20:19:07.481Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Truer words have never been spoken! Have a great day!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T20:19:24.955Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-12T19:31:19.442Z", 
  "uid1LogOutTime": "2018-02-12T20:19:16.641Z", 
  "uid1response": {
    "feedback": "Thanks for having me participate.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-12T19:31:19.704Z", 
  "uid2LogOutTime": "2018-02-12T20:19:30.344Z", 
  "uid2response": {
    "feedback": "Everything went well and I enjoyed the chat and my partner!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3319", 
  "user2_id": "USR3781", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 8
}