{
  "date": "2018-03-16T17:02:25.796Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hi", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:02:43.441Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Batman begins", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:02:47.390Z"
    }, 
    {
      "docIdx": 0, 
      "text": "i really liked that movie", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:02:56.126Z"
    }, 
    {
      "docIdx": 0, 
      "text": "You should watch it again it has 1. Rotten Tomatoes: 84% and average: 7.7/10", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:03:09.194Z"
    }, 
    {
      "docIdx": 0, 
      "text": "that is a really good rating, i would not mind seeing it", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:03:33.016Z"
    }, 
    {
      "docIdx": 0, 
      "text": "and 2. Metacritic Score: 70/100", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:03:48.713Z"
    }, 
    {
      "docIdx": 0, 
      "text": "a little bit lower but still good", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:03:59.017Z"
    }, 
    {
      "docIdx": 0, 
      "text": "and this website even gave it a letter 3. CinemaScore: A", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:04:20.838Z"
    }, 
    {
      "docIdx": 0, 
      "text": "now that is great, who is in it", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:04:50.053Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You got the Neesons", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:05:07.806Z"
    }, 
    {
      "docIdx": 1, 
      "text": "oh i like that guy", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:05:22.794Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The Gary Oldman's", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:05:33.819Z"
    }, 
    {
      "docIdx": 1, 
      "text": "dont think i know who that us", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:05:50.523Z"
    }, 
    {
      "docIdx": 1, 
      "text": "*is", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:05:54.068Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Babe Katie Holmes, probably the last movie she was ever in before Tom Cruise captured her", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:06:09.150Z"
    }, 
    {
      "docIdx": 1, 
      "text": "ahh, she was pretty hot. thanks tom", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:06:31.886Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The Bale of Christians", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:07:04.698Z"
    }, 
    {
      "docIdx": 2, 
      "text": "ooo he is a real good one", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:07:32.053Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The first key scene in this movie is  \nAs a child, Bruce Wayne falls down into a dry well and is attacked by a swarm of bats,\nsubsequently developing a phobia of the creatures. While watching an opera with his\nparents, Thomas and Martha, Bruce becomes frightened by performers masquerading as\nbats and asks to leave. Outside, mugger Joe Chill murders Bruce's parents in front of him.\nOrphaned, Bruce is raised by the family butler, Alfred Pennyworth.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:07:53.715Z"
    }, 
    {
      "docIdx": 2, 
      "text": "oh no how sad", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:08:09.931Z"
    }, 
    {
      "docIdx": 2, 
      "text": "breaks my heart", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:08:15.994Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The second key scene is Fourteen years later, Chill is freed in exchange for testifying against Gotham City mafia\nboss Carmine Falcone. Bruce intends to murder Chill, but one of Falcone's assassins does\nso first. Bruce's childhood friend, assistant district attorney Rachel Dawes, berates hi\nm for\nattempting to undermine the justice system, saying that his father would be ashamed. Bruce\nconfronts Falcone, who tells him that real power comes from being feared. Bruce decides to\ntravel the world and learn how to confront injustice. While serving a prison sentence for theft\nin Bhutan, he meets Henri Ducard, who trains him as a member of the League of Shadows,\nled by Ra's al Ghul. After completing his training and purging his fears, Bruce learns that the\nLeague intends to destroy Gotham, believing it to be corrupt, decadent, hypocritical and\nbeyond saving. Bruce rejects the League's cause and burns down their temple during his\nescape. Ra's is killed by falling debris, while Bruce saves the unconscious Ducard.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:08:28.688Z"
    }, 
    {
      "docIdx": 2, 
      "text": "oh wow sounds interesting i think you have me sold", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:08:53.772Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Did I mention it has Michael Caine?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:09:57.468Z"
    }, 
    {
      "docIdx": 3, 
      "text": "no you did not, now im all for it", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:10:14.786Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Key scene #3 is Batman intercepts a drug shipment, provides Rachel with evidence against Falcone, and\nenlists Sergeant James Gordon, one of the few honest cops left in Gotham, to arrest him. In\nprison, Falcone meets with Dr. Jonathan Crane, a corrupt psychiatrist whom he has helped\nsmuggle drugs into Gotham, and threatens to reveal his complicity if he does not declare\n\nhim mentally unfit for trial. Crane puts on a scarecrow mask and sprays Falcone with a fear-\ninducing hallucinogen that drives him insane (which causes Falcone to constantly mouth the\n\nword \"Scarecrow\"), and has him transferred to Arkham Asylum. While investigating \"the\nScarecrow\", Batman is exposed to the hallucinogen and left incapacitated. He is saved by\nAlfred and given an antidote developed by Fox. When Rachel accuses Crane of corruption,\nCrane reveals that he has been pouring his fear-inducing drug into Gotham's water supply.\nHe drugs Rachel with it, but Batman saves her and subdues Crane, who claims to work for\nRa's al Ghul. Batman evades the police to get Rachel to safety, administers the antidote,\nand gives her a vial of it for Gordon and another for mass production. Ducard reappears at\nBruce's birthday party and reveals himself to be the true Ra's al Ghul. Having stolen a\npowerful microwave emitter from Wayne Enterprises, he plans to vaporize Gotham's water\nsupply, rendering Crane's drug airborne and causing mass hysteria that will destroy the city.\nHe sets Wayne Manor aflame and leaves Bruce to die, but Alfred rescues him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:10:39.395Z"
    }, 
    {
      "docIdx": 3, 
      "text": "very descriptive, i like how this movie sounds", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:11:06.940Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Scene 4 is when Katie Holmes is captured and replaced with an evil imposter Maggie Gyllenhaal", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:11:47.269Z"
    }, 
    {
      "docIdx": 3, 
      "text": "i hate how that sounds. maggie is ew", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:12:05.697Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Its critical responses include \"being both comic-book archetypes and real people\"\n● \"comfortably mix the tormented drama and revenge motifs with light hearted gags and\ncomic book allusions,\"s who sign up to make them, have no evident motive beyond their\nown aggrandizement.\"\n● \"hype about exploring Batman's damaged psyche\"\n● \"both the menace and the wit he showed in his brilliant turn in American Psycho\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T17:12:46.976Z"
    }, 
    {
      "docIdx": 3, 
      "text": "thanks for the info", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T17:13:02.178Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-16T17:02:25.796Z", 
  "uid1LogOutTime": "2018-03-16T17:12:54.437Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-16T17:02:25.853Z", 
  "uid2LogOutTime": "2018-03-16T17:13:03.925Z", 
  "uid2response": {
    "feedback": "The other user was very helpful and persuading.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4744", 
  "user2_id": "USR4560", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 14
}