{
  "date": "2018-02-13T20:24:53.630Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Do you like Steven Speilberg's older films?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:26:09.355Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes! He's excellent at telling a story on screen. He's an awesome director. Did you find iJaws\n scary?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:28:47.847Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did when I saw it when I was younger. Even though you couldn't see the shark it made me terrified for the characters all the same.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:29:57.400Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, it's amazing how they were able to make some of the parts without the shark just as scary as the parts with the shark! It shows how awesome a director Spielberg is! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:32:00.074Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Totally true. Casting Roy Schneider and Robert Shaw was a good move, too. They were perfect for their roles!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:33:41.324Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely! The scenery was perfect too! I don't think I'll be traveling to New England beaches anytime soon!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:34:51.005Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Especially fictional ones! All kidding aside, I didn't know who wrote the book. I haven't otherwise heard of Peter Benchley but I think it's interesting he wrote the book in 1974 and the movie was released a year later. Steven Spielberg works fast.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:37:14.771Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I didn't realize it was based on a book. I wonder if the book is as well liked as the movie. People seem to rate the movie pretty highly. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:38:59.773Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, both critics and audiences said it was very entertaining. Everyone seems to like the movie for what it is, a scare machine and a thriller. How do you think Steven Speilberg compares to other American filmmakers?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:41:00.379Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think he's very good at manipulating an audiences' feelings in a way that benefits his movies. For example, I wasn't too upset when the shark attacked the victims.\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:44:31.804Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree, but I do like how the victims caused enough fear in the Police Chief to close the beaches and enough fear in the Mayor that the town would lose money from a lack of tourists to re-open them. I feel like Spielberg handled the plot very well.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:47:20.704Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree. I thought it was interesting how quickly the coroner changed the cause of death for Chrissie. Although, I guess if he hadn't, there would have been much of a movie. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:50:37.537Z"
    }, 
    {
      "docIdx": 1, 
      "text": "*wouldn't", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:50:55.498Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It sets the stage to make the frenzy over the bounty more believable, as does the opinion of the expert consulting oceanographer over the shark attack. That's how Speilberg moved the plot forward.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:55:49.239Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think it's an interesting addition to the plot that there's a bounty for the shark. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:58:06.624Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes the bounty raises the stakes and the excitement is shown by all the amateurs coming out to try to kill the shark.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:00:04.639Z"
    }, 
    {
      "docIdx": 2, 
      "text": "How did you feel when when the tiger shark was caught and the mayor proclaimed the beach safe?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:01:42.441Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The Mayor only concealed the danger by doing that. People got hurt because he wouldn't take the threat seriously. The Police Chief's son went into shock after another shark attack.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:05:34.846Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I thought it was terrifying when the shark's tooth was found in the submerged haul. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:07:17.981Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think that's when they realized what they were dealing with. Did you like Robert Shaw as Quint?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:08:51.448Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, what did you think of Roy Schneider as Chief Brody? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:11:21.539Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He was convincing. I liked the part where he gets Vaughn to hire Quint.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:12:24.973Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's exciting when Quint, Brody, and Hooper go out to hunt the shark! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:13:20.984Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, especially when it appears out of nowhere behind the boat!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:13:50.621Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think it's clever that the boat was named \"the orca\". ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:15:31.849Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I just picked up on that! It suggests the shark can take down anything.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:16:49.542Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah, including a shark-proof cage! I guess it wasn't so shark proof after all.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:17:37.692Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It absolutely devoured Quint. The best part of the movie, though, was when Brody stuffed a pressurized tank into the shark's mouth and shot it, blowing up the shark.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:19:14.748Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm so glad the explosion kills the shark!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:19:43.426Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-13T20:24:53.630Z", 
  "uid1LogOutTime": "2018-02-13T21:19:54.288Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T20:24:54.232Z", 
  "uid2LogOutTime": "2018-02-13T21:19:22.305Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2404", 
  "user2_id": "USR4227", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 2
}