{
  "date": "2018-03-07T15:53:23.593Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "I didn't know this was a Spielberg film.  I've seen it probably 10 times and had no idea.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T15:54:04.806Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah. I guess that's why the first response says 'not a major Spielberg film'. Must not have been marketed that way.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T15:55:08.028Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It doesn't seem like it's over 2 hours either.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T15:56:04.796Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah. What do you think about the ratings it got? You agree with them?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T15:56:53.007Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes. The metacritic score is lowish compared to the other, but I think I get it.  It was such an entertaining movie, but not really a meaningful one and it seems like that's how movies are rated.  They need to make the critics FEEL something\n.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T15:58:47.034Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Agreed. It's cool to me that it was released 16 years ago though. If I didn't know that and if I didn't know about the actors I could easily see it coming out right now.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:00:17.723Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh yeah, that is interesting.  I don't think I realized Amy Adams was in it.  I probably just didn't recognize her because she wasn't famous then.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:02:35.611Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, I was honestly thinking the same thing. There are actually a bunch of films she's in that I didn't realize she was in until much later. Loved the Walken character. Really memorable given how little he was actually on screen.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:03:58.368Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Also I think this was the first DiCaprio movie I really thought he acted super well in. I mean the others are good too but this to me was the start of him being as good as he is now.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:05:37.931Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Totally agree about Walken.  He's great in this.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:05:43.688Z"
    }, 
    {
      "docIdx": 1, 
      "text": "oh I've been a big Leo fan for a while.  I truly thought he was mentally disabled in What's Eating Gilbert Grape.  He's super versatile, he just seems to get a lot of the same brash characters.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:06:36.421Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The fact that movie is based on a real person is so crazy to me.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:07:18.002Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I liked the scene it's talking about, where he poses as the teacher. He did that well. He was convincing but you could tell it was his first con and he wasn't as polished as later on.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:07:33.647Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Can you imagine having that much nerve?  Especially as a teenager.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:07:41.792Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh yeah. Nowadays he'd probably be in prison\n 5 min into his pilot con efforts", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:08:41.401Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He'd probably be in the airport back room for quite a while nowadays.  Really sad how different airports are now compared to this movie.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:10:41.206Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well, he was pretty lucky in the end. Lived that pretty awesome life and ultimately just got a nice government job haha", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:11:53.741Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Ugh, I forgot about when he finds out his dad died.  I hated that part so much.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:12:40.520Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah. I haven't had the experience yet but it really reminded me about seeing how some of my friends reacted", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:13:27.231Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Too bad we can't all get a Tom Hanks as a replacement dad.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:16:40.679Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I bet the mom wasn't too please with how they portrayed her in the film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:18:04.441Z"
    }, 
    {
      "docIdx": 2, 
      "text": "If only...", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:18:40.352Z"
    }, 
    {
      "docIdx": 2, 
      "text": "ah yeah. I wonder if she was alive when it came out", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:18:45.233Z"
    }, 
    {
      "docIdx": 2, 
      "text": "if I remember right he was born in like 1950? so his mom would've been at least 70 when this came out", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:19:17.913Z"
    }, 
    {
      "docIdx": 2, 
      "text": "but yeah, not a flattering portrayal haha", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:19:26.257Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Something like that.  Hopefully she never saw it.  It'd be pretty awkward facing the neighbors after that sort of thing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:20:22.935Z"
    }, 
    {
      "docIdx": 3, 
      "text": "not sure if it's 100% true but it's crazy how apparently he's making millions a year still", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:21:16.868Z"
    }, 
    {
      "docIdx": 3, 
      "text": "seems like one of the situations where crime pays extremely well", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:21:32.764Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Right?  It's funny how the whole film is basically about him being a thief and liar, yet he's so likable and you're even rooting for him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:23:37.862Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah. well it may just be me, but I don't think a person like him being imprisoned for 12 years like they wanted is at all right for a person who basically just stole money, no matter how much it was", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:25:09.289Z"
    }, 
    {
      "docIdx": 3, 
      "text": "so I'm glad that never happened at least but I am kinda surprised", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:26:14.309Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree.  I don't think money or stuff is more important than a life.  People like that need help they won't get in prisons.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:26:21.406Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I mean you'd think the FBI would have access to enough law abiding people in the world that they wouldn't need him to help them catch thieves haha", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:26:48.651Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They were basically just admitting that he's smarter than them.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:27:14.022Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah definitely. always amazes me when people can get away with this kinda stuff for so, so long", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:29:46.290Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I know it's a true story but I'm definitely gonna look up the details to see how much of it was exaggerated", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T16:30:34.841Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm going to look it up too!  I think this is why I like this movie so much, because it actually happened.  Kind of.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T16:31:30.281Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-07T15:53:23.593Z", 
  "uid1LogOutTime": "2018-03-07T16:31:34.822Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      -1
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-07T15:53:23.844Z", 
  "uid2LogOutTime": "2018-03-07T16:32:33.313Z", 
  "uid2response": {
    "feedback": "Talking with the person was actually a bit interesting. Thanks!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR490", 
  "user2_id": "USR3260", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 19
}