{
  "date": "2018-02-07T17:00:01.655Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hi", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T17:03:19.072Z"
    }, 
    {
      "docIdx": 0, 
      "text": "anybody there", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T17:03:21.234Z"
    }, 
    {
      "docIdx": 0, 
      "text": "wonder women movie -director -patty jenkins- 2015 year", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.618Z"
    }, 
    {
      "docIdx": 0, 
      "text": "\nwonder woman is based on the DC comics character of the same name.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.618Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wonder Woman is a 2015\n American superhero film based on the DC Comics character of the same name, distributed by Warner Bros. Pictures. It is the fourth installment in the DC Extended Universe (DCEU). The film is directed by Patty Jenkins, with a screenplay by Allan Heinberg, from a story by Heinberg, Zack Snyder, and Jason Fuchs, and stars Gal Gadot as Diana Prince / Wonder Woman, alongside Chris Pine, Robin Wright, Danny Huston, David Thewlis, Connie Nielsen, and Elena Anaya. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.618Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Development for a live action Wonder Woman feature film began in 1996, with Ivan Reitman attached as producer and possible director", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.677Z"
    }, 
    {
      "docIdx": 0, 
      "text": "In 2015, Patty Jenkins accepted an offer to direct Wonder Woman, based on a screenplay by Allan Heinberg and a story co-written by Heinberg, Zack Snyder, Geoff Johns and Jason Fuchs.[109] Of this version, Gadot stated that,", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.678Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Earning a total of $103.3 million on its opening weekend, the film recorded a number of records: the biggest domestic opening of all time for a female director (surpassing previous record holder Fifty Shades of Grey by Sam Taylor-Johnson), the biggest DC Comics release without Batman or Superman (ahead of Constantine), the sixth-biggest non-sequel comic book superhero debut ever, as well as the sixth-biggest June debut weekend.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.678Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wonder Woman premiered in Shanghai on May 15, 2017, and was released in the United States on June 2, 2017, in 2D, 3D and IMAX 3D. It received largely positive reviews from critics, with praise for its performances (particularly those of Gadot and Pine), direction, action sequences, and musical score.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.678Z"
    }, 
    {
      "docIdx": 0, 
      "text": " A sequel is set to be released on November 1, 2019 with Jenkins and Gadot reprising their roles as director and lead role respectively.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.712Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The team learns a gala will be held at the nearby German High Command. Steve and Diana separately infiltrate the party, with Steve intending to locate the gas and destroy it, while Diana intends to kill Ludendorff, believing that he is Ares and thus killing him will end the war. Steve stops her to avoid jeopardizing his mission, but this allows Ludendorff to unleash the gas on Veld, killing its inhabitants. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.712Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The sister of Hippolyta, General of the Amazonian army, Diana's aunt and mentor.[17] On being cast for the film, Wright said, \"It's two-fold because when Patty Jenkins called me, the director, it was a three-minute long conversation. She said, 'I'm doing a movie about Wonder Woman. Do you want to be her trainer?' And I was like, 'Yes. Of course.' And the general of the Amazonian army. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:05.749Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The Amazon Queen of Themyscira and Diana's mother.[36] On meeting the director for the role, Nielsen said, \"Patty and I met in London, and we just hit it off from the get-go. We couldn't stop talking. What was supposed to be a one-hour meeting turned into a two-and-a-half-hour lunch and we just really got each other.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:19:59.107Z"
    }, 
    {
      "docIdx": 0, 
      "text": "In late 2013, Zack Snyder cast Gal Gadot in the role of Wonder Woman for the 2016 film, Batman v Superman: Dawn of Justice over Élodie Yung and Olga Kurylenko.[116][117][118][119] Some fans initially reacted to this choice by criticizing Gadot's appearance.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:20:32.798Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Director Patty Jenkins[115] in response to the interview questions: \"Let's talk a bit about Gal. You inherited her from Zack Snyder. Was it difficult to not get to choose your own Wonder Woman?\" and \"What is it about Gal that makes her such a good fit?\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:21:48.636Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wonder Woman has been the subject of a discussion regarding the appearance and representation of female power in general, and of female action heroes in particular.since her initial 1941 appearance in Sensation Comics, as she was created to document \"the growth in the power of women\", while wearing \"a golden tiara, a red bustier, blue underpants and knee-high, red leather boots.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:22:56.913Z"
    }, 
    {
      "docIdx": 0, 
      "text": "finish", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:24:06.282Z"
    }, 
    {
      "docIdx": 0, 
      "text": ". Do you agree with the rating of the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:24:27.313Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The petition stated that \"it is alarming that the United Nations would consider using a character with an overtly sexualised image at a time when the headline news in United States and the world is the objectification of women and girls\".[243][244][240] Wonder Woman director Patty Jenkins responded to both the petition and to the U.N.'s decision by stating that she thinks \"that that's sexist. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:27:18.956Z"
    }, 
    {
      "docIdx": 0, 
      "text": "stop", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T17:38:43.385Z"
    }, 
    {
      "docIdx": 0, 
      "text": "sorry", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T17:42:52.176Z"
    }, 
    {
      "docIdx": 0, 
      "text": "for the late", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T17:42:54.623Z"
    }, 
    {
      "docIdx": 0, 
      "text": "good bye", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T17:43:15.901Z"
    }
  ], 
  "rating": 1, 
  "status": 0, 
  "uid1LogInTime": "2018-02-07T17:00:01.655Z", 
  "uid1LogOutTime": "2018-02-07T17:43:18.736Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-07T17:19:05.617Z", 
  "uid2LogOutTime": "2018-02-07T17:40:03.804Z", 
  "uid2response": {
    "response": [], 
    "type": "abandonWithoutAnsweringFeedbackQuestions"
  }, 
  "user1_id": "USR213", 
  "user2_id": "USR875", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 8
}