{
  "date": "2018-02-20T17:07:53.750Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "What did you think of the acting?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:09:37.661Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Absolutely blasphemous. Jim Carrey is a fool.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:10:02.684Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Which is what made it so hilarious at times. Who doesn't love watching a good trainwreck of a movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:10:42.394Z"
    }, 
    {
      "docIdx": 0, 
      "text": "He tends to play silly roles but I think he is a good choice for them. He's very expressive, more so than other actors.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:11:01.240Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you agree with the Rotten Tomatoes rating? 48% is pretty low.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:11:23.105Z"
    }, 
    {
      "docIdx": 0, 
      "text": "On their scale, yeah. Same with the average IMDb rating. I'd consider it about on par with movies of a similar score on each website.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:12:19.842Z"
    }, 
    {
      "docIdx": 0, 
      "text": "How old were you when it came out?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:13:01.143Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I personally would give it a Fresh but I'm no trained critic. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:13:22.441Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I was like 14 when I first saw it but I just watched it again recently and got a lot more of the jokes.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:14:00.729Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think Morgan Freeman did a excellent job and was a good casting. However I can't say the same for some of the other actors.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:15:30.634Z"
    }, 
    {
      "docIdx": 1, 
      "text": "lol I remember seeing it on TV a few years back. The only distinct parts I remember are\n that Morgan Freeman was awkward as all hell and Jim Carrey just did his Jim Carrey thing, acting like a caricature of a character that was already outlandish.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:16:24.433Z"
    }, 
    {
      "docIdx": 1, 
      "text": "and then they had a sequel, right?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:17:00.771Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Evan Almighty", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:17:05.089Z"
    }, 
    {
      "docIdx": 1, 
      "text": "or was it Kevin", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:17:11.476Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm not sure. That's possible but I don't think I ever saw it. Was there any specific scenes that made you dislike the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:18:52.017Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Like I said, I can't remember much at all. I remember a few bits with Jennifer Aniston that stuck in my head just because she's hot, but I mostly just remember being bored. To me, there are movies that I can't enjoy without unless I nitpick at all their flaws.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:21:22.363Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Regardless of anyone's opinion though, it was definitely a success. It's hard to believe it's been 15 years since it was released.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:22:06.538Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh, do you generally not watch \"badly\" rated movies? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:22:17.496Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The fact that it's memorable enough to still be popular today is impressive. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:23:32.255Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm more of a literature person. I like movies that have artistic goals more in line with that of a serious writer, not of someone paid to churn out scripts.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:23:33.421Z"
    }, 
    {
      "docIdx": 2, 
      "text": "In other words, I'm pretentious ya know", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:24:14.237Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Lol, I can understand that. You have to admit the email system for prayers was pretty clever?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:24:50.744Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Way to bring a modern twist into the story.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:25:16.436Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Perhaps it had deeper motives of showing how technology brings us closer every day to things that people once thought only possible by God", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:26:03.455Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I never thought of it that way, interesting. The auto-\"yes\" program he ends up using also reflects the view that people will be happy if they get what they want. He thinks he's doing good but does not think about the consequences.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:29:03.602Z"
    }, 
    {
      "docIdx": 3, 
      "text": "hah yes, that is clever. Maybe it warrants a rewatch.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:30:55.678Z"
    }, 
    {
      "docIdx": 3, 
      "text": "here I am talking about the movie with only my vague memory of it... I didn't even notice the whole synopsis in the document", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:33:13.705Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think the whole thing trivializes religion a bit too much", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:34:30.326Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The reveal that Bruce is the man that would make Grace happy is a nice ending. I didn't like the sub-plot with him being flirty with his co-worker. As wholesome as the ending is, the movie was a big raunchy especially for a movie that has religion in it. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:35:00.095Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you think the lack of respect for God made people give it a lower rating?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:35:22.681Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Definitely. My parents, who are devout protestants, trash-talked this movie when they first heard of it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:36:19.074Z"
    }, 
    {
      "docIdx": 3, 
      "text": "but my problem with it is that Christianity already suffers from so much dilution of doctrine that  trivialization in pop culture only serves to make people more comfortable with the modern state of Christianity, a shell of what it used to be.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:38:33.164Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I can see how that could turn some people away. The homeless man being God is a good message though. Reminiscent of Jesus, who cared for the poor. Really mixed messages though. It tries to be both a comedy and a \"deep\" movie. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T17:39:03.703Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah, it regurgitates some themes from the Bible in a modern movie, and they knew that alone would make money. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:41:18.064Z"
    }, 
    {
      "docIdx": 3, 
      "text": "phew, talking about religion makes me sweat. let's finish this one.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T17:42:11.590Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-20T17:07:53.750Z", 
  "uid1LogOutTime": "2018-02-20T17:42:16.632Z", 
  "uid1response": {
    "feedback": "The other person sometimes went off track", 
    "response": [
      1, 
      2, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-20T17:07:53.751Z", 
  "uid2LogOutTime": "2018-02-20T17:42:14.341Z", 
  "uid2response": {
    "feedback": "Bad movie.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1670", 
  "user2_id": "USR340", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 15
}