{
  "date": "2018-03-26T17:15:18.197Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi there!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:15:44.345Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you seen The Wolf of Wall Street?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:15:53.696Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oooh, oooh, oooh, I love me some Leonardo DiCaprio!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:16:03.817Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I know!  He's the best.  He was great as Jordan Belfort.  I also loved Jonah Hill.  What a different role for him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:16:39.521Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I've also seen every movie that has ever has Matthew McConaughey, in it, for r\neasons.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:17:48.662Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm surprised he wasn't a main character in this movie!  I guess Martin Scorsese didn't want him to be that involved.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:18:48.626Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Maybe he had personal problems with the writer, Terence Winter?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:20:45.550Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm surprised that the movie only received basically an average of a C rating.  I remember reading one review saying the characters seemed dull.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:22:11.084Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, It doesn't seem to have that great of a Rating, only a 78% on Rotten Tomatoes. However, I'll be damned If I wasn't Ogling over Leonardo DiCaprio, and his Exhilarating Performance.\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:25:51.753Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I guess it helped that Leo was also a producer on the movie.  I thought him and Margot Robbie worked well together.  Their relationship was definitely dynamic.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:26:53.278Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Maybe I'm just a big fan of Rampant Corruption and Fraud. Kind of like the firm Stratton Oakmont. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:28:42.659Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I had never known about penny stocks before this movie.  There was the scene where he joins that Long Island firm that dealt with those.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:30:44.144Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, it was all new information to me as well\n. It was kind of hard to see the line where Leo went from being a really good Penny Stock Salesman, to a fraudster. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:31:54.632Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah just crazy how they got into sex and drugs and the crazy lifestyle.    I hadn't heard of Black Monday either.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:33:19.129Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, still a little uncertain on that one haha. I will say this though, He deserved better than his previous career. However I just wish he hadn't done all those bad things. But I guess that's why its a movie right", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:35:02.947Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's just crazy that he had a business partner and a wife and was still leading this whole crazy career.  It was also kind of crazy to imagine that this all started in 1987.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:36:31.787Z"
    }, 
    {
      "docIdx": 2, 
      "text": "All in Long Island too! Seems like New York is the place to be!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:38:19.550Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I just thought it was crazy that he met Naomi while married...has an affair, gets divorce and then marries Naomi.  She sure was getting into a crazy situation.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:39:26.301Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah and then he befriends his Crazy Neighbor, played by that Crazy Jonah Hill. And those Crazy Bastards start a firm together! Now if you want to talk about a Crazy Dynamic, then the chemistry between Jordan and Donnie is where I would point you.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:41:44.381Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can't believe Naomi let him open a swiss bank account in her mom's name to hide money.  But he was good at tricking people and fraud.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:45:33.159Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah that was crazy, but that did help keep the money out of the American Government's reach. So I suppose it was a good plan.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:47:18.664Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well making 22 million in three hours is what tipped off his craziness to the FBI.  He should have been smarter and they would have never started looking into him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:48:24.185Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah but it is hard to turn down an opportunity to play with Steve Madden's IPO.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:49:11.130Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I know you like Leo a lot, but I was done with his character when he tried to run off with his daughter in the car.  Thank heavens, he crashed and she wasn't heard.  I was happy that Naomi was leaving him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:50:09.530Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think Naomi knew what she was getting into when she married him. I felt her leaving him was a betrayal. The first divorce I understood, because Leo's character basically did a 180 degree turn. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:52:52.585Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Maybe you're right.  I was happy that Donnie finally got some guts and turned in Jordan.  I know Jordan was trying to help him out but he walked all over Donnie the whole movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T17:54:00.060Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't know, that still doesn't sit right with me. Jordan risked everything to give Donnie a head's up. Only to have Donnie stab him in the back. I can understand Donnie's betrayal, if there was no redemption by Jordan, but that simply wasn't the case. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T17:55:39.646Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well he was still lucky to only serve three years.  And then he got to teach his sales technique!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T18:00:37.031Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, that was cool. It seemed kind of fitting that he ended up hosting seminars.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T18:01:14.151Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-26T17:15:18.197Z", 
  "uid1LogOutTime": "2018-03-26T18:01:34.879Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-26T17:15:18.268Z", 
  "uid2LogOutTime": "2018-03-26T18:01:16.631Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR592", 
  "user2_id": "USR3480", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 28
}