{
  "date": "2018-02-21T02:52:31.192Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hello, this movie was just o\nk, i thought. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T02:53:22.972Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think this movie looks really interesting - I love Spielberg movies", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T02:54:14.382Z"
    }, 
    {
      "docIdx": 0, 
      "text": "well, of all the spielberg movies, this one probably ranks low in my book, if you ask me. but theni'm not too big on biographies", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T02:54:47.393Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I would agree, I think this is probably low in terms of the quality of a Spielberg movies, but I really like history a lot so I would probably watch this.  But I probably wouldn't watch it in the theatre, I would cross my fingers and hope it's on Netflix", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T02:55:44.076Z"
    }, 
    {
      "docIdx": 0, 
      "text": "it should be on netflix now. are you from the US? it's been out for over 16 years", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T02:56:18.212Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah I am.  I am surprised this got such good ratings for a film that seems like it's not one of Spielberg's best", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T02:58:17.556Z"
    }, 
    {
      "docIdx": 0, 
      "text": "it's an interesting life of a fraud who turned FBI informant of a sort. but still i think it could've been made much better. i didn't like dicaprio in the movie it wasn't believable", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T02:59:14.768Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ha!  I don't like him either, he is not a draw to get me to see a movie.  I'm not a huge fan of his", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T02:59:58.304Z"
    }, 
    {
      "docIdx": 0, 
      "text": "i think he's so overrated.tom hanks was great in it ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:00:21.689Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do love Tom Hanks - I will see anything that he is in.  I think DiCaprio is overrated too.  But Christopher Walken is good, and Amy Adams is good, this was made before she really got popular", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:01:35.029Z"
    }, 
    {
      "docIdx": 1, 
      "text": "the thing is that abagnale could've actually become a lawyer on his own. as far as ai recall he actually passed the bar, i think ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:02:06.575Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's interesting he did most of his cons before he was 19.  You have to wonder if anyone would be able to get away with that today.  Although if he pulled all that off when he was a teenager he must have been really intelligent.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:03:21.982Z"
    }, 
    {
      "docIdx": 1, 
      "text": "most of his con from early days were check fraud. but posing as prosecutor should've taken some serious work. he actually studied law on his own. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:04:01.245Z"
    }, 
    {
      "docIdx": 1, 
      "text": "And I wonder how he learned to fly a Pan Am plane - that takes some real skill", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:06:28.484Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm not sure how you fake that", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:06:33.022Z"
    }, 
    {
      "docIdx": 2, 
      "text": "no idea. he actually flew a lot of miles.. i think he's just naturally smart person, which is why spielberg decide to make a mo\nvie about it because it's so unbelievable. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:07:22.262Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He started early - he posed as a substitute French teacher.  Sounds like he had a rough childhood - I think that is pretty typical for stories like this.  He probably started just out of a genuine desire to help his family", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:09:35.716Z"
    }, 
    {
      "docIdx": 2, 
      "text": "i like the scene where he was given reduced sentence for cooperation. the start of new life for him. even then he still misses the thrill and tries to be the pilot and gets caught by tom hanks. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:10:03.697Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah I like that he got a fresh start and eventually became an asset to law enforcement.  I guess if you want to catch the best you have to have the best on your team.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:12:02.655Z"
    }, 
    {
      "docIdx": 2, 
      "text": "yep. and the trust tom hanks puts on dicaprio is really well portrayed in the movie it really com\nes through and you can feel tom hanks' emotion as he waits for dicaprio to show up for work. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:13:07.610Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Tom Hanks is such a great actor, he is so great at portraying emotion.  I wonder how long that guy worked for the FBI?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:14:19.722Z"
    }, 
    {
      "docIdx": 3, 
      "text": "the real frank abagnale? he still does as far as I recall. he has a company that helps bank detect fraud etc. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:15:02.703Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What a happy ending this story has.  I'm glad he was able to put his skills to good use", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:15:51.529Z"
    }, 
    {
      "docIdx": 3, 
      "text": "there is an ending scene where it tells how frank make millions from bank helping them make checks that are not forgeable. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:16:11.546Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah that's impressive that he was able to do that and make money from it.  And he and Carl stayed friends throughout their lives.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:18:38.518Z"
    }, 
    {
      "docIdx": 3, 
      "text": "probably. he works with the fbi even to this date. he teaches i think. i wonder what he tells his sons about his crimes", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:19:16.804Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Ha, I wonder how he brought that up to his wife!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:19:52.692Z"
    }, 
    {
      "docIdx": 3, 
      "text": "well, maybe he met her after he already made millions legally. i don't know if he did. but end scene just mentions about his family without too much details. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:20:36.897Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm glad he got a happy ending.  It sounds like he was never a bad guy, he just maybe wanted to help his family and that life was just what he got used to, and it worked for him", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:23:14.203Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah there was a scene that shows his life before he ran away as a kid. he started the con to make a living on the street. kinda sad story. but happy ending", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:24:06.843Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, and he got all the money from them making a movie about him lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T03:25:50.740Z"
    }, 
    {
      "docIdx": 3, 
      "text": "i'm sure that's also big chunk of cash. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T03:26:34.602Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-21T02:52:31.192Z", 
  "uid1LogOutTime": "2018-02-21T03:27:18.514Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-21T02:52:31.241Z", 
  "uid2LogOutTime": "2018-02-21T03:27:11.509Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2895", 
  "user2_id": "USR1400", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 19
}