{
  "date": "2018-03-21T17:27:11.717Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Do you like Marvel movies like this one\n?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:29:00.064Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I love Marvel movies. They never cease to amaze me. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:29:28.178Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I haven't seen this movie personally but my son loves it. Have you seen it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:29:53.912Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah I saw it when it was first released, it was a great movie. It felt less serious and much more fun than other superhero movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:31:10.011Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I find it interesting that critics say Terrence Howard's character plays a man who looks dispirited and taken for granted. Normally he plays the tough guy in movies.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:32:56.036Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you believe the fact that he is slightly depressed and taken for granted can be a direct subliminal message as to how our military solider/veterans are normally treated in today's society?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:34:17.366Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah compared to his newer roles this was definitely one of the more unique ones in the sense that he was taken for granted. I think what you're saying about the possible hidden messages behind his character could definitely be true as the film has a lot of characters like that such as Shaun Toub.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:36:17.262Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree with the critics that Gwyneth Paltrow's performance couldn't really be expressed due to her role and the lack of expansion to her character.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:38:40.209Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Exactly, judging from the document, it kind of feels like Shaun's played a very important factor in creating the first Iron man suit, but he is not given recognition as one of the inventors. In fact I think he created the most important part of the sure. Without the electromagnet he created, Start would probably be dead. In this sense I would say that actually makes him the hero in the story.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:39:32.981Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Normally that is how it is with her being a supporting character. There are only a few instances where the love interest in the story get's the attention she deserves.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:41:24.832Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree that especially during the time it was released the CGI was amazing and had a very noticeable attention to detail during the action sequences when it was truly shown off.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:43:37.611Z"
    }, 
    {
      "docIdx": 1, 
      "text": "On another note, I would definitely agree with the critics in regards to it seeming like a military thriller. Normally those types of moves give you a sense of American pride or are extreme tear jerkers. So i can definitely see why there is a feel of depressing and going through the motions.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:44:53.631Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I find it interesting that his character is primarily portrayed as a war hero. Although he is a mythical character, I think the director does a great job with releasing this movie in 2008, shortly after the war ended in Afghanistan in real life. This makes the viewer connect to the story line in more present day realistic struggles/issues. Interesting", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:47:41.432Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I could totally see and agree with the statement it acts as a military thriller in the first half, especially during the key scene where when he is testing a new type of missile from his company in Afghanistan his convoy is ambushed and he is taken captive by a group of terrorists.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:48:00.865Z"
    }, 
    {
      "docIdx": 1, 
      "text": "In your opinion was Robert Downey Jr a great fit to play this role?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:49:08.351Z"
    }, 
    {
      "docIdx": 1, 
      "text": "His performance of a wild and egotistical playboy was very spot on and amazing to watch play out on the screen, out of all the performances he definitely is the most memorable of all of them.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:50:21.766Z"
    }, 
    {
      "docIdx": 1, 
      "text": "His performance made me feel like his character would realistically approach problems with the solutions they actually provided on the screen, and that he reacts to people and events in a way that you'd imagine Tony Stark to react.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:51:29.006Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's interesting. Looking at the ratings. I would definitely go see this movie. Rotten Tomato critics are tough and this movie has a 94% average. Definitely seems to be a must see.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:52:20.516Z"
    }, 
    {
      "docIdx": 2, 
      "text": "While I liked the scene where he eliminates the terrorist threat from Gulmira in memory of Yinsen, I feel like his discovery of Stane's evil plot and him asking Pepper to \"hack\" into their own company'", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:54:54.865Z"
    }, 
    {
      "docIdx": 2, 
      "text": "company's database was a little bit weird considering he is the CEO. I also thought it weird he didn't bother to report it to any authorities and Pepper decided to take action and call SHIELD.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T17:55:35.652Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes Marvel movies normally has a weird way to introduce new information in their scenes. They often contain plot twists and \"wow\" moments which keeps fans entertained. I'm glad he saved the village but I was very surprised to find out about Stane's true identity.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T17:59:41.861Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I don't really understand Stane's motives necessarily either, he is a vice president at one of largest and most powerful weapons defense companies in the world and without a doubt makes large sums of money, but he feels the need to sell arms on the side to terrorists in a third world country? I'm certain that isn't exactly super profitable.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T18:02:03.350Z"
    }, 
    {
      "docIdx": 2, 
      "text": "On the grand scale of movie villains especially Marvel villains, Stane seems rather cheesy and uninspired and I think that's one thing they could have definitely improved on.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T18:03:36.330Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes he as portrayed as evil and motivated by monetary gain. But of course every story has to have an antagonist when we are taking about Marvel. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T18:03:55.111Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree his role could have been developed better. Maybe his character was created to simply capitalize Stark's capability to succeed in those types of situations.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T18:05:08.394Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Another thing I think this scene and the entire movie failed to utilize was the agency of SHIELD, Pepper simply alerts an agent of Stane's evil activities but we don't really see them try to find a solution or stop the activities and let Tony handle it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T18:06:37.896Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm not seeing much information about Pepper, except the fact that she discovered the truth about Stane. I would think there would be like a rescue scene or something with her, or more interest placed on their love connection. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T18:06:59.763Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Great point! I strongly dislike when movies introduce information without resolution. Fans hate leaving with unaswered questions.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T18:07:55.938Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Pepper eventually accompanies a few SHIELD agents to one of the Stark buildings due to her all-access pass, and you could argue when they are eventually taken out and Pepper is left that Stark coming in at that time was her rescue scene.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T18:08:41.280Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think later on in the scene Pepper turns it into less of a rescue scene and more of a duo fighting against Stane when she proves her worth managing to overload the reactor of the building and killing Stane in the process.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T18:09:30.717Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think the scene where Stark defeats Shane would have the audience on the edge of their seats. But i definitely think the producers did a great job making Stark the hero because It's impressive for a hero to still conquer without his  suit at full capacity.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T18:11:23.403Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think they added that part where he isn't at full capacity to show that it's not just the suit doing all the work but the heroic actions and confidence of the person using it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T18:12:20.032Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Great heroism displayed definitely. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T18:13:24.565Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Nice chatting with you. Have a great day :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T18:13:42.883Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-21T17:27:11.717Z", 
  "uid1LogOutTime": "2018-03-21T18:13:45.537Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-21T17:27:11.738Z", 
  "uid2LogOutTime": "2018-03-21T18:14:32.457Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4298", 
  "user2_id": "USR4797", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 21
}