{
  "date": "2018-02-13T18:56:14.002Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Helloo! How are you today?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:56:38.110Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hey, I'm doing pretty well and I hope you are too. We're going to be talking about the movie Jaws. It's a great movie according to the critics and Rotten Tomatoes.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:00:08.363Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Aha! Jaws! That's a classic, no?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:00:42.834Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What do our friends at Rotten To\nmatoes have to say about it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:02:05.024Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Are you still there?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:04:43.622Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Haha yeah, definitely a classic. Apparently it came out in 1975. Rotten Tomatoes voted 97% with an average of 9.2/10. As far as anything specifically that they said, it dpesn't say. One critic however said that it was the most cheerfully pervesre scare movie ever made.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:05:06.348Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wow. That's good. I actually never saw it, I don't even know why, but it never happened. Do you think it's very scary?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:06:26.142Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I haven't either, but I've seen parts. It's anything but scary. I'm only authorized to talk about what's on my document though and I don't think this is it lol According to the critics though, it was also funny and I can attest to that due to the cheesiness.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:08:52.681Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh I see... I wonder if the movie has aged well or not. Is there anyth\ning in what you're reading about the performance of the actors? Are they any good?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:10:02.571Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Nope. Doesn't say. However one review says that the director, Steven Speilberg \"is blessed with a talent that is absurdly absent from most American filmmakers these days. So he at least did really well if none of the actors.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:13:29.928Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What about the story. Is it a good story?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:14:03.870Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Unfortunately I can't copy and paste anything, but it's about a man-eating shark that attacks beachgoers on Amity island, so in my opinion, it's a pretty good plot. Who doesn't like to see people dying in a movie every now and then?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:16:17.139Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Good point. I wonder if there are gory scenes or if the dying happens off screen?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:17:14.307Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Do you know if it's adapted from a novel?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:17:31.371Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Actually, there are gory scenes as one critic was saying that it'd be too much for children to see. There words were \"Jaws is too gruesome for children and likely to turn the stomachs of the impressionable of any age\". It doesn't say if it's adapted to a novel and I don't believe it was anyway. From what I can tell, it's only a movie and I'm unauthorized to say what else has been made because of the movie itself.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:21:03.770Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Hmm... So I don't think I'm going to see it with my nephews as I was thinking of doing. They like slightly scary movies, but I suppose they're way too young for that.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:22:15.520Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Also, I don't want to rush you or anything, but if we keep on with this slow pace my timer is going to die on me before we're done. We're supposed to have 15 exchanges in about 20 minutes. And it's been 20 minutes already...", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:22:41.743Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Their is gore, but it's really cheesy so it shouldn't be that bad for kids in my opinion as well as relating to the document that I'm given\n. And I know what you're saying, but we're supposed to be covering like 4 other articles. I'm not even allowed to be talking about this, but I for one don't have a timer so I assume that it's supposed to change by itself at some point.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:25:27.179Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I mean the timer on the HIT. I don't have that much time left, unfortunately.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:26:37.332Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'll think about it for the kids. I'm not sure they'll understand the cheesiness though. It's more of an adult thing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:27:11.876Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Dang what the crap. I've only spent just 10 minutes. It says that we will have 3 turns of conversation for each document, but nothing has changed. Do you have a \"TASKS\" button? What does it say? Maybe you're in control of when we get a new document or something.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:28:40.092Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The documents are changing. Ask me more questions and I'll be as quick as I can. Apparently we're still talking about the same movie. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:29:49.956Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Normally, the new document just appears after we've had three exchanges about it. It just shows in the same window. I don't have any control on anything. No tasks button.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:29:56.637Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, I think it's always about the same movie. One movie per HIT I think.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:30:26.266Z"
    }, 
    {
      "docIdx": 2, 
      "text": "So, is Jaws fast paced?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:30:51.505Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Alright, well somebody goes skinny dipping in the ocean and is violently pulled underwater.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:31:42.905Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Sounds scary. Is there also a love story or something of that kind?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:32:21.384Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Ughhh doesn't say. I'd imagine it being about 90 minutes but doesn't say. And I don't know lol I'm only allowed to talk about what's in the different scenes and discriptions and it doesn't tell me if there is or not. I'd imagine honestly, but I have no clue", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:34:26.281Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What do they say about the movie? Can you give me some details?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:35:12.110Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They end up catching a large tiger shark and the mayor proclaims the beach to be safe, but evidently it's not. A bounty is then placed on the shark which results in an ameture  shark- hunting frenz.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:37:31.047Z"
    }, 
    {
      "docIdx": 3, 
      "text": "frenzy*", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:37:42.392Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't think it's even a tiger shark right? It's more like a big white shark.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:38:43.099Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Some explosion kills the shark and the guy that barely made it paddles back to the island. And yes, I'm pretty sure it's great white. I think the people in the movie were confused with what they caught and they were wrong.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:39:37.690Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The more we talk about it the more I think it sounds like a dumb movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:40:03.634Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I guess it's all in the way the story is told, right?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:40:16.985Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm not allowed to say lol But I will say that you wouldn't be wasting your time if you didn't watch it because I am allowed to say that at least. And I guess so. Regardless, the shark dies and everyone's happy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:42:24.757Z"
    }, 
    {
      "docIdx": 3, 
      "text": "OK... Still on the fence. Is there anything else in your documents that could convince me it's a decent movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:43:04.575Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Hey, I think our freedom has been given back to us. We can finish the conversation now :-)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:43:49.695Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-13T18:56:14.002Z", 
  "uid1LogOutTime": "2018-02-13T19:43:52.064Z", 
  "uid1response": {
    "feedback": "The conversation was plodding but we eventually got there. But my partner did not say anything that made me feel like actually watching the movie. It just sounded dumb, although I know it's a classic so it's gotta be good somehow.", 
    "response": [
      2, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T18:56:14.046Z", 
  "uid2LogOutTime": "2018-02-13T19:44:19.863Z", 
  "uid2response": {
    "feedback": "If you read through our conversation, we were obviously a bit confused and I was asked questions that I'm not sure if I was permitted to say or not and for that I apologize, but we both tried our best and followed the directions the best we could, so with that being said, I hope you understand and give us both credit. We seriously tried. All in all, it was a very interesting task and pretty cool to talk to someone that was actually real. You guys did well with creativity and giving a task that wasn't mundane and was unique.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4194", 
  "user2_id": "USR3940", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 2
}