{
  "date": "2018-02-14T22:26:24.508Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:27:14.927Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hi", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:27:25.881Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you been to a movie lately?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:27:37.048Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you seen Dunkirk?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:27:46.042Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you seen Dunkirk?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:27:48.203Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you seen Dunkirk?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:27:50.478Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No. Isn't that a city in France?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:28:05.328Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The movie is Dunkirk, it is based on the evacuation of Dunkirk during WWII. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:29:49.383Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Who directed it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:30:01.245Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The movie is Dunkirk, it is based on the evacuation of Dunkirk during WWII.  It was filmed on site in Dunkirk. The cinematography is amazing. It is like you are there. It is involving and gripping. It sounds and looks like what i am guessing the evacuation looked like during WWII. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:33:12.179Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Sounds interesting. Who stars in the movie? Anyone I might recognize?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:34:01.259Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The movie is Dunkirk, it is based on the evacuation of Dunkirk during WWII.  It was filmed on site in Dunkirk. The cinematography is amazing. It is like you are there. It is involving and gripping. It sounds and looks like what i am guessing the evacuation looked like during WWII. It received a Rotten Tomatoes score of 92. Do you use Rotten Tomato ratings? I think it is a film worth spending the time to watch, gripping and unforgettable.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:36:12.254Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No, I don't really use Rotten Tomatoes. But can you tell me who the director is or who stars in the film?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:37:20.934Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The movie is Dunkirk, it is based on the evacuation of Dunkirk during WWII.  It was filmed on site in Dunkirk. The cinematography is amazing. It is like you are there. It is involving and gripping. It sounds and looks like what i am guessing the evacuation looked like during WWII. It received a Rotten Tomatoes score of 92. Do you use Rotten Tomato ratings? I think it is a film worth spending the time to watch, gripping and unforgettable. The actors did a superb job. Following around a French soldier pretending to be a British private trying to get off of that beachhead. The special effects are amazing. I would recommend this film to anybody who just loves movies, not just war films.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:39:27.196Z"
    }, 
    {
      "docIdx": 1, 
      "text": "When was it released? Last year?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:40:43.808Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The movie is Dunkirk, it is based on the evacuation of Dunkirk during WWII.  It was filmed on site in Dunkirk. The cinematography is amazing. It is like you are there. It is involving and gripping. It sounds and looks like what i am guessing the evacuation looked like during WWII. It received a Rotten Tomatoes score of 92. Do you use Rotten Tomato ratings? I think it is a film worth spending the time to watch, gripping and unforgettable. The actors did a superb job. Following around a French soldier pretending to be a British private trying to get off of that beachhead. The special effects are amazing. I would recommend this film to anybody who just loves movies, not just war films. To give you more to read to get you interested please read the following. Dunkirk is a 2017 war film written, directed, and co-produced by Christopher Nolan that depicts\nWorld War II's Dunkirk evacuation. Dunkirk portrays the evacuation from three perspectives: land,\nsea, and air. It has little dialogue, since Nolan sought to create suspense from cinematography\nand music. Filming began in May 2016 in Dunkirk and ended that September in Los Angeles,\nwhen post-production began. Cinematographer Hoyte van Hoytema shot the film on IMAX 65 mm\nand 65 mm large format film stock. Dunkirk has extensive practical effects, using thousands of\nextras, boats that participated in the evacuation, and period aeroplanes.\n\n\n\n\n\n\n\n\nPage 1 of 1\n\nDunkirk \n\nYear Genre Director Rating \n\n2017 War Christopher \n\nNolan \n\n1. Rotten Tomatoes: 92% and average: 8.6/10 \n\n2. Metacritic Score: 94/100 \n\n3. CinemaScore: A- Cast \n\n● Fionn Whitehead as Tommy, a British Army private \n\n● Whitehead was cast in the lead after a secretive auditioning process lasting several \n\nmonths. His character was named after the slang term for the ordinary British soldier. \n\n● Tom Glynn-Carney as Peter, Mr Dawson's son \n\n● Jack Lowden as Collins, a Royal Air Force Spitfire pilot \n\n● Harry Styles as Alex, a private in the Argyll and Sutherland Highlanders \n\n● Styles won the role after auditioning against hundreds of candidates, when Nolan was \n\nunaware of his renown as a singer. \n\n● Aneurin Barnard as \"Gibson\", a French soldier masquerading as a British Army private. \n\nIntroduction \n\nDunkirk is a 2017 war film written, directed, and co-produced by Christopher Nolan that depicts \n\nWorld War II's Dunkirk evacuation. Dunkirk portrays the evacuation from three perspectives: land, \n\nsea, and air. It has little dialogue, since Nolan sought to create suspense from cinematography \n\nand music. Filming began in May 2016 in Dunkirk and ended that September in Los Angeles, \n\nwhen post-production began. Cinematographer Hoyte van Hoytema shot the film on IMAX 65 mm \n\nand 65 mm large format film stock. Dunkirk has extensive practical effects, using thousands of \n\nextras, boats that participated in the evacuation, and period aeroplanes. \n\nCritical Response \n\n● \"surrounds his audience with chaos and horror from the outset, and amazing images and \n\ndazzlingly accomplished set pieces on a huge 70mm screen, particularly the pontoon \n\ncrammed with soldiers extending into the churning sea, exposed to enemy aircraft\" \n\n● \"an impressionist masterpiece\" that was \"deeply moving\" but without \"manufactured \n\nsentimentality or false heroics.\" \n\n● \"There's little doubt that [Nolan] has, without sentimentality or sanctimony, raised that \n\ngenre to the level of art...with the resonant force of an enduring screen classic.\" \n\n● \"tight, gripping, deeply involving and unforgettable ... triumph in filmmaking\" \n\n● \"[Dunkirk] is 106 clamorous minutes of big-screen bombast that's so concerned with its \n\nown spectacle and scale that it neglects to deliver the most crucial element—drama.\" \n\n\n\n\n\n\n\n\n\n\n\n\nPage 1 of 1\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDunkirk_1\n\n\n\n\n\n\n\n\n\nOpen with Google Docs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProfile\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nPage 1 of 1", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:43:13.848Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think I've heard of Christopher Nolan before. But Fionn Whitehead is a new name to me, as are the others. Do you know what else they have been in?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:45:50.386Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well, User 2 left. I guess that's it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:49:15.239Z"
    }, 
    {
      "docIdx": 2, 
      "text": "FWIW, I've seen \"Dunkirk.\" It was a good war movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:49:38.524Z"
    }
  ], 
  "rating": 3, 
  "status": 0, 
  "uid1LogInTime": "2018-02-14T22:26:24.508Z", 
  "uid1LogOutTime": "2018-02-14T22:43:56.527Z", 
  "uid1response": {
    "response": [
      2
    ], 
    "type": "abandon"
  }, 
  "uid2LogInTime": "2018-02-14T22:26:24.716Z", 
  "uid2LogOutTime": "2018-02-14T22:49:44.063Z", 
  "uid2response": {
    "feedback": "User 2 quit at the end after dumping what looks like the notes for the assignment. That, or they found something online and copy-pasted the information. Either they didn't have answers to my questions, or just got fed up with process. I said I will watch the movie, but I already have seen it. Based on the exchange here, I would not watch it, because the other user could not answer my questions.", 
    "response": [
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR615", 
  "user2_id": "USR1989", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 9
}