{
  "date": "2018-02-13T18:56:16.988Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "So how much did you enjoy the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:57:32.632Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I enjoyed the movie but not much into musicals.As far this genre of movie goes I guess it was better than average.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T18:58:40.451Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, i like musicals but jazz isn't one of my favorite genres. But overall i liked the story and the actors.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T18:59:44.851Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree the story was interesting and the acting was good.Did you like any of the musical scores?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:00:57.793Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah they were fine, like i said jazz isnt my favorite but it depends on what kind of jazz, i really love Ella Fitzgeralds music. The jazz in this movie wasnt supper jazzy so it was fine but i do prefer more pop or melodramatic musicals, what about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:03:08.575Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought the story kind of lost interest in the middle.Did you find this to be true? I agree with the idea of a more melodramatic plot.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:04:12.862Z"
    }, 
    {
      "docIdx": 0, 
      "text": "There definitely were parts where the plot and characters seemed a little dull and  sort of lost interest, but that happens in almost every movie. Overall i think its a fine movie but i dont really get why critics rated it so high i just dont see it as that amazing.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:05:58.213Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What did you think about the acting? Do you think the characters were true to life?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:06:11.209Z"
    }, 
    {
      "docIdx": 0, 
      "text": "For the most part the acting was good, some of the writing was a bit dull tohugh, as far as true to life i found it kind of odd that this middle aged white guy was the one saving jazz which is a traditionally African american genre, what did you think about that?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:07:33.954Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree that the ratings seemed a little high for this movie.I dont pay much attention to ratings anyways do you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:07:52.482Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree jazz was founded by the black culture of the day and probably was influenced very little by white society.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:09:43.231Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No not usually as long as i like a movie critics opinions dont matter. So what did you thing of the scene where Sebatian was fired for singing jazz instead of Christmas\n and then met up with Mia again months later, i tohught it was  kind of cute but also pretty typical of a movie like this.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:10:48.409Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I thought the scene added a little bit of a twist and some dramatic appeal.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:11:57.077Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree the scene was typical of this sort of movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:13:01.919Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah i liked it was well it just seemed a little stale like how the prince saw cinderalla at the ball and the found her and this was like mia was the prince and she found sebastian, i just wish movies like this could think outside the box a little more.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:13:23.153Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree with the Cinderella comparison.I see a lot of reoccurring themes in movies.Do you notice a repeat of ideas across many different movies?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:15:01.357Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah defintiley, i think that at this point there have been so many films that explore so many different themes that it is rare to find a film that feels truly unique. Everything in some way takes from something\n else but im generally ok with that as long is done in an entertainng way.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:17:05.345Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree but would still like to see some original ideas on screen.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:17:53.917Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you think this film will become to be regarded as a great success?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:19:31.879Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes truly unique fims are usally the most enjoyable, and i od think it will be considered\n a success.  How did you feel about the whole scene where Sebastian joins the band even though he doesn't like their music, i feel most people would do the same because they need the money but it is sad when people can't do what they are truly passionate about.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:20:00.060Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree with you about the scene Im sure it was hard for the musician to put aside his passion and compromise his talent because of financial hardships.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:22:09.918Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah at least he was still getting to play music though, better than having to get an office job that he would hate even more but still i o see how his character would feel defeated over that, and how Mia would feel for him seing him not being happy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:23:47.757Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree at least he was able to work in his field.I think this scene leads us to examine our own priorities to an extent.Maybe that was its purpose.I often find hidden meanings in movies.Do you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:25:52.920Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah i think most people can find things in movies that can be applied to themselves in one way or another. I usually find myself looking\n for these hidden meaning more often if im watching a movie for a second or third time, how about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:27:29.779Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes I often get meaning that I overlooked the first time in a second viewing.Did this movie have any special meaning for you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:29:10.344Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Nothing to special just a shared love for music, albeit different genres. How did you feel about the scene where Sebastian missed Mias play so she left him and moved back home. I found it to be sad but yet again this is also something that happens\n in most romantic movies so i saw it coming.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:31:20.076Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I thought is was sad also but like you said typical romantic plot.Do you know if this movie was based on any real life people or just the jazz community in general.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:33:16.468Z"
    }, 
    {
      "docIdx": 3, 
      "text": "As far as i know it wasnt based on anything \nreal just the general struggle of people in the acting and music industries.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:34:44.892Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thinking aobut it overall how did you feel about the movie, how would you rate it , would you recommend it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T19:35:23.471Z"
    }, 
    {
      "docIdx": 3, 
      "text": "There have been many movie themes that touch on the struggles of those in the entertainment industry.It must a tough world for performers.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:36:45.423Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I would recommend it to certain groups of people I know.I enjoyed parts of the movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T19:38:00.376Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-13T18:56:16.988Z", 
  "uid1LogOutTime": "2018-02-13T19:38:10.576Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T18:56:17.015Z", 
  "uid2LogOutTime": "2018-02-13T19:37:09.536Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR289", 
  "user2_id": "USR1981", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 3
}