{
  "date": "2018-03-22T23:24:50.704Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hey Hey!!! So have you heard of this amazing movie called Monsters University?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T23:25:47.609Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No I haven't actually? What kind of movie is it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T23:26:22.772Z"
    }, 
    {
      "docIdx": 0, 
      "text": "AHHH you are going to love it. Monsters University is a animated comedy about two best friends who are monsters who decide to take on college.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T23:27:19.850Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ahh, I see. An animated movie. I do enjoy em' every now and again. anyone I would know who does voice acting in that movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T23:29:00.624Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh I am sure you have heard of Billy Crystal and John Goodman, they are both legends!!! I think my favorite though is Steve Buscemi, because he is just too funny.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T23:39:05.026Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wow sounds like a great cast! I love John Goodman and Steve Buscemi is amazing. Could you tell me more about the storyline? What do Monsters actually \"do\" in college anyway? haha", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T23:40:36.160Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is the store about Mike and Sulley who start out as rivals and quickly become best friends. They go to scare classes because after all the are monsters. But one of the best parts of the movies is where they form their own fraternity.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T23:47:15.733Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That sounds hilarious! Since there in college, is there any suggestive content? What is this movie rated exactly? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T23:49:06.608Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is a children's movie, so it is only rated G and there is not explicated content. Some funny scenes where parents\n will understand more than the child.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T23:55:21.247Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Good to know. As a matter of fact, I think I remember the original one back in 2001, and it was really good. This must be a prequel film, am I correct? Since it takes place in the college years as opposed to them working regular jobs. BI'm really getting interested", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T00:03:41.175Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The original was a classic. Yes you are right, this would be the prequel to the first one where you really get to know the characters. I loved watching this one, and then going back and watching the first and seeing how they transitioned from college to the work field.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T00:26:11.116Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What is the typical genre of movies you watch?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T00:30:40.771Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah I have to say I'm pretty sold on it. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T00:35:43.120Z"
    }, 
    {
      "docIdx": 1, 
      "text": "and I usually watch comedy movies, across all types, including animation, but I am also a big fan of action movies. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T00:36:06.200Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Does this fall in line with what you typically watch as well?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T00:36:19.524Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I love animations and comedy, so it is definitely up my alley. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-23T00:36:52.331Z"
    }, 
    {
      "docIdx": 1, 
      "text": "and this is from Pixar studios, correct?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T00:37:32.502Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Because I always get Dreamworks Studios and Pixar confused with which is which haha", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T00:39:20.060Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Either way though, I think this sounds like a good flick. I'm especially sold on the frat scene you mentioned. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T00:43:17.255Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do think I'd like to see it", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-23T00:43:26.024Z"
    }
  ], 
  "rating": 2, 
  "status": false, 
  "uid1LogInTime": "2018-03-22T23:24:50.704Z", 
  "uid1LogOutTime": "2018-03-23T00:43:59.792Z", 
  "uid1response": {
    "response": [], 
    "type": "abandonWithoutAnsweringFeedbackQuestions"
  }, 
  "uid2LogInTime": "2018-03-22T23:24:50.741Z", 
  "user1_id": "USR823", 
  "user2_id": "USR1546", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 23
}