{
  "date": "2018-02-17T12:03:55.262Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "I have a hard time with wanting to watch a musical. A lot of times, anymore, they don't come out that great.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:08:06.534Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I don't like the musicals they make these days.  The stories in the older musicals are much better.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:09:24.480Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree. This one seems like it is even worse. They talk about how it drags in the middle and the singing by both actors is not that great.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:10:09.185Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree.  I wasn't even too crazy about the music.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:10:53.943Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do like Ryan Gosling and Emma Stone though. I would be willing to try to watch it just because I like them as actors but I don't know if I would make it all the way through the movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:11:46.205Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hailed as the years most pleasurable entertainment.  That kills me.  It's all subjective based on what you like.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:12:18.406Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree. I can't tell you how many times I have seen a rating on a movie and thought \"What movie were they watching?\" haha!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:13:04.564Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree.  I also agree I like the actors in the movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:13:32.931Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I would just be curious to see if it is really as bad as the critics make it out to be or if they just didn't like this particular movie idea. I don't really understand what they are saying when they say Sebastian is a jazz snob. What is that?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:15:15.337Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think it means he is snobby about the kind of jazz he likes.  Like a person is snobby about the kind of designer clothes they wear.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:16:28.389Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I see. I like the fact that they are both doing what they love in the movie and in turn fall in love with each other because of following their dreams.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:19:12.721Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree, I don't know why people resist love so much though.  They have such animosity for a while when they are so clearly attracted to each other.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:20:40.537Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Right?! I also find it admirable that they are trying to make a movie based on loving Jazz. To be honest that is one type of music I just can't get into.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:21:48.598Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No I love jazz but only instrumental.  I enjoy trying to determine the instruments used in the music.  I find it very relaxing.  Like Kenny G playing the saxophone\n.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:23:14.566Z"
    }, 
    {
      "docIdx": 1, 
      "text": "More power to you. I grew up loving music but never got into Jazz. I agree with your earlier statement about how it is hard to understand why people resist love so much. Maybe just bad experiences with it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:24:38.020Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I also find it amusing how people find fault with others for things \nthey themselves have issues that should be resolved.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:26:54.251Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Agreed. I hate how in the movie he has to somewhat give into what he doesn't really like just to be able to make things work. It is definitely more like what the real world is like.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:29:52.300Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Happiness will never be achieved unless there is compromise.  However when it comes to compromising your true feelings instead of lettering your significant other really know how you feel then you will never achieve happiness either.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:30:43.661Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Couldn't have said it better myself. It is hard to not want to hide your true feelings from the one you love, especially if you are worried about disappointing them in some way.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:31:50.038Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He chose to play in the band to prove to her and her mother that he was someone.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:32:18.356Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Right but he didn't really want to play in that band. He hid his true feelings to make her and her mother happy.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:33:08.970Z"
    }, 
    {
      "docIdx": 2, 
      "text": "If she really loves him she would not want him to do that.  If they don't communicate then this is where they end up, miserable.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:33:08.977Z"
    }, 
    {
      "docIdx": 3, 
      "text": "All of the things happening in this scene are simply caused from lack of communication about what each person wants.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:35:01.212Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, you can definitely see where there relationship starts to fall apart. It is when they start being dishonest with each other and covering up  their true feelings in order to appease the other.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:35:18.221Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Lack of communication is the main reason I feel like most relationships don't work", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:35:45.379Z"
    }, 
    {
      "docIdx": 3, 
      "text": "When you are a couple decisions should be made based on what is best for the couple.  Each side explains how they truly feel and they come to a consensus\n.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:35:53.193Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The problem is no one is honest about their feelings.  Sometimes on purpose, sometimes because they don't even know how they truly feel.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:36:34.930Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree but sometimes, in all honesty, life can get in the way. Lack of communication is a problem but sometimes it is not intentional.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:37:02.732Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That is true and human nature for some reason demands that a person think the worst instead of interpreting things in the positive.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:37:51.791Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, not sure what that is all about. I wonder if it is some type of survival instinct?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:38:37.015Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yea you are probably right about that.  It is hard to be vulnerable.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:39:15.143Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That is definitely true. I think that is one of the main points in this movie. Even though the main characters are living together, it is still hard for them to be completely vulnerable with each other.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:40:13.310Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree. I don't know why it is so hard just to say what you think and feel.  If a person truly loves you they will take the good with the bad.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:40:57.557Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I feel the same way. It is hard to find that though.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:41:32.022Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I believe we have met the terms of the task.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:42:04.038Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think so too. Do we just press finish conversation?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T12:42:34.173Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Let's give it a try.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T12:42:46.044Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-17T12:03:55.262Z", 
  "uid1LogOutTime": "2018-02-17T12:42:53.028Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-17T12:03:55.266Z", 
  "uid2LogOutTime": "2018-02-17T12:42:48.098Z", 
  "uid2response": {
    "feedback": "I watched about a quarter of the movie.  It wasn't for me.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2484", 
  "user2_id": "USR1691", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 3
}