{
  "date": "2018-02-07T21:36:30.663Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! You should totally see La La Land. It's a romantic comedy, but it's got a lot of good music, is set it LA, etc.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:37:27.400Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hey there! Cool, what is it about?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:37:55.916Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's about a ajzz pianist (Ryan Gosling) and an aspiring actress (Emmas Stone) who meet and fall in love in LA. Trying to save jazz and what not. It got great reviews!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:38:29.592Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That sounds fun. I like Ryan Gosling and Emma Stone. Is the movie in theaters or is it out now?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:39:23.065Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No, it's a 2016 movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:39:38.571Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Cool. Do you know if it's on Netflix or any other streaming services?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:40:15.188Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I don't, but my guess would be yes. Of course, there are some who pan it, but it got 92% on Rotton Tomatoes, FWIW.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:40:51.622Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well I'll have to check it out. 92% on Rotten Tomatoes is pretty good!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:41:43.508Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree. IMDB was a bit less favorable at 8.1, but Metacritics is in line with RT at 93%/", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:42:24.183Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Very nice. I don't know tons about movies and ratings, but I feel like 8.1 on IMDB is pretty good still. Are there any other notable actors or actresses in it? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:43:41.971Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes - John Legend and Callie Hernandez. It's got some nice jazz improvisation -- you know, the artist is warned to stick to the traditional music, but he improvises instead. You know how it goes, but it's still really fun. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:45:26.486Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That makes sense that John Legend is in it. He's an incredible singer. I've never been a huge jazz fan but I think that jazz has a lot of mystery about it, and this movie seems to revolve around that a bit. You said it's a romantic comedy right? So how much jazz is there actually in it, pretty limited? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:47:06.257Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think they might realize that their audience isn't going to be a bunch of jazz heads, so Sebastian (the one who wants to save Jazz, played by Gosling) is playing a 198\n0s pop band cover, so there's still some variety. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:49:34.462Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I see. Is it set in present day then?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:50:17.265Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Well, it's at least post-80s... :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:50:57.259Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Close enough then, makes sense with the pop cover band in the 80s like you said haha. I missed that part ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:51:48.752Z"
    }, 
    {
      "docIdx": 2, 
      "text": "There's a pretty good variety of music. For example, Sebastian performs at a jazz club, but joins a jazz fusion band and is dismayed by their pop sound, so you can see it's not completely jazz-jazzy.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:53:56.671Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah for sure. So does the story mostly revolve around music then or does it pay a lot of attention to Emma Stone's role as an actress too?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:55:02.589Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It pays a lot of attention to her as well. She's an aspiring actress -- Sebastian suggests she write a one-woman play. So she has he own thing going as well as her relationship with Sebastian and her concern for his career ambitions and her wish for him to be able to have an income but also enjoy what he is playing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:56:35.261Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Nice, that sounds pretty interesting. I bet it's an interesting dynamic to portray both a young actor and actress and how they have to prioritize their relationships and careers and what not. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T21:59:03.577Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes. And John Legend is the one who has the jazz fusion band. He's Gosling's former classmate.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T21:59:36.698Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So he recruits Gosling to join his band once Gosling is in a rough patch or something? Why does he go for it instead of sticking with true jazz?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:00:19.510Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Ah, indeed. Sebastian overhears Mia (Stone) trying to convince her mother that Sebastian is working on his career, so he finds success with this band, but doesn't like it, which upsets Mia. During their first tour, they get into an argument over your very statement - abandoning his dreams.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:01:55.655Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So does he stick it out with the band or quit the band? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:02:50.031Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That is left unresolved, but he and Mia break up in the end, because he misses her play -- a disaster (the play) -- due to a band photo shoot. He tries to apologize, but she gives him the bird and moves back home.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:04:04.908Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well damn. So it's not your typical romantic comedy with a happy ending then.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:05:05.086Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, you can't win 'em all. It's more of a romantic comedy-drama. Yeah. She's all despondent at the end and goes home to Boulder City, Nevada.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:06:19.585Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's good though, I think it's good for movies to have a dose of reality in them sometimes rather than everything just being so perfect. I think I'd enjoy it", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:07:19.880Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thanks for the summary, I really appreciate it!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T22:07:29.833Z"
    }, 
    {
      "docIdx": 3, 
      "text": "My pleasure!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T22:07:35.155Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-07T21:36:30.663Z", 
  "uid1LogOutTime": "2018-02-07T22:07:39.209Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-07T21:36:30.698Z", 
  "uid2LogOutTime": "2018-02-07T22:08:10.892Z", 
  "uid2response": {
    "feedback": "The user gave a really good summary of the film, it sounded like a good movie.", 
    "response": [
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR338", 
  "user2_id": "USR2235", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 3
}