{
  "date": "2018-02-20T04:02:14.427Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi have you ever seen the movie catch me if you can?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:03:00.138Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have never seen the movie catch me if you can. What is it about?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:03:28.333Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Its about a guy named frank who performed millions of dollars in cons posing as a pan american airways pilot, a georgia doctor and a LA prosecutor. His primary crime was check fraud. He was so experienced the FBI eventually caught on and turned to him to help catch other forgers", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:05:40.539Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Its a super interesting movie the main character is Leonardo DiCaprio", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:06:14.833Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Based on a true story. do you like crime movies?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:07:05.728Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That definitely sounds like something I could be interested in. I do like crime movies alot. Who else stars besides leona\nrdo dicaprio?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:07:42.533Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Tom Hanks and Christopher walken nathalie baye and amy adams", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:08:11.534Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you ever seen gangs of new york?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:08:20.436Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I love Amy A\ndams! She's one of my favorite actors. Now I'm definitely interested.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:09:09.295Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No, I have not seen gangs of new \nyork. What is it about?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:09:41.017Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yea you should definitely check it out. some critics gave it poor ratings but me peronally its a good watch ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:09:50.055Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like to know what critics think before seeing a movie but I usually have my own opinions once I've watched it. What did critics say in particular was bad about it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:11:01.994Z"
    }, 
    {
      "docIdx": 1, 
      "text": "gangs of new york is about a gangster in new york who also does fraud stuff and gets rich he started out as a drug dealer then got into fraud with a friend who eventually robs him and takes him all the way down from the top. Pretty much your average do bad bad happens to you.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:11:11.343Z"
    }, 
    {
      "docIdx": 1, 
      "text": "They said its not a major spielberg film but an efortlessly watchable one. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:12:04.535Z"
    }, 
    {
      "docIdx": 1, 
      "text": "bogged down over 140 minutes a film that took off like a hare on speed ends like a winded tortoise", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:12:34.384Z"
    }, 
    {
      "docIdx": 1, 
      "text": "but it has a 96% rotten tomatoes score and A- cinema score. Which rotten tomatoes higher the score better the movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:13:12.063Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh speilberg is the director. I enjoy the majority of his movies. I think even a bad spielberg movie can be enjoyable. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:13:15.945Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes then you would like this especially if you like crime movies", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:13:37.186Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I see, so gangs of newyork is right up my alley. Who is the lead in that film?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:14:44.491Z"
    }, 
    {
      "docIdx": 1, 
      "text": "One of the key scenes is when Frank's father is denied a loan at the bank and they have to move to a super small apartment. Frank eventually runs away and when he runs out of money thats when his schemes brings him success", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:14:57.776Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I dont have all the specifics of that movie in front of me and im terrible with actor names lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:15:24.737Z"
    }, 
    {
      "docIdx": 1, 
      "text": "But if you like crime movies especially those that are based on factual events catch me if you can is the way to go. Gangs of new york isnt based on factual events", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:15:58.851Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No problem, Comparing gangs of newyork to catch me if you can, I think I prefer the former since its based on true events. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:17:21.991Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yea another key scene is when he returns after having been run away for years and going to prison he walks in on his mother with his fathers best friend. Which the reason he returned home was because he was informed by a friend that his father had passed. COuld you imagine wlaking in on that? How awful", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:18:51.098Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Wow, that is awful. This movie seems to be filled with many twists and turns. Did his father die aturally or was it a result of him being involved with criminal dealings?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:20:05.963Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No the father was a stand up guy actually. He didnt do anything crazy crazy. Frank got into scheming because he was so tired of watching his father be beat down by the system. Then he eventually when he gets caught, he gets offered a deal to work with the FBI in the banks fraud dept to catch fake checks coming thru. His best scheme was for 2.8 mil forging pan am airways payroll checks.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:21:44.167Z"
    }, 
    {
      "docIdx": 2, 
      "text": "When the FBI was searching for him, he assumed the identity of a pilot so he could flee where the FBI was searching for him initially. Super Genius!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:23:34.230Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Frank is definitely a character I can relate to since I've had to witness my parents go through the same thing. So, I can understand franks motives for behaving the way he does. He is super smart.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:24:49.792Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Definitely. So you think its a movie youd be interested in so far?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:25:13.624Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What was the deal he cut with the fbi? Less jail time?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:25:19.115Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think so. I enjoy crime movies alot so I think I'd definitely watch it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:25:59.272Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They arranged for him to work in the banks fraud dept for the remainder of his sentence to catch fake checks", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:26:06.249Z"
    }, 
    {
      "docIdx": 3, 
      "text": "eventually he ends up finishing out his sentence in the fraud dept he gets married has 3 sons catches some of the countries most elusive forgers and ends up making millions creating unforgeable checks", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:27:08.841Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thats pretty cool that he was able to cut a deal with the fbi involving no prison time. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:27:12.313Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Absolutely. You wouldnt catch a break like that now a days thats for sure. Now they think they know everything because of all the technology. Little do they know if they hired some of the white colar crime people they put away to work for them they would be way more effective at stopping it", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:28:07.866Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I love a good ending. Im happy he was able to get married and have children. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:28:15.627Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Me to in the begining i definitely thought he was going to end up in prison the rest of his life or end up in some country where he couldnt be extradited just hiding out", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:28:56.138Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Exactly. If they employed people like they do in this movie they wouldnt have to be criminals. I completely agree.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:28:59.750Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well i hope you get the chance to watch it some time. you wont regret it", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T04:29:27.739Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, but then that woyuld be a sad movie and I wouldnt be interested in that. I prefer happy endings to my \nmovies,", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:29:40.382Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thanks bye,", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T04:30:00.954Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-20T04:02:14.427Z", 
  "uid1LogOutTime": "2018-02-20T04:29:30.777Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-20T04:02:14.468Z", 
  "uid2LogOutTime": "2018-02-20T04:30:07.449Z", 
  "uid2response": {
    "feedback": "I think the other user did a great job of summarizing the plot of the movies. I appreciated the volunteering of information I hadn't thought to ask for like the critics rating and scores on rotten tomatoes. ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2061", 
  "user2_id": "USR3014", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 19
}