{
  "date": "2018-02-08T21:32:34.047Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello, what did you think of Frozen?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:32:49.439Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It sounds very good, but I've never seen it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:34:52.045Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well, task says you're supposed to imagine you've seen it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:35:15.403Z"
    }, 
    {
      "docIdx": 0, 
      "text": "True. I will say I liked it, since I generally like Disney films. Did you like it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:35:39.749Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was pretty good.  Definitely fun for younger kids, but I like Disney movies.  What did you think of Elsa?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:36:08.346Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really like Idina Menzel's voice, so I liked Elsa.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:36:58.270Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Interesting.  As far as actors, I'm not too fond of Kristen Bell, so wasn't really into Princess of Arendelle.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:37:37.846Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can understand that. Did you think the songs were Broadway quality, like one of the critics said?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:38:33.567Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, and like another one said, you could definitely see it becoming a Broadway musical....but I'd prefer the cartoon movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:39:04.156Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Sometimes Broadway productions can be a bit too flashy for my taste, so I can understand that.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:39:54.913Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So, did you find it \"emotionally gripping\" like others said, or were you just entertained?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:40:29.232Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I have sisters so I can sort of identify with the idea of reuniting with a sister who has become estranged - in that way I suppose yes. How about you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:41:48.595Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I don't get too caught up in that stuff.  I like the \"jokey middle\" as one critic put it, far better, that's more my style.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:42:29.483Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Disney films definitely need jokes and fun bits, all of the good ones have them. Perhaps that critic doesn't normally like Disney movies. Do you think that Frozen showed that Disney was still relevant like the final critic put it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:44:14.469Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, in a way.  It wasn't nearly as good as some of their past movies, like \"Beauty and the Beast\".  That one had hilarity throughout.  I mean, every Disney movie has some kind of moral of the story, but generally I watch them for the laughs that most people don't get.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:45:24.059Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you think it might have been better if it was done in traditional animation rather than computer animation? I usually prefer traditional animation, and I think it's more conducive to those little visual jokes, like the ones in the Little Mermaid in Ariel's collection of things that people use and such.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:47:46.048Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, absolutely.  I think Disney knows who they are, but someone new always comes along and wants to \"upgrade\" things that don't need to be upgraded all the time.  Still, some of their more modern stuff is pretty good, and like you said, allows for some of the fun and hijinks.  What part was your favorite?  The beginning, the end, somewhere in between?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:50:14.174Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Probably the jokey middle, like you. I like to have fun with my children's movies. Do you think that one of the director's being a woman contributed positively to the outcome, since the movie has such a focus on female characters, or do you think it doesn't really matter?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:52:42.700Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Great question.  I mean, it was focused on a female lead her sister, it might be conducive to have a female directing it as she would know what it's like to be a girl...but\n, have to say, some male directors do a pretty good job of figuring them out, as well.  I think it really didn't matter, to be honest.  What about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:54:53.765Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think that with a company like Disney there's so much input from so many talented people that it probably didn't make a difference. If it had been more of someone's personal passion type of movie it would be more likely to matter.\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:58:12.800Z"
    }, 
    {
      "docIdx": 2, 
      "text": "True.  I think one of the messages in the movie wouldn't matter in regards to gender.  What I noticed in the movie is what we can see a lot in real life.  Elsa has these powers that she keeps hidden, (like someone with a talent), but in front of the King, she accidentally reveals those powers and everyone trashes on her to the point that she hides away in some mountaintop to be by herself for the rest of her life.  There's definitely a link to how some people in life are treated due to their abilities, as well.  Did you get that, or did you get a different message?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:00:13.849Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I definitely agree that the movie sends a strong message that it's wrong to judge people by how they are through no fault of their own, but also that isolating yourself is very unhealthy, like how Elsa running away instead of dealing with her powers causes eternal winter in Arendelle.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:03:06.796Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you think that Hans secretly being evil was a good twist, or do you think that people would have expected it before it happened?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:04:53.764Z"
    }, 
    {
      "docIdx": 3, 
      "text": "In a way, it could be expected as there always has to be a villan.  And it prompted Elsa to accidentally reveal her powers...but, the good part about all of that is, the evil did not win again, because the threat of her sister being frozen forever got Elsa to reverse the spell.  So, as always, people like Hans never win.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:06:26.594Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That is probably the best message of all - that scheming and villainy don't pay off. Some people say that good vs. evil type plots are too black and white morally, but I think that sometimes you just need something that's fundamentally simple, especially for a children's movie. What do you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:08:48.345Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Absolutely.  It's in a lot of Disney movies, too.  You have a couple of characters who have had a nice, happy, peaceful life, something happens (in this case she injured her sister and then their parents died), but they kind of recover, then they are met by evil, and they manage to overpower it because of their bond - there's so many messages in this movie, that's it great for little kids to see.  I think they might be learning while not realizing it.  Do you think that's possible, or do they need to be older to understand what's going on?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:10:27.679Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Kids are like sponges for learning, really. I think they do learn without knowing it a lot, and like you said, there are a lot of good messages that they'll internalize, like the power that comes from working together. Older kids probably get something different from the movie, just because they can understand nuance a little better, but even little kids benefit from good moral messages in media.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:13:15.677Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree.  There's a lot of them in this movie.  Evil plots never win, love is stronger than evil, as you said, working together creates positive outcomes, and when you do all of that, you can have your \"happily ever after\" ending.  I was going to ask you, but you kind of hit on it, what you think adults get from it....", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:14:28.283Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think adults get good moral message as well, while understanding the nuances much better than kids. It looks like the task is done, but it's been fun talking. Cheers!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:15:40.668Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-08T21:32:34.047Z", 
  "uid1LogOutTime": "2018-02-08T22:15:45.268Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-08T21:32:34.079Z", 
  "uid2LogOutTime": "2018-02-08T22:16:00.699Z", 
  "uid2response": {
    "feedback": "The instructions about 4 different documents coming up was a little confusing.  Nonetheless, this was an interesting hit.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR864", 
  "user2_id": "USR2660", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 0
}