{
  "date": "2018-03-20T23:56:14.241Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T23:56:51.069Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hi, how are you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T23:57:36.674Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Great, thanks. You? How was the movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T23:57:54.519Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Excellent, thanks for asking. It's Toy Story!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T23:58:47.910Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What was it about? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T23:59:07.926Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I've never seen it and would love to know if I should sit down to watch it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T23:59:28.002Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Good! it is about the relationship between an old;fashinoned pullstring cowboy doll and an astronaut action figure. They are initially rivals competing for the affections of their owner but end up working together!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:01:00.662Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Is it scary at all? What ages do you think it's appropriate for? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:02:18.806Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The information available doesn't tell me the age it is appropriate for, but it says itś a buddy comedy adventure film, so my best guess is , it would be a wonderful treat for the whole family!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:05:16.552Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It also includes an astronaut action figure, so it might include some intense action scenes, but nothing really scary from what I know.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:06:49.379Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Awesome, thanks. Do you know what the main conflict is or what the characters are trying to resolve? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:08:16.560Z"
    }, 
    {
      "docIdx": 1, 
      "text": "There are at least two main topics in the movie: The first one, the conflict between Woody, the old-fashioned toy , and Buzz Lightyear, the space ranger arrived as a gift surprise, for the affections of their owner, six-year-old Andy Davis; and the second, Andy's family is moving, toys and everything, to a new home. The moving topic is prevalent through the whole movie, but in its first half it moves to the background to highlight the rivalry between Woody and Buzz; finally, when the rivalry is solved, they work together to be reunited with their owner.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:15:03.024Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That sounds interesting. Does the boy, Andy, know that his toys are \"alive\" or have lives outside of the time he sees them? Is it part of his imagination or really happening? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:16:44.301Z"
    }, 
    {
      "docIdx": 1, 
      "text": "toys pretend to be lifeless whenever humans are present. There is no way to find out if Andy is aware of that.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:18:36.315Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That might add up to the comedic factor!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:19:32.760Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh! I see. Do you know how long the movie is? ... Oh, I'm assuming it is all a cartoon right? Or is it like the old 80's and 90's movies that mixed cartoons and regular film? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:20:00.047Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Toy Story was the first feature-lenght computer-animated film and the first feature fillm produced by Pixar, so it is definiitely not a short film. And it is computer-animated, moving one step beyond the cartoons. it does not appear to include \"regular\" scenes, it might be computer animation only.. Something really interesting to watch for the weekend, don't you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:24:35.158Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm thinking about it. It sounds really interesting - but it is a cartoon. I'm wondering if the content matter is deep enough for an adult to walk away with something from it. What do you think? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:27:10.268Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I didn't realize it was the first Pixar film. THa", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:27:30.111Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's pretty awesome. I think I've enjoyed other Pixar films and wonder if this one is similar.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:28:07.167Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Good question. A film critic says the movie has the king of spring-loaded allusive prankisness that at time, will tickle adults even more than it does kids... so it seems all infants, youngsters and grown-ups are entitled for a big share of laughs and enjoyment. Nobody is likely to get bored, regardless the age.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:29:52.958Z"
    }, 
    {
      "docIdx": 2, 
      "text": "about other Pixar films, critics gave rave reviews to Toy Story, so when you succeed the first time you are more prone to repeat the formula. That is what I think.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:32:47.032Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's true. Are there any villains in  this film? I know you explained conflict between the cowboy and the astronaut - but are there \"bad guys\" in addition to these main characters?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:34:56.492Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Also, since it is the first Pixar film - do you think the quality of animation is the same as later Pixar films? I just wonder if I've already \"seen\" it in a remake (the repeated formula) and will be bored or uninterested if I sit down to watch it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:35:54.718Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Ha, I guess I'm very hesitant to watch a cartoon and waste my time.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:36:45.236Z"
    }, 
    {
      "docIdx": 2, 
      "text": "And, at the same time, hesitant to expose my children to a film that may scare them or make them worried about their toys.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:37:17.488Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Of course, you do make really good arguments though. If it's the first Pixar film, well reviewed, and also thought of as amusing to adults - I may be over thinking it. Have you watched it? What would you rate it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:38:06.742Z"
    }, 
    {
      "docIdx": 3, 
      "text": "In first instance Woody and Buzz seem to be \"the bad guy\" to each other. Then upon making peace everyone focuses on the moving...What's in store for the gang then? I think it's definitely worth a look to find out!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:38:32.774Z"
    }, 
    {
      "docIdx": 3, 
      "text": "about the scary stuff.. \nw", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:40:09.173Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, there is a mischivieous neighbor with a chasing dog.. that might be upsetting a little bit , I think", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:40:46.181Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I am getting to know the fillm from this review, and i'm dying to rent it to watch it asap.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:41:36.041Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, that could definitely be scary. - ... Didn't they make other toy stories? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:42:07.714Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm pretty sure I've heard they have-... that's usually a good sign for the first movie at least! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:42:54.112Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think I'll watch it soon.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:43:14.703Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Probably this weekend -... maybe screen it first and then sit with the kids if it's appropriate. Thank you so much for all your help. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:43:36.825Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Good! Hope you enjoy it. And I will have to find out if there have been any other sequels. Being this movie from 1995, it is quite likely.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:45:03.627Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And thanks for your conversation! It's been a pleasure", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-21T00:45:36.440Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, it's been great! \nDo we press abort conversation? My side does not say finish? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-21T00:46:10.470Z"
    }
  ], 
  "rating": 3, 
  "status": false, 
  "uid1LogInTime": "2018-03-20T23:56:14.241Z", 
  "uid1LogOutTime": "2018-03-21T00:46:15.353Z", 
  "uid1response": {
    "feedback": "The responses were very informative ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-20T23:56:14.258Z", 
  "uid2LogOutTime": "2018-03-21T00:47:46.675Z", 
  "uid2response": {
    "response": [], 
    "type": "abandonWithoutAnsweringFeedbackQuestions"
  }, 
  "user1_id": "USR2721", 
  "user2_id": "USR4196", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 29
}