{
  "date": "2018-01-30T21:16:27.789Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Are you a fan of Steven Spielberg?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:17:33.781Z"
    }, 
    {
      "docIdx": 0, 
      "text": "This is my first movie I've seen by him.  It was really scary though!!!  Are you a Spielberg fan?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:18:11.108Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am! I love his movies. What do you think of Jaws?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:18:44.106Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I liked that the characters were actually developed into human beings instead of just being one-dimensional.  I wish there were more female characters though.  The only lead female was the wife of a main character.  What did you think of Jaws?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:20:04.808Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think it's OK. I happen to agree with one reviewer who said that \"characters are simply functions of the action\". I don't really care about any of the characters.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:21:50.584Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree with you.  I definitely think the movie was better at creating frightening sequences, than on character development.  I was surprised to see it had 97% on Rotten Tomatoes.  Would you give it a thumbs up or a thumbs down?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:24:37.275Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely still a thumbs up for me. It's a classic movie. Have you ever read the novel by Peter Benchley?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:25:37.740Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I haven't!  I wonder if that's why the movie was so good at scaring people even without the shark visual, because you don't have the luxury of visualization while reading a book.  Overall, what did you think of Spielberg's directing?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:28:31.277Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well there's a reason why it's still remembered so much 40 years later. I agree with one of the reviewers who said that he knows how to tell a story. It really makes an impression.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:30:22.575Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Definitely agree that it was a scary thriller.  Do you remember the name of the police chief?  I like whoever the actor was that played him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:32:36.455Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The chief was played by Martin Brody. I agree he was really good. For me though, the best performance was the shark hunter, whose name I forget.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:33:38.223Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Robert Shaw, I think, played Quint the shark hunter guy.  What did you think of that opening scene?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:34:17.970Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I first watched that scene like 20 years ago and I still remember it clearly. That's one of the best scenes opening scenes of all time. What about the violence in the movie? Do you think it served a purpose or was it just gruesome?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:35:28.462Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think it was just gruesome.  I have a kid, and I never would have brought my child to see that.  What did you think of the violence?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:36:25.352Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree, it was too much. It seems to be a trend in movies during that time. Any other scenes that stand out to you in the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:37:49.669Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I actually really liked the scene with the medical examiner at the start of the film that lead them to close the beach.  I always find that medical stuff interesting.  How about you?  Did you like or dislike any of the other \nscenes?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:39:27.009Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The scene on the beach, after the mayor refused to close them because it would damage the economy. I remember the tension in that scene, it was incredible. What was the name of the island again, where the movie is set?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:41:12.234Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Amity Island!  Such an odd name.  Reminded me of \"calamity\" island.  Overall, w\nhat did you think of the protagonist?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:43:36.718Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Don't even remember his name, but he was great. Remember when there was that calamity on the beach and he finally convinced that idiot mayor to hire the shark hunter? He was probably afraid because he was charging some crazy amount for his services.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:46:24.788Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Haha, probably.  That mayor was an idiot.  The whole movie could have ended in ten minutes if he hadn't refused to close the beaches.  It was a little unrealistic and convenient that beaches were full of tourists though on that particular weekend of the shark attack.", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:49:21.309Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Why were all those tourists on the beach anyway? Was there some kind of holiday?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:49:38.568Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh yeah! It was Forth of July, duh.  Did someone die in that scene?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:50:05.555Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, it killed a boater. Also the chief's son went into shock. Let's talk about the ending. What did you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:50:48.303Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Mixed feelings! I really liked the tension when they were all in the boat hunting the shark.  Did you like any particular scenes at the ending?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:51:46.931Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, can't talk about the ending without mentioning how he kills the shark. I wonder who came up with shooting a scuba tank in it's mouth. It was spectacular", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:52:31.114Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Haha, right?  But when the whole thing exploded I knew he was a goner.  What did you think about what happened to Quint?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:53:37.339Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Perfect ending for that character. The actor's name escapes me, but he pulls off that grizzled sailor thing so well.", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:54:40.266Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Who survives at the end? Did they all die?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:55:57.180Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Definitely.  Did you think the ending was appropriately suspenseful?", 
      "uid": "user2", 
      "utcTimestamp": "2018-01-30T21:55:57.964Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I was on the edge of my seat the whole time. Who survives til the end? Did they all die?", 
      "uid": "user1", 
      "utcTimestamp": "2018-01-30T21:56:17.974Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-01-30T21:16:27.789Z", 
  "uid1LogOutTime": "2018-01-30T21:56:21.373Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-01-30T21:16:27.810Z", 
  "uid2LogOutTime": "2018-01-30T21:56:25.559Z", 
  "uid2response": {
    "feedback": "Document was understandable, but it was very hard to have a conversation just based on information from a document, and not add my own opinions to it (like go off on tangents about the lack of female characters in Hollywood or the sensationalism of violence, etc etc).  The other person definitely had watched the movie and I had not, which made the conversation very awkward.  I had to keep re-reading details to remember the names of the characters or what the heck happened.  I found the descriptions of the scenes very dry and hard to picture.  Also, the other person's comment about seeing the movie \"20 years ago\" it was clear the other person was much older than me.  Made talking awkward as they didn't engage in a more relaxed conversational style of young adults, lol, jk, u know?", 
    "response": [
      1, 
      2, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1776", 
  "user2_id": "USR292", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 2
}