{
  "date": "2018-03-01T20:11:05.712Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "What is the movie title ?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:13:18.507Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hi,\n\nThe movie title is the Blind Side. Are you a big fan of Sandra Bullock's?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:13:39.955Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes I love her , she is a good actor .", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:14:24.824Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That's awesome! She plays a starring role in this film and received pretty high accolades for the film. Does a movie about a football player interest you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:15:00.150Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Depending on what else the movie is about . I am not huge into sports but very open minded when it comes to movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:16:04.441Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well, this is a biographical drama film about Michael Oher who went on to play for the Baltimore Ravens in the NFL. To that end, it explores issues related to his humble upbringings.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:17:10.674Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The film also scored an A+ from CinemaScore and some decent ratings from Rotten Tomatoes and Metacritic as well.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:17:52.860Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sounds like a very inspirational movie, I would be interested in watching , would you give it a good ratings based off what you know.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:18:27.401Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I've seen the movie before, and personally, I believe it to be a really inspirational film. However, according to the information I have assuming I hadn't seen it, I would absolutely be interested in exploring it. It takes place not too far away from the area in which I grew up, and from the information here, there are some really interesting actors in addition to Sandra Bullock such as Tim McGraw.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:20:39.033Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Some really strong source material also helps to support the quality of the film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:21:27.735Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I am a fan of Tim McGraw as well, sounds to me like it would be movie worth watching. I live inspirational films , is it based off a true story ?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:22:17.014Z"
    }, 
    {
      "docIdx": 1, 
      "text": "*love , *story ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:23:22.658Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes it is. Also, the player's (Michael Oher) mother deals with some drug issues and a lot of it revolves around him overcoming this problem. I always personally liked these types of stories, but given its realism, it strikes an even deeper chord.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:24:29.240Z"
    }, 
    {
      "docIdx": 1, 
      "text": "To give a little more background on the film, Mike receives an offer from Burt Cotton, the coach at a local christian school, to enroll along with a friend of his at the request of his friend's father. This gives Mike the opportunity to demonstrate his size and athleticism as an offensive lineman.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:26:46.753Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Well I can relate to alot of hardships explained by you in this movie , that's probably why I like movies like this on so much. When I watch a movie as you described , going through hardships and troubles and over coming them as it relates to real life hits home and I can appreciate them more. Even if it has sports involved, the extra determination I'm sure it possibly brings would be an over powering movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:27:04.989Z"
    }, 
    {
      "docIdx": 1, 
      "text": "And that", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:27:21.932Z"
    }, 
    {
      "docIdx": 1, 
      "text": "And that's absolutely the core thing here. It very much revolves around the drama of Michael's life growing up and demonstrating his potential.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:27:57.055Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Have you heard of John Lee Hancock before?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:28:15.668Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Which I believe makes for an awesome movie plot,  and no I  am not familiar with him ?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:28:39.330Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I honestly hadn't heard of him myself, but he is the director for this film. It might be worth exploring some of the other films he has worked on, especially given his success with this movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:29:57.437Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well based on the information you have given the movie is worth watching and John Lee Hancock sounds like he knows what he's doing , I will have to check him out on rotten tomatoes as well to see the other movies he has directed a, to see if his other movies sound as good as this one ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:31:23.974Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Some other issues that come about include problems around discrimination given Michael's background. Sandra Bullock has to stand up for Michael as others think that he is a danger to be around. In addition, Mike has to overcome some issues with his grades and getting his GPA up so he can play at college.\n\nAnd absolutely!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:32:27.513Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Is there anything else that you might be wondering about this film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:32:39.604Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Problems about discrimination? What race/ethnicity is Michael, and why do others see him as a threat to be around ?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:34:08.775Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well, I can't tell what race Michael might be from the documents that I have, but the reason that he is viewed as a threat by some involves the fact that he is living in Leigh Anne Tuohy's (Sandra Bullock's character), who also has a son Collin, house. Given Mike's tough background and build, some see him as a threat.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:37:45.915Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Leigh Anne rebukes them though, and as such, serves as a loving guardian for him as he grows up.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:38:30.332Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Given what I've told you about the film, do you think that the movie is deserving of praise?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:39:17.400Z"
    }, 
    {
      "docIdx": 2, 
      "text": "And what about it do you think is praiseworthy?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:39:28.803Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh okay, I suppose I'll just have to watch the movie to find out! Thank you for your information about this movie , and yes I think this movie would be praiseworthy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:39:54.339Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Praiseworthy would be a movie that that deserved praise in all aspects , the directors , actors , and anyone involved who has made this movie great and worth it , I have not even see it and I already love and respect the plot.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:41:39.493Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Great!\n\nA few more thoughts on the movie. He eventually finds his biological mother in a place called Hurt Village. Although he is welcomed back by gang members initially, they threaten him and his adopted family. He defends himself physically and his family's reputation. After questioning Leigh Anne, he eventually ends up at Ole Miss and has to say his farewells to the Tuohy family.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:43:49.995Z"
    }, 
    {
      "docIdx": 3, 
      "text": "There seems to be quite a tear jerker here if you're into that sort of thing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:44:13.885Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Notably, the Tuohy family went to school there, which assumingly heavily influenced Mike's decision.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:45:13.537Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sadly yes , tear jerker movies are the best, although I hate it because most of the time i cry , but when a movie is so powerful and full of emotion you just can't help but to let the tears come out .", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:45:27.721Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Absolutely! I like my drama with a little action/suspense as well, so while it's sad in a way that Michael had to face this, it makes for a much more interesting movie when he has to confront the gang issues.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:46:37.795Z"
    }, 
    {
      "docIdx": 3, 
      "text": " Do you think Was Michael was easily influenced by the family, and felt obligated to fall into their footsteps ? And yes especially with that , sounds like he was put into a tough position , but it sounds like the family that took him in was concerned for his well being in general , he was just trying to do the same by protecting them.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T20:48:11.385Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm sure they had some pretty strong influences, but seeing as how they had to protect him and lead him to a better life, these influences were probably a good thing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T20:48:57.738Z"
    }
  ], 
  "rating": 2, 
  "status": 1, 
  "uid1LogInTime": "2018-03-01T20:11:05.712Z", 
  "uid1LogOutTime": "2018-03-01T20:48:59.426Z", 
  "uid1response": {
    "feedback": "A little bit of an awkward discussion as I was trying not use my own knowledge of the film. Figuring out the best ways to present information and not jump around too much could have been easier.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-01T20:11:05.731Z", 
  "uid2LogOutTime": "2018-03-01T20:48:31.139Z", 
  "uid2response": {
    "feedback": "Me decision was not hard. The other user was very informative on the movie , it's background and the directors and actors in the movie. Even told me about the ratings on rotten tomatoes website. ", 
    "response": [
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR670", 
  "user2_id": "USR977", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 18
}