{
  "date": "2018-02-08T21:42:05.809Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello! What did you think about the movie Inception? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:43:38.574Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think it sounds pretty interesting. The idea of planting thoughts is pretty unnerving! How about you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:44:33.488Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really liked it, honestly probably one of the most unique movies I've ever seen. Leonardo Dicaprio was amazing in it!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:46:02.230Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is a pretty unique concept to be able to get information from others through their thoughts. Kind of creepy, but sounds intriguing at the same time! What did you think of the performance by Ellen Page?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:48:30.933Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree, it is very intriguing. I thought Ellen Page did great as well. She created the dream areas, which were very fascinating. I actually didn't know before this that Christopher Nolan was the director. I'm not surprised though because of how good and iconic he is. Did you know that?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:51:05.001Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No, I didn’t. I have actually never seen the movie, but it sounds good, so I might have to check it out. I like other movies Ellen Page is in, so not surprising she did well!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:53:13.723Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I would highly suggest it then, if you haven't. I thought everyone had seen it already! LOL... Yeah if you like her then you'd really enjoy it because she definitely played a very big and important main character role.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:54:40.750Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely! It looks like it got great reviews on rotten tomatoes- 86% is impressive! They are usually pretty accurate!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T21:56:22.506Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It did get really good reviews. And the 8.8/10 on IMDB is impressive too. \nI don't agree with the final review in that document though, so don't pay attention to that one. Must be a really negative critic. People definitely raved about it for a reason! This person didn't know what they were talking about.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T21:57:30.636Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah even the best of movies get a little bit of negative feedback sometimes. You can’t please them all! I did like the review that said they wished it was weirder! It sounds plenty weird to me! (In an interesting way!)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:00:07.212Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You're right... Ah, the document has changed. Yeah it was an interesting concept of the kicks to wake people up. They were like the trigger to get them out of a dream. You'd have to see it to understand more fully, I think. It was trippy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:03:18.746Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Wow, that sounds complicated! The shared dreams and someone having to stay behind! And the limbo that is nearly impossible to get out of is pretty intense!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:05:41.180Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yup it did get really complicated and deep, like how it describes of the dream levels and multi-level dreams, that means it eventually turns into like dreams within dreams and the kicks get them out of one dream and into the next. Like waking up and you're still dreaming. That's actually happened to me before. You think you wake up but you're actually still dreaming. Has that ever happened to you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:07:26.682Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Not really like that, but I have definitely had vivid dreams where it seemed very real and I was shocked when I woke up! That is crazy that the time goes much faster in each dream afterwards.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:10:29.746Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, like time gets warped... it is a dangerous mission to go through all those levels and maintain sanity, like how it says risking forgetting you're in a dream. That's why it's so intense because they have to be so mentally strong to deal with all the changes of consciousness", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:14:15.375Z"
    }, 
    {
      "docIdx": 2, 
      "text": "For sure. Sounds almost like a video game, beating different levels. And needing to remember what you are doing and why you are doing it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:15:41.069Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Something like that! Yeah there is also a twisted love story... Between Cobb and Mal (they were husband and wife) but yeah they spent 50 years in a dream in only a few hours of time. Can you imagine, it feeling like 50 years has passed in only a few hours! Crazy stuff!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:18:50.177Z"
    }, 
    {
      "docIdx": 2, 
      "text": "(I think they were husband and wife, at least. Cant remember exactly.)", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:19:16.818Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can’t imagine! And then she committed suicide because she thought she was still in a dream! That turned pretty serious in a hurry! Sounds pretty sad!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:20:14.554Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah it was really sad, like tragic even... She really believed it and then tried to force Cobb to do the same. He must have had a really hard life to have to go through all of that. I can't even imagine either how mentally messed up that would be", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:22:22.872Z"
    }, 
    {
      "docIdx": 2, 
      "text": "For sure! That would be really traumatizing to watch someone go through that and not be able to help them. And even worse because she framed him for it in her fragile state of mind!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:23:50.269Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Exactly. I think after 50 years in a dream world anybody would kind of lose their sanity when returning back to reality though so you definitely feel for her, and him too, especially after having to abandon his children because of everything. That's so heart wrenching.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:26:25.733Z"
    }, 
    {
      "docIdx": 2, 
      "text": "So he lost the love of his life and his kids.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:26:41.367Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It is really devestating! I can’t imagine feeling like 50 years had passed! That would be a lot for anyone to wrap their head around.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:27:33.062Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wow, and it sounds like a pretty wild ending left pretty open-ended!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:29:35.598Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah I'm 28 years old so that is like, close to twice the time that I've even lived! Totally bizarre. And yes the ending was left wide open to where you have no clue if he's dreaming or back in reality. Spoiler alert!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:30:53.834Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You should still watch it though, even though you now know what happens. It's well worth it, and seeing it is much better than just reading about it", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:31:32.861Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wow, that is a way to end it! He probably doesn’t want to know at that point. And I definitely want to check it out. Always good to see things live and how things unfold.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:32:17.742Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Always makes you curious when they end movies like that though! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:33:09.573Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah all he cared about was his kids. There was much discussion about the ending and how the top kept spinning. There is a small further twist at the end that isn't in the document but I won't reveal it :-) ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:34:30.311Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sounds good! I will check it out and find out! It was interesting chatting about the movie!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T22:35:13.450Z"
    }, 
    {
      "docIdx": 3, 
      "text": "We aren't supposed to share information that isn't in it, anyways. So yeah just know there's a tiny piece that suggests the whole controversy about if its his dream vs reality at the end", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:35:35.632Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes it was. Thanks for chatting with me, and yeah it was interesting to re-visit this movie. It was definitely one of a kind and I hope you watch it someday!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T22:36:15.948Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-08T21:42:05.809Z", 
  "uid1LogOutTime": "2018-02-08T22:36:05.710Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-08T21:42:05.855Z", 
  "uid2LogOutTime": "2018-02-08T22:36:28.324Z", 
  "uid2response": {
    "feedback": "That was an interesting and fun task, and the person I chatted with was very friendly. I highly enjoyed revisiting such a good movie!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4403", 
  "user2_id": "USR487", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 5
}