{
  "date": "2018-02-09T17:56:27.822Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "It's too bad that they took so many liberties with Turing's story, because the real story is so fascinating. Nonetheless, ythe movie is very well made and very entertaining. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T17:59:12.413Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree, it was beautifully written and well performed.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:00:09.551Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Cumberbatch especially was amazing as Turing.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:00:33.439Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you generally like to watch historical drams?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:00:55.664Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I had never seen Benedict Cumberbach before and thought he was particularly good at playing Turing and caught both the oddness of the scientist and also the tragedy of a gay man caught in a time when his homosexuality was still a crime. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:01:52.033Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I do like watching historical dramas. I went to a very bad private high school so my sense of history is very spotty. seeing movies like this help to fill in a lot of the gaps in my knowledge!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:03:05.611Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I also thought the films was exceptionally well made inn terms of technique: cinematography, direction, script, etc. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:04:47.064Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely. If you wanted to know more about Turing, it might be good to read the biography the movie was based on.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:05:39.188Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely. I used to work for a woman who was one of the inventors of the ADA programming language and she told me many fascinating stories about Turning. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:06:40.238Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That's really cool. If you want to find the book it's called Alan Turing: The Enigma, it's written by Andrew Hodges. I believe it was also made into a play.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:07:29.693Z"
    }, 
    {
      "docIdx": 0, 
      "text": "And I must say that Keira Knightly was not only a very attractive presence in the movie but also gave a very good performance!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:08:50.729Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Who did she play again? I forgot. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:09:26.027Z"
    }, 
    {
      "docIdx": 1, 
      "text": "She was the young woman who applied to work in the lab and then blew them away with her performance on the entry test. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:10:12.135Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It was really sad to see Christopher Morcom die so suddenly from tuberculosis. That scene was so hearbreaking. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:13:26.459Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Indeed. Hard to believe the movie was from 2014. Seems like I just saw it. When you are 60 years old, time seems to move so fast!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:18:05.387Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, it got really good ratings though, some might even call it an \"instant classic\" so it just feels timeless.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:19:24.772Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Plus the work done at Bletchley Park is always going to be fascinating. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:19:45.858Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes. I was recently reading that the actress Hedy Lamarr was actually one of the people who helped the U.S. crack the German codes. Fascinating! What a time to have lived in. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:21:24.093Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It must have been. I really liked how clever Turing was, not just in decoding but understanding that they cannot act on every decoded message or else the Germans would know that their codes were being broken.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:24:17.903Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Those scenes really showed the filmmakers art. You could feel your pulse quickening as they were getting closer to breaking the code and you felt every disappointment when they failed. You really felt you were in the Park with them, a crucial participant in this historic moment. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:26:28.434Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Agreed! I couldn't believe how close Christopher was to being destroyed by Denniston. If it weren't for all the other cryptographers, Turing and his machine would be gone. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:27:34.047Z"
    }, 
    {
      "docIdx": 2, 
      "text": "And we must comment on the ultimate tragedy of Turing life. Like so many other homosexuals in England at the time, it must have been unbearable having to hide who they were and worrying about revealing too much of themselves. It's not surprising so many of them died so tragically. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:29:14.711Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, it must have been very difficult. I mean he is outright told to hide it, and he really only\n marries Clarke to keep her there since her parents wanted her to leave.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:31:12.245Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, the marriage of convenience. What a strange custom. But, of course, it still goes on. I know of several  in my town!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:33:04.871Z"
    }, 
    {
      "docIdx": 3, 
      "text": "But of course Caimcross, the man who told him to hide his secret has a secret of his own! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:33:58.352Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you know if the director has gone on to do anything else?  I'm not familiar with the name. What was Caimcross's secret? i don't remember.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:34:51.148Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Caimcross was a Soviet spy. And when Turing confronts him on it, he threatens to reveal that Turing is a homosexual. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:35:26.999Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't know what else the director has done unfortunately.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:35:40.096Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Ah, that's right. Thank you!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:35:53.918Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm not sure what else I have to say about the film. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:38:39.092Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, do you usually watch movies with high critical ratings or do you generally not care? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:41:13.846Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It got a score of 91% on Rotten Tomatoes.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:41:40.785Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Which is pretty good, if i must say so!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:41:59.410Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, I generally look at the reviews in the New York Times, but I also go by my own instincts. We have a very good 8-screen independent cinema in our city so I get to see a lot of films that wouldn't show up at the regular chains. Plus my wife and I go to a week-long film festival held in Chatham, NY in October. That's where I saw this film. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:44:19.505Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Been great talking movies with you!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:46:23.151Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-09T17:56:27.822Z", 
  "uid1LogOutTime": "2018-02-09T18:47:02.416Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-09T17:56:27.901Z", 
  "uid2LogOutTime": "2018-02-09T18:43:05.539Z", 
  "uid2response": {
    "feedback": "My partner kept bringing up information not contained in the document. I tried to steer it best I could, but he didn't seem to understand the task at hand. I also made a few typos, Caimcross should be \"Cairncross.\"", 
    "response": [
      1, 
      2, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1808", 
  "user2_id": "USR368", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 1
}