{
  "date": "2018-03-16T22:37:55.330Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:38:16.957Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:38:38.559Z"
    }, 
    {
      "docIdx": 0, 
      "text": "So what do you think about The Social Network?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:39:13.260Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sounds like an interesting movie given how popular Facebook has become", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:39:20.250Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree. I know there's some controversy surrounding Mark Zuckerberg so I think it would be interesting to see what actually happened behind the scenes.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:40:15.162Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Absolutely! Especially since no Facebook staff were involved but Zuck's past business partner was", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:40:57.246Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can't imagine it would portray Zuck in a good light", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:41:06.354Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's crazy to think how much bigger Facebook is now than it was when this movie came out... And it must have been pretty big back then too, they don't make movies on just anything.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:42:52.463Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes! facebook is everywhere; I feel like it's embedded in every website I use.  I wonder if there may end up being a similar movies about the company in the future", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:44:15.799Z"
    }, 
    {
      "docIdx": 0, 
      "text": "People love an expose", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:44:24.789Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That would be interesting. The first movie focused on the startup and social media aspect of it. It's so much more than just a social media now. They could make an entire new movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:45:45.436Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Imagine being 19 years old and your girlfriend breaking up with you. Poor little Mark probably thought his life was over at that point. Little did he know it would be the best thing to ever happen to him", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:47:31.915Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Seriously! I wonder if it would another movie that David Fincher would want to work on since he directed \"the social network\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:47:33.612Z"
    }, 
    {
      "docIdx": 1, 
      "text": "hahaha not many people imagine their life is over after a break up and then go on to become one of the most famous people in the world", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:48:31.204Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I bet Erica Albright is pretty upset with her decision to dump Mr. Billionaire. I wonder if she tried to get some of the money from him after she saw how successful he was becoming.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:50:10.609Z"
    }, 
    {
      "docIdx": 1, 
      "text": "hahah maybe? though if she dumped him because he sucked as  a boyfriend before he struck it rich, he might have only gotten worse", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:52:24.179Z"
    }, 
    {
      "docIdx": 1, 
      "text": "the stealing photos to rate female peers' attractiveness sounds skeevy", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:52:54.249Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I feel like that's the more likely scenario. You stole the thoughts from me before I could type it out. Now I know why I never knew how Facebook started. I guess they don't want people knowing that one of the most influential people alive right now stole pictures from college females.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:54:31.218Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Good decision by them to drop \"the\" from the original name \"theFacebook\". Facebook is much more catchy.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:56:24.979Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes! It's way catchy. the \"the\" in the title seems so clunky now", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:57:02.211Z"
    }, 
    {
      "docIdx": 2, 
      "text": "funny that they brought their idea to the founder of Napster for advice", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:57:34.133Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I thought it was pretty funny how the Napster co-founder helped him get started and now Napster is basically obsolete.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:58:04.346Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's now the second time we've done that lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T22:58:36.068Z"
    }, 
    {
      "docIdx": 3, 
      "text": "hahah", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T22:58:42.802Z"
    }, 
    {
      "docIdx": 3, 
      "text": "and not surprising that zuck started facebook based on stealing pictures and would later get sued by his business partners for stealing their ideas and trying to cut them out", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T23:00:21.078Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The newest paragraph confirms my suspicion that people did not and DO not like Mark Zuckerberg... \"Zuckerberg's own callous attitude will make him highly unsympathetic to a jury.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T23:00:37.845Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeahhhh, it's a bad sign if a jury's gonna find you \"highly unsympathetic\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T23:01:05.781Z"
    }, 
    {
      "docIdx": 3, 
      "text": "made sense to settle with saverin", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T23:01:36.265Z"
    }, 
    {
      "docIdx": 3, 
      "text": "though it doesn't say what happened with the winkelvoss twins", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T23:01:55.918Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So what I've learned today is when a college kid becomes a millionaire, he turns into an ass. I agree though, smart settlement. Especially when you consider that was most likely before he was the untouchable billionaire he is today.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T23:03:10.990Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Facebook seems so innocent and simple but when you find out how it really came to be it's quite the opposite.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T23:03:50.297Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah, it sounds like too much money too fast made him feel like he could do whatever he wanted", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T23:04:23.841Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The part that said he sent his ex a friend request on facebook to me shows he's still harboring something against her. Like, what other possible reason could he have for sending her a friend request other than wanting her to be like \"Oh look, it's Mark sending me a friend request on the fortune 500 company he now owns. Shoulda stayed with him.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T23:08:05.984Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yup! i could definitely see him wanting to show himself off to her", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T23:09:10.321Z"
    }, 
    {
      "docIdx": 3, 
      "text": "and the furiously refreshing every few seconds to see if she had accepted seems like a lot", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T23:09:30.713Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It seems almost obsessive to me, and pretty petty. If I was as successful as him, and ex would be the last thing on my mind. Lions don't loose sleep over the opinion of sheep.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T23:11:23.055Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-16T22:37:55.330Z", 
  "uid1LogOutTime": "2018-03-16T23:11:55.839Z", 
  "uid1response": {
    "feedback": "Very strange HIT, but it was different so I enjoyed it. Perhaps adding a typing indicator would make the experience better. That way you don't feel like you are sitting there with nobody on the other side of the screen.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-16T22:37:55.374Z", 
  "uid2LogOutTime": "2018-03-16T23:11:05.326Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4361", 
  "user2_id": "USR1094", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 17
}