{
  "date": "2018-03-26T15:07:15.251Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello! Have you watched the Home Alone movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:08:03.006Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have!  I thought the Slapstick humor was well placed", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:08:22.530Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm surprised to see that critics felt that the first half was \"flat and unsurprising\"! I felt it was really well done and set up the second half perfectly.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:08:58.766Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think the adult-bashing was my favorite part!  I am also surprised the first half was considered flat.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:09:48.637Z"
    }, 
    {
      "docIdx": 0, 
      "text": "lol :) I am really kind of surprised that the Rotten Tomatoes score isn't better. Home Alone seems almost like a classic part of American culture at this Point. :) ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:10:30.864Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh I totally agree and I thought Macaulay Culkin was the perfect kid for the part.  He wanted to be alone so bad then that happened :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:11:19.071Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, he was perfect for the part! An iconic role for him. ;) ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:11:56.945Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's funny that the plot was criticized as being implausible. Of course it's implausible. :D", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:12:18.284Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree with the CinemaScore of A.  I would give it an A easily!  It does NOT seem like that was from 1990.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:12:21.449Z"
    }, 
    {
      "docIdx": 0, 
      "text": "For sure, it's hard to believe it's been that long!!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:12:36.858Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I thought the special effects was perfect.  I can not imagine it any other way!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:14:21.508Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The beginning of the movie, where all the cousins are gathered and the house is in chaos, seems so typical of some holiday gatherings. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:16:11.826Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do remember Kevin being ridiculed by his siblings and cousins and it seems like my family time.  total Chaos for us also. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:16:40.072Z"
    }, 
    {
      "docIdx": 1, 
      "text": "And then all the confusion after everyone overslept. Perfect way to identify with people, I mean that's how it is when everyone is together eating and stuff, its exhausting! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:17:47.948Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I can totally relate.  When it finally gets quiet everyone just wants it to stay quiet.  I can not imagine trying to keep tabs on all the people and kids they were trying to account for in the movie.  Confusion is putting it mildly.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:18:44.771Z"
    }, 
    {
      "docIdx": 1, 
      "text": ":D Yes, and added to that, the storm in the night and the damaged power lines... if something bad is gonna happen, it's gonna be when the house is jam packed with people. :D ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:19:49.203Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I thought the burglars were played perfectly by Joe Pesci and Daniel Stern.  I can not imagine any one else playing them any better.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:22:02.016Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh my, for sure!! They played off each other perfectly. And they did a great job, it was painful to watch their misadventures!!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:22:53.540Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can not imagine being midflight and figuring out that you have left something, especailly a kid at back and not being able to do a thing about it!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:25:38.214Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, I was just thinking of that... how Mom-like of her to leave everything and go back for the one missing little chick. ;)", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:26:39.586Z"
    }, 
    {
      "docIdx": 2, 
      "text": "And when you finally land and can figure out something you get half way then to  find out that everything is booked and you can still do nothing.  I could totally relate to that on a level.  Pure Stress.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:27:09.240Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh man, it puts a whole new light on holiday stress. It's a good thing Gus Polinski and his traveling polka band came to the rescue!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:27:50.721Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yes!  Being completely stressed and then having your saving grace being a polka band in a moving van", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:29:37.597Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What a noisy road trip that would be! :) ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:30:39.692Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The booby traps were epic!  The injuries were exactly what you would expect a kid to make up if this actually happened.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:30:55.743Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh man, yes... when my son watched it as a child, I was almost afraid he'd try some of that stuff.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:33:02.927Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Running around the house and doing the kid stuff that the adults won't even think of was the best!  I forgot about the snow shovel to knock them out.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:34:30.733Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Me too. And how satisfying when they were finally arrested!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:35:00.969Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh thats right they flooded the houses to cover it all up!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:35:31.462Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Buzz always picking on him when they get home.  back to the real world and running from them all!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:36:17.623Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's amazing that Kevin could keep quiet about all his escapades, and not let the family in on his ingenuity!!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:36:53.255Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-26T15:07:15.251Z", 
  "uid1LogOutTime": "2018-03-26T15:36:45.931Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-26T15:07:15.263Z", 
  "uid2LogOutTime": "2018-03-26T15:37:03.389Z", 
  "uid2response": {
    "feedback": "Interesting! I stayed in the chat room until the other user left the chat. ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3348", 
  "user2_id": "USR4309", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 20
}