{
  "date": "2018-02-06T19:51:54.701Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "This movie seems to have landed in the top 20% rating wise", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T19:53:04.868Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you generally watch movies with good or bad ratings? Does it bother you if it's reviewed by something like rotten tomatoes?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T19:53:22.879Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sometimes I will base if im willing to pay the theater price that way. How about you? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T19:54:34.732Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes. I will use rotten tomatoes as a guide reference. I enjoyed the Avengers. It was a great action movie with so many different types of superheroes and conflicting personalities working together as a team. Did you like this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T19:55:59.500Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did enjoy the movie.I too am a fan of the action and superhero genre, it was a driving force in why I choose to see it. Do thing like who directed it really influence your willingness to see it? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T19:57:14.093Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No, not really. I mainly look at the trailer to see if it's great. Some times directors are hit or miss for me so I've come to stop relying on it. Did you like Chris Evan's performance as Captain America?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T19:58:22.298Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did enjoy his performance I thought it was incredible, how did you feel about the overall choice in cast? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T19:59:16.824Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Everyone seemed to fit into their characters well and played it well", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T19:59:38.754Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree, I felt that Scarlett Johannson really stood out in her role as well.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:00:29.230Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Honestly for me, the one that shone through most was Chris Evans. I could not imagine anyone else being Captain America.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:01:09.549Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He really did nail that role, and the stand alone Captain America movies are an awesome series as well. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:01:44.351Z"
    }, 
    {
      "docIdx": 1, 
      "text": "How do you feel about Disney owning the rights to the Marvel universe? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:03:29.232Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I hope Disney doesn't mess it up as owners. I know that can happen. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:04:22.819Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree fully, do you often look at who is involved in distribution? is that ever a deal breaker for you? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:05:04.002Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Not really. I'm not extremely involved in the behind the scenes of movies. Did you enjoy the presence of Phil Coulson?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:05:41.651Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I did, however not as much as Samuel L. Jackson. Were you overall impressed with the cast selection?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:06:34.865Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, I was. Like I stated earlier, everyone seemed suitable for the character they were cast to play. I think Samuel L. Jackson commanded well and was intimidating in a sense and exuded a great \"director of \"S.H.I.E.L.D.\" aura.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:07:47.564Z"
    }, 
    {
      "docIdx": 2, 
      "text": "How did you feel during the scene when the wormhole opened? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:09:10.440Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Shocked! But my wonderment is why Loki didn't just take the Tesseract for himself if it was that easy to steal from Earth", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:09:55.077Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Agreed. Did you enjoy the attack on the Helicarrier? I found it to be exciting and action packed. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:10:52.866Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was definitely exciting. Hulk is so unpredictable you just don't know what you're going to get with him", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:12:07.889Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Did you agree that it was right or wrong for Fury to use Coulson's death as motivation for the Avengers?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:12:58.733Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Did you find the ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:13:18.641Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I dont think so, sometimes you have to motivate in unusual ways. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:13:45.938Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you think the actions of the World Security Council were warrented? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:14:33.463Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't believe so. When you are controlling a team of superheroes like Nick Fury did, it's either allowing him to control them fully or not at all. Any type of intervention just complicated matters and distracted them from the objective at hand. What do you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:15:23.796Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree fully, if the plan had been to use state resources then why bother making a team of super friends? Do you think the Avengers will come through again when needed? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:16:57.902Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm not sure but did you think their teamwork was as good as it could have been with Stark diverting the missile while Hulk saves him and Hulk and Thor taking care of Loki? Do you think it could have been better? How so?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:18:05.235Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think its and all is well that ends well situation. Id imagine its pretty hard to think on your feet while saving the world. How about you? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:19:26.765Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, I believe they handled it surprisingly smooth for being paired up for the first time", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:20:22.944Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you think things like team dynamic matter in the Marvel Universe? Like do they have an HR? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T20:21:08.005Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They must have some type of internal coordinator all those types of things but I'm not sure. Wouldn't that be Nick Fury?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T20:22:10.163Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-06T19:51:54.701Z", 
  "uid1LogOutTime": "2018-02-06T20:21:57.716Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-06T19:51:54.732Z", 
  "uid2LogOutTime": "2018-02-06T20:22:13.975Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4865", 
  "user2_id": "USR3220", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 7
}