{
  "date": "2018-02-12T19:09:06.758Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi.  I'm going to read this and be back.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:09:41.753Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello. I am reading it too (:", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:10:18.007Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Okay done.  We are reading the same description, right?  About La la Land?  Musicals are my least favorite type of film so I can not say that I am excited about it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:11:59.179Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes we are. I see. Most of the reviews are positive but there are two negative reviews. Do you think this movie is different from ordinary musicals though, given all the themes the movie touches on?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:13:11.333Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Although it does not sound like your standard musical since it is trying to be an \"idiom for being out of touch with reality.\"  So that makes it a little more interesting.  Still though when people break into song in a movie I want to turn it off.  Oh just saw what you wrote.  Yes it sounds a bit different.  Would you want to see this based on the description?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:13:43.148Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It does seem a little cheesy and I am a little put off by the comment that \"Sebastian is a jazz snob and Mia's character lacks depth.\" However, since it appears to be\n different from  other movies and since I generally like Emma Stone as an actress, I may check it out.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:15:12.825Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Emma Stone's character being described as lacking depth is another big turn-off for me.  Too man one dimensional female characters in Hollywood films for my taste.  I agree she is a good actress.  It is does slow up in the middle, like the one review said, I definitely could see myself getting bored with it.  What else has Emma Stone been in that you enjoyed?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:16:24.437Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I forgot the name of the first movie she came out with, something about \"A\", a high school girl. I thought she was hilarious.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:17:48.028Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I saw that.  Agreed!  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:18:04.204Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am not familiar with the director, Damien Chazelle.  Have you heard of them?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:18:06.455Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I have not. I actually rarely pay attention to director names so I wouldn't recognize his name anyway. What do you think about how this movie discusses the \"bittersweet happiness of treasuring things that are vanishing\" in LA? Do you like the social commentary?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:19:36.069Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes I like social commentary very much.  If it is just one note, fluff it doesn't interest me as much.  How about you?  I always forget, with the Rotten Tomatoes score is higher better or worse?  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:20:40.888Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm not sure about the Rotten Tomatoes score. I agree with you on fluff. Okay so in the \"Key Scene 1\" box Sebastian is definitely coming across as a snob as he refers to Mia's song request as \"an insult for 'a serious musician'.\" I feel like he thinks he's above her and everyone else.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:22:21.712Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah I could see that.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:23:51.712Z"
    }, 
    {
      "docIdx": 1, 
      "text": "How many scenes are they giving us?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:24:49.140Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I am curious as to what the quality of the song numbers are. Without the plot, I feel as though the songs may be good based on the detailed descriptions here. I think they're giving us 3-5 scenes.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:25:12.147Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do not know what \"black musical genre\" is, mentioned in the reviews.  Do you have any idea?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:26:12.406Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Hmmm that seems kind of politically incorrect. I'm assuming jazz and blues perhaps? I think it's ironic that a Caucasian male is the \"seemingly only person who can accomplish such a goal\" of saving the \"black musical genre from extinction\". ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:27:42.989Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The plot is getting a little more interesting. Sebastian seems like a cynic but his character is developing here as he takes this job for Mia despite the fact that he dislikes it. I am starting to like his character more.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:29:33.262Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I feel like this is made by people in the business for people in the movie or music business, neither which I have any interest in.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:30:37.708Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes it definitely does seem like an art project / someone's creative expression.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:31:13.661Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you think they end up together in the end?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:32:10.318Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I enjoy the fact that it is innovative. It may not be amazing but it's opened doors for development on a new artistic subgenre. Of course, I'm no expert to comment on that, it's just my understanding of it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:32:22.448Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think they probably do.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:32:30.659Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I can appreciate that.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:33:25.532Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Ah twist in scene 3.  Well I guess you have to have them fall apart so they eventually get back together on new terms.  Are there any other romance comedies that you enjoy?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:34:37.675Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Haha that's a good way to look at it. I'm not a huge fan of romance comedies because they're somewhat demeaning to women sometimes and very basic and predictable. However, I like romantic comedies that are extremely hilarious with actors who are know to be very hilarious though.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:36:23.615Z"
    }, 
    {
      "docIdx": 3, 
      "text": "How about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:36:46.737Z"
    }, 
    {
      "docIdx": 3, 
      "text": "known**", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:37:15.393Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Maybe some from the 80's out of nostalgia.  Yes agreed women are usually used as a prop.  Actually something I can not stand is when the characters fall in love because they are supposed to, but you can't actually see any value in either character or why they would even have a connection.  Sometimes it seems writers are just going through the motions.  But I guess thats why it is a business.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:38:21.092Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's a great insight into how the business works. I feel like scene 3 is dramatic in a way that you would see in a school play or a teen movie / disney movie. It doesn't represent real life relationship drama as well as something like Silver Linings Playbook.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:40:13.069Z"
    }, 
    {
      "docIdx": 3, 
      "text": "However there are still some interesting points they're touching on that could be applicable to many relationships. It's just cheesy with the whole band thing.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:41:03.359Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Haha agreed!  Yes band thing definitely makes it cheesy.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:41:24.133Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I've never heard of John Legend of Callie Hernandez.  Have you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:41:59.218Z"
    }, 
    {
      "docIdx": 3, 
      "text": "*of Callie", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:42:09.380Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Shoot I meant Or.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:42:15.328Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes John Legend is actually quite a unique artist in my opinion. You may have heard some of his songs at events / on the radio. He's an African American pianist with a unique voice. His music moves me and it's classical but modern at the same time.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:43:12.952Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He's married to the model Chrissy Teigen, not sure if you follow that kind of stuff haha.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:43:37.336Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think he's won Grammy's.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:43:51.859Z"
    }, 
    {
      "docIdx": 3, 
      "text": "LOL I really like him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:44:00.451Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Awesome!  Sounds cool.  I don't keep up with that stuff but I have heard her name before.  SO maybe the music in the movie is decent?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:44:31.056Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes I have full confidence in John (: I still think it's super weird that Ryan Gosling is the one \n\"saving\" African American music though. Maybe it's portrayed that way because he's in a position of power / privilege to do so and has a platform people will listen to more?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:45:49.499Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah that's always the way.  Like with Orange is the New Black.  If all of the actors were People of Color dumb ass Americans would not have given it the time of day.  I'm white by the way, I just know racism is everywhere.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:47:05.822Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I haven't seen Orange is the New Black (I really need to get on that) but I kind of know of the context because I studied it in a Feminism class. I think you're right. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:47:53.664Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm going to have to research this after because I really hope that is not the theme they are going for in this movie.  But I wouldn't be socked if it were.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:49:12.799Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Haha I think I may just end up watching this movie after. I'm curious.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:49:37.723Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm also making a lot of assumptions and I could be totally off hahah. Although I think we're making pretty solid insights.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:50:17.850Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sure.  I think we are done!  Take care!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:51:03.223Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yay. You too!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-12T19:51:10.240Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thanks!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-12T19:51:13.869Z"
    }
  ], 
  "rating": 2, 
  "status": 1, 
  "uid1LogInTime": "2018-02-12T19:09:06.758Z", 
  "uid1LogOutTime": "2018-02-12T19:51:15.893Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-12T19:09:06.819Z", 
  "uid2LogOutTime": "2018-02-12T19:51:14.196Z", 
  "uid2response": {
    "feedback": "That person felt like a friend by the end of the conversation. I actually surprisingly enjoyed this study way more than I thought I would. The conversation was genuinely fruitful!", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1841", 
  "user2_id": "USR580", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 3
}