{
  "date": "2018-02-16T12:16:28.739Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "How did you feel about the movie, \"Mean Girls\"?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:17:47.393Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I felt like it was a good comedy about a subject that is actually very serious - the cliques teen girls form in high school.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:18:34.557Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I liked it overall, and I feel like it's become almost a cult classic so to speak. I felt that Lindsey Lohan especially was doing some of her better acting then. Who was your favorite character?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:19:40.650Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think Lizzy Caplan as Janis Ian was great. Some of the other actresses also did a fine job, but were overlooked because of Lindsay Lohan.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:20:53.418Z"
    }, 
    {
      "docIdx": 0, 
      "text": "OMG YES I loved Janis, I don't feel she got as much credit as she should have! A close second for me was Gretchen, I just felt that she really played that high school drama queen part well! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:22:17.121Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really liked Gretchen, too! It probably helped a lot that Tina Fey wrote the screenplay. She's a very good writer.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:23:08.541Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree, but Janis I felt I could relate too a bit :) What was your favorite part? I'm actually surprised they picked a movie I know well, I was worried I was going to get stuck with one I wasn't sure of!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:24:04.925Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Excuse me, to*", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:24:13.589Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I never knew Tina Fey wrote the screenplay very interesting!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:24:56.802Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Really? The instructions stated we were not to talk about things we knew from personal knowledge, but from the information in their paragraph. There isn't much information here actually! LOL", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:25:43.725Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No there isn't!!! And I just noticed that Tina Fey's name is at the bottom, duh. Soooooo I guess my next question is do you agree with the rating? I feel like I mostly do, it surprised me for the genre", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:27:02.774Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's not a genre I'm really into. If I watch a teen movie it's probably one where they are being chased by a giant prehistoric alligator. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:27:57.153Z"
    }, 
    {
      "docIdx": 1, 
      "text": "HAHA I like horror too even though that'\ns way off topic and action and a little comedy and family because I have a small child! Back on topic, lol, have you heard of the director or do you have an opinion of him?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:29:08.227Z"
    }, 
    {
      "docIdx": 1, 
      "text": "His name doesn't ring a bell with me at all. The critics sure seemed to love it though. What a culture shock it would be to go from homeschooling in Africa to a suburban public high school.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:30:20.427Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It REALLY would be, they made that part pretty realistic I feel! How about the book? Have you ever heard of or read it? I have heard of it and thought about getting it because I'm a big reader - but I ended up not picking it up yet", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:31:51.862Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I haven't read it although if it came up available free somehow I would. I'll read anything. I wonder how it went from a serious self help book to a comedy? I mean, who got that spark? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:33:10.078Z"
    }, 
    {
      "docIdx": 1, 
      "text": "LOL I have no idea, I feel like it was partly to get the seriousness of bullying out there but turning it into a comedy kind of shot that out unfortunately ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:34:33.629Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well when something happens in your life you always get to choose to laugh about it or cry about it. Myself, I always think it's better to find a way to laugh it off if you can. I would imagine it's really theraputic if you were a victim of that kind of thing to be able to look back and see how ridiculous it all really was and move on. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:36:18.237Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree, I really fight for people who get bullied but I also want people to pick themselves up and empower themselves as I do that myself", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:37:08.986Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I see the next topic has arrived! Have you ever had that serious of a situation like this happen at your school? I don't think I've ever seen someone copy and throw papers all over the hallways but ... still lol. And we just talked about the culture shock. I feel like Cady learned a lesson to be with people who accept her instead of running for popularity", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:39:05.210Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I also believe karma works. So, when Regina gets hurt - that's karma. We don't always see it so clearly and obviously, of course. I don't really know if anything like that happened at my high school. By that point I was so thoroughly and completely ostracized they could have burnt the school down and I wouldn't have known a thing about it until I arrived for class the next day. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:40:16.834Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I had a different kind of childhood with a lot of real life drama such as my step-father's lengthy illness and death, my mother running a business in the 1960s and trying to \"cover\" it as his business (it was originally) because a woman, of course, can't run a business! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:42:19.388Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I unfortunately had some problems myself in childhood and I feel that this movie says alot about how women should empower and not undermine each other. And I HEAVILY believe in karma, I'm very spiritual. I feel that was a little much with her at the end of the movie with the spine break though! That was pretty serious", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:45:57.887Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah that's not a minor injury at all. I was sitting here thinking though and when I was in school, bullying wasn't even called that. It was just part of how things were and you were expected to figure out how to deal with it. As positive as I think it is that bullying is now considered a negative thing and something adults should step into, I also wonder if we are really preparing our children for the real world. If your boss is a bully, there isn't any higher authority. And I know there are cliques and politicking in any real office situation and if you don't know how to handle yourself you could lose your job or at least never have any upper mobility.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:48:31.973Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I was born in 91 and even when I was in school up until I hit high school it wasn't like that in my area, in middle and elementary school it was just the way it was also. I feel like the movie is pretty extreme in the bullying though, and I'm also glad it's considered negative. In the movie I don't feel Cady was prepared for the real world but I also don't feel many of the other characters were either", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:51:35.531Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Only because they did not handle situations in a professional and assertive manner, they went into an aggressive rage which is not the right way to do things in nearly any situation", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:52:23.678Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Exactly. I realize it is a comedy, but it is dealing with a serious matter. I also take issue with everyone apologizes and hugs it out and it's all over. Very sweet. Not very real. The girls in my high school were certainly perfectly capable of hugging you in front of the teacher while whispering threats in your ear. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T12:54:49.340Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes!! Exactly and I feel like that's whats going on here. And as far as Aaron and the spring fling and Cady and Regina in the movie there was alot of jealousy involved to the point where the revenge was the main goal..  I hope to see this further break down so that more positive behavior is shown in schools. I see in the text and remember all the revenge plots", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T12:56:48.368Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Again, I hope what people get from this movie is looking at that - all that jealousy and revenge and drama - and realize with a few years of perspective how truly unimportant any of it is in real life. I guess older people might see that. Do you think the teen audience really learns anything from it though?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:00:04.270Z"
    }, 
    {
      "docIdx": 3, 
      "text": "No I actually dont! I am 26 now and I see it in a much different light now. When I first saw it I didn't take it seriously, I was kind of like 'oh that would never happen' bc I've had people talk behind my back but never a really serious event or to my face. And never anything close to this.  And I also feel that I've gained respect for people coming in as exchange students or moving from another country because our country is alot tougher and harder to live in in some aspects. Easy in some too, but not with everything. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:02:44.938Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I wish that Cady would have taken the warning from Janis! I feel like people don't listen to their best interest alot of the time when they're in teen years", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:04:34.062Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Right. I agree - I certainly never heard of anything this extreme really happening in a school, although I know that a drama involving a single classroom or group of kids can seem like a really huge thing and then even the next year it is all a \"tempest in a teapot\" and no one really cares. I don't know - do you think maybe Cady didn't believe Janis though. With no experience of teen society to draw on, and only her positive experiences with her parents and socially, maybe she simply couldn't believe people were that crazy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:06:49.014Z"
    }, 
    {
      "docIdx": 3, 
      "text": "YES I really do feel that way, I feel that some other countries and cultures have a deeper respect than many people do here. We have our fair share of respectful people too but it was most certainly a shock as you said before :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:08:19.525Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I see the gymnasium part is listed here where everyone was gathered to stay after school, I feel that was an admirable thing for the teachers and students to organize to get together and openly speak to eachother that way", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:09:27.208Z"
    }, 
    {
      "docIdx": 3, 
      "text": "As far as teen decision making - you have to remember that at that stage in life teens want to be themselves, they are at that stage of becoming individuals. And so the decision making process gets derailed in the \"I want to be different\" as the number one reason. Not better, or even doing what they really want, just doing whatever they were told not to do so as to show they CAN do it. I'm not sure I'm stating this well. LOL. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:09:35.259Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You are, I completely understand because I wanted to do what I wanted to do then and that was it and wouldn't take any criticism which is probably true of all the teen characters in the film", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:10:35.312Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I felt Miss Norberry made an excellent effort not only at teaching but at bringing everyone together towards the end of the movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:11:48.979Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, so that part is entirely realistic. As far as the gathering in the gymnasium, it is great and suits a movie, but I'm not sure I can see that happening in real life. But then, it's been a long time since I was in high school, so maybe that has changed. Mrs. Norberry does seem like a teacher who goes above and beyond the call of duty - and thank goodness there really are teachers like that. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:13:48.507Z"
    }, 
    {
      "docIdx": 3, 
      "text": "There most certainly are! I remember having one or two. I feel principal Duvall was a little lacking in understanding though, but that may very well have been because this was an all out girls fight through the school which he probably didn't understand. He tried his best though! lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:15:27.863Z"
    }, 
    {
      "docIdx": 3, 
      "text": "All in all, I feel it was good on both a learning level and as a movie and deserving of the rating. I wish it was taken a little more seriously, but I guess it needed beefed up a little for hollywood (I'm sure you know how that is)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:17:51.576Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, men do not get it at all. Not that young men don't sort of gather up in cliques of their own, but they are really based more on mutual interests than status for the most part. I don't think they really do all the gossiping and status stuff. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:18:05.129Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't believe so either, or at least not as much as the women do. I don't feel they find it as important, I think Aaron in the movie thought they were all crazy!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:19:20.959Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Right - you couldn't really base a movie on a self help book and not have it be dead boring. By making it a comedy, then there is some hope that someone might learn something while they are laughing about it. And, of course, the studios purpose is not teaching or improving anything, but making money.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:19:27.927Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I definitely\n agree with money factor in the whole thing more than the important message.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:19:59.684Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you have any other thoughts on the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:20:08.449Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Not really. Not really my cup of tea, of course. I think I've gained some insight from our discussion though - as off topic as we may have been a few times. There might be redeeming factors to a silly teen comedy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:21:22.716Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I feel that I have looked into deeper insight myself with out discussion, and I'm much more tempted to pick up the book to read now to see how it relates and if it is in fact more to the point since it is considered a self help book", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:22:16.717Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Good point. I wonder how much it is and if it is on Kindle. That's quite a leap from self help to comedy - but the best self help books use humor so maybe the book is funny? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:23:12.566Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Most of the time when a movie is based on a book, I find I prefer the book. But I am more of a reader than a movie watcher, so maybe that's just me.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:24:06.446Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Does this stop automatically when the conversation is over? Or must we abort conversation? We have been typing awhile now - so long that I cannot remember as I have been focused on our discussion. I don't feel it's going to be that funny but maybe have a few elements of humor to add to it, not as funny as the movie though!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:24:21.647Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well \"funny\" I'm also more of a book reader than a movie person!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:24:36.495Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wow. I just checked and we have used 110 of the 120 minutes. We have to have had at least 12 responses. I'll scan up and see if we do.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:25:25.480Z"
    }, 
    {
      "docIdx": 3, 
      "text": "We have well exceeded that. Maybe this \"finish conversation\" button?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T13:26:32.497Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Time did go fairly fast with the hit and for not having a ton of info to discuss we were able to pull alot (: so that's good but yes! I feel that I saw a twelve or fifteen response number for each page. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T13:26:43.115Z"
    }
  ], 
  "rating": 2, 
  "status": 1, 
  "uid1LogInTime": "2018-02-16T12:16:28.739Z", 
  "uid1LogOutTime": "2018-02-16T13:26:49.679Z", 
  "uid1response": {
    "feedback": "We did well over the quota and I felt it was an interesting discussion, thanks!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-16T12:16:28.842Z", 
  "uid2LogOutTime": "2018-02-16T13:26:41.231Z", 
  "uid2response": {
    "feedback": "Actually it turned into a very interesting discussion.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2977", 
  "user2_id": "USR2317", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 11
}