{
  "date": "2018-03-29T22:10:10.684Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! Have you seen the movie \"Iron Man\"? It's a great movie starring Robert Downey Jr.!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:11:20.349Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hey, no, I haven't. What kind of movie is it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:11:51.199Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's a super hero movie. It's 10 years old now but it really had amazing special effects for its time. That's one thing critics loved about it", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:12:27.009Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Is the plot any good? Those super hero movies can be kind of repetitive.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:12:59.920Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think this one was pretty unique. It dealt with Tony Stark's character flaws of him trying to discover who he really is.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:13:30.597Z"
    }, 
    {
      "docIdx": 0, 
      "text": "How about the rest of the cast? Any other big names?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:14:07.499Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Gwenyth Platrow was in it. She's Starks' personal assistant and love interest. I don't think her character was really too great though.I felt like she was in it more for the comedy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:14:58.850Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well, they can't all be winners I suppose. Gotta have a few comedic characters.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:15:51.251Z"
    }, 
    {
      "docIdx": 0, 
      "text": "True. I suppose she was really important to him. Just not to the movie itself.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:16:27.448Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So you'd recommend it overall? How about a rating?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:16:52.680Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes overall I thought it was really a great movie. The acting was overall really good as well. You'd really believe Robert Downey Jr. was the character. It was amazing watching him metamorphisze from being totally self absorbed to caring about others - at least enough t\no rescue the world.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:18:03.214Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Does he play something of an anti-hero? I always like those characters.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:18:39.704Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I suppose you can say that. It is really a good guy. He just wrestles with the idea of being good and caring about others even before he builds the Iron Man suit.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:19:35.544Z"
    }, 
    {
      "docIdx": 1, 
      "text": "How's the action? I'd imagine there's a lot given the genre.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:20:30.728Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah it's got lots of really great action sequences! It was known for its great CGI and thought of way ahead of its time. I suppose now the CGI wouldn't look so great but the fights do still tend to look realistic.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:21:46.254Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Is he up against some kind of Arch-Nemesis or just a bunch of random bad guys?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:22:32.870Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I wouldn't exactly call it an arch nemesis type situation. Just a bad guy arms dealer who's selling illegal weapons around the world and attacking small villages.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:24:28.256Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Lol yeah that's why I never watch these things for the intricate plots. I love them for the fun action sequences though.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:24:43.134Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I see, was the villain played well, or interesting? An arms dealer doesn't sound too scary.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:25:32.669Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No he wasn't particularly good or memorable. He was trying to reverse engineer the Iron Man suit. That was his big deal.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:26:35.865Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Reading and trying to write out this plot really reminds me how ridiculous these movies really are. But it's a good fun ridiculous\n I guess.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:27:01.505Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, they can't all be serious I suppose. People definitely buy the tickets and such though. Would I need to know any of the backstory, or do they go over all that?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:27:55.968Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No this is the first one in the series they explain the whole origin story. I will say that I remember the movie just starts off with you kind of thrown in so if you're not familiar with the backstory you probably won't know what's going on.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:28:36.188Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's my big problem with sequels. I never remember what happened in the previous movies so I feel like I'm just trying to figure everything out from zero.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:29:05.166Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, even just missing a week of a tv show can screw things up for the viewer, nevermind watching a sequel two years later.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:29:55.564Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Still, I guess if they even made sequels it's probably pretty good.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:30:25.065Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I guess that's why I've never been able to get into any of those over dramatized serial tv shows. It feels like nothing happens in each episode but so much happens that you have to keep track of everything.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:30:53.486Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's definitely\n enjoyable. Marvel is a giant company so they obviously have lots of fans!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:31:13.188Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They're definitely getting bigger. They pump out these movies every month now. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:32:03.903Z"
    }, 
    {
      "docIdx": 3, 
      "text": "A whole lot of comic book fans still out there, apparently.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:32:12.799Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah I've never been into comic books. But I follow the whole Marvel movie world universe a bit and am just amazed at how many movies there are and how they all fit together like a puzzle. I'd never be able to keep track of all of it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:33:03.852Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I was happy when each movie was a unique standalone item.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-29T22:33:13.452Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, I'll have to see if it's on Netflix or something. Thanks for the reccomendation.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-29T22:33:26.329Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-29T22:10:10.684Z", 
  "uid1LogOutTime": "2018-03-29T22:33:27.135Z", 
  "uid1response": {
    "feedback": "Other user answered my questions well and seemed to have a good understanding of the document. The user didn't downplay a few flaws in the movie making it seem like a honest opinion. They sold the movie well enough that I would give it a watch.", 
    "response": [
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-29T22:10:10.686Z", 
  "uid2LogOutTime": "2018-03-29T22:33:55.023Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR877", 
  "user2_id": "USR155", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 21
}