{
  "date": "2018-03-26T14:56:10.128Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello! Have you seen this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T14:56:46.108Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you know that this movie was inspired by Sleeping Beauty?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T14:57:52.125Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No not yet. I do like the actors that are portrayed in this movie though.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T14:58:03.119Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like the actors too. I think Angelina Jolie especially adds a lot to every movie that she is in. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T14:58:36.094Z"
    }, 
    {
      "docIdx": 0, 
      "text": "For sure. But I get torn between reality and fantasy on these type of movies. I like the concept of it but still I balk at actually going to the movie itself.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T14:59:20.863Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can understand that. Going along with the genre, I'm not sure if the calling it a \"SuperHero\" movie along with later describing it as a \"dark fantasy\" really go together. I feel like \"dark fantasy\" (or just fantasy) is not necessarily the same as a super hero movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:00:42.394Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I put a lot of emphasis just on the title of the movie. Maleficient just doesn't click with me in that respect.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:00:51.488Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The title does seem a little lackluster, perhaps.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:01:05.146Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well it just seems like the dark side of life and that's not what I am about. I like upbeat, realistic type of movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:01:45.425Z"
    }, 
    {
      "docIdx": 0, 
      "text": "If this movie was more upbeat but still rather unrealistic, do you think you'd have a better response to it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:02:18.268Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Probably, but with the feedback from you and what I've read I probably would venture to see it just based on the characters as well.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:03:22.285Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The first key scene does sound pretty dark, but at least it provides a lot of background as to why the movie becomes dark. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:04:30.809Z"
    }, 
    {
      "docIdx": 1, 
      "text": "When I am in the mood I do like to envision how life would have been like in the days of kingdoms and such. Do you believe that life could have happened that way with the Moors civilization?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:06:21.434Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think that real life could have been similar in a lot of ways, without the fairies and such, of course. Do you think that Maleficent still loved Stefan despite his betrayal?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:07:23.709Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Probably not because forced love never works. Now this plot is beginning to form and I want to know more about it. Especially when the human transformation starts to happen.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:10:28.010Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree! I hope that she ended up not loving him, because he sounds terrible. I would also like to see this movie!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:11:38.836Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Having this cast of characters could probably make any movie palatable for me in any case. I wonder of the director, Robert Stromberg, had made any other type of movies within this genre?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:12:45.364Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm sure that he does. Do you think that he decided to direct this movie with this particular cast in mind? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:14:04.313Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think it takes a strong cast of characters to pull off the drama that is required within the plot of this movie. Especially when Aurora learns of her past and goes back home. I wonder what the reception would be like?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:15:47.097Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree. I am a little confused about the second key scene. What curse is it talking about when it says \"Maleficent tries desperately to undo the curse?\" Also, why is Aurora so very upset when she finds out about Maleficent's past? Truthfully, it doesn't seem like Maleficent did anything bad. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:17:19.638Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Considering the circumstances, that is.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:17:29.806Z"
    }, 
    {
      "docIdx": 2, 
      "text": "this is a bit confusing for me as well. But probably not as much as when watching the movie. I wonder what the reception would be like from her father?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:20:42.606Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I hope that the movie is a bit clearer than the description! I'm sure that Aurora's father probably became very angry and would try to kill Maleficent.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:21:27.749Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's the thing with reading reviews. They can't reveal everything lest they spoil the ending but I think people like to see the reactions of the actors when in situations that they can envision themselves in. I wonder how painful it would be when the wings are seared off?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:23:50.172Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I can't even imagine how painful that would be (especially because I don't have wings, ha). I didn't realize that Stefan was Aurora's father. Perhaps I just didn't put that together. I think that Aurora should be mad with him and not with Maleficent. How do you think she releases her wings? A magic spell, perhaps?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:26:29.670Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Looks like the kiss to the forehead did the trick on awaking her. Then carrying her on the wings must have been some sight to see. Funny to see how people that are initially considered \"bad\" now seem to be protectors or at the very least friends.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:28:47.005Z"
    }, 
    {
      "docIdx": 3, 
      "text": "From the description, I think that I would really enjoy this updated take on Sleeping Beauty. Are you happy that Stefan was killed in the end?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:30:02.459Z"
    }, 
    {
      "docIdx": 3, 
      "text": "To live happily ever after is the scenario here? I would take that aspect of the story as symbolism. Getting away from the bad vibes, bad people of the world so that ones world is content and prosperous. Yeah, probably glad that he's out of her life.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:31:38.870Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I enjoy that the plot shows an alternative route to the \"happily ever after\" ending that you describe. Do you think that this movie's ratings are accurate?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:32:51.217Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think after discussing this movie that I would probably give a higher percentage than 51%. I think getting over the fantasy part of the movie would raise the percentage considerably. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:33:55.488Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree with you there. I think that we can finish the conversation now, but I've enjoyed speaking with you. Have a great day!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T15:34:22.523Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So now do we just click on finish conversation to get our completion code?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T15:34:35.286Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-26T14:56:10.128Z", 
  "uid1LogOutTime": "2018-03-26T15:34:23.893Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-26T14:56:10.201Z", 
  "uid2LogOutTime": "2018-03-26T15:34:46.470Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4772", 
  "user2_id": "USR1666", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 22
}