{
  "date": "2018-03-17T03:10:46.096Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi How's it going?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:11:36.985Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Are we connected?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:13:19.240Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's going well, thanks. So this movie is Despicable Me, starring Steve Carell as a mean supervillain, Gru, and Jason Segel as Victor,  Gru's archenemy.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:13:43.224Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The movie scored 81% on Rotten Tomatoes and a A on CinemaScore, it's definitely worth watching!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:15:33.417Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I've heard of that movie, what do you think about it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:15:34.484Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought it was interesting and fun, and I think the positive ratings reflect that.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:16:42.504Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I would have to agree.  I've only heard good things about it. My son has watched it, but I haven't. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:17:37.066Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's a great movie for kids and adults alike, and is definitely a worthwhile expenditure! Critics say \"Kids will dig it, and adults will smile with amusement\"!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:20:16.918Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sounds pretty cool! My son talked about it constantly when he first saw it. It definitely going to be on my to do list. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:25:04.128Z"
    }, 
    {
      "docIdx": 0, 
      "text": "In your opinion what is the theme of the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:26:54.840Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think the movie follow the masterplot of the hero's journey, where the audience follows Gru in his attempt to achieve a long term goal of shrinking the moon. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:30:23.294Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What do you think about story's involving the masterplot of the hero's journey?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:31:09.454Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think the director of this movie creatively exemplified that there's good in all of us. Although Gru was initially a Supervillian he changed his views and actually became the hero. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:36:39.251Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes! The way that the plot twist was pulled off by the director was heartwarming. I thought the voice acting by Steve Carell was phenomenal! What are you thoughts on the quality of animation of the film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:40:24.125Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The animation was phenomenal. It was unbelievably realistic. And I didn't know Steve Carell play Gru! Now I definitely must see it! Lol", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:42:41.242Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Wow so I'm seeing they actually have parts 2 and three and the success of the movie broke records. I read an article stating Despicable Me is Now the Most Successful Animated Franchise of All Time. Why do you think the movie was so successful relative to other films?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:46:08.889Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think a lot of the movie's success came from a combination of excellent actors, animation, and directors. It was also very helpful that anyone across a broad range of ages could be entertained by it!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:48:04.899Z"
    }, 
    {
      "docIdx": 2, 
      "text": "One of my favourite scenes that I thought was portrayed very well in the film was the scene where Gru runs out of money to pay his little minions, but his girls break open their piggy bank to help pay. I thought the way that the scene was constructed helped convey a very positive message!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T03:51:57.935Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Aww. That scene alone contributed to his change of heart. According to the story plot, Gru was evil because he never really had anyone to care for him. Those girls actually saved him as a person. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T03:57:10.002Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I often hear a great deal about the minions. What is their purpose in this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T04:00:24.460Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Definitely! I really like the message that you are never too far down the wrong path to come back and make things right. It's a great lesson for young and old people to learn!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T04:00:28.623Z"
    }, 
    {
      "docIdx": 2, 
      "text": "In my opinion, the minions in the movie provide a lot of the comic relief that is necessary to keep children and adults engaged.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T04:01:57.945Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I have to agree, they seem to be the most popular characters. Allthough nobody actually understands what they are saying, they are quite hilarious. Never a dull moment for sure.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T04:04:20.144Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What did you think about the scene where Gru successfully shrinks and steals the moon and Vector kidnaps the girls?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T04:06:35.852Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I thought it was really heartwarming when Gru tried to rescue the girls after showing such dislike for them in the beginning of the film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T04:08:31.615Z"
    }, 
    {
      "docIdx": 3, 
      "text": "At first I was actually excited that he was successful, but then I was sad that the girls were gone. I believe that scene alone is the climax and turning point of the movie. Shrinking the moon was important to him, but in the end the girls meant more to him than anything. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T04:09:24.163Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Absolutely! I 100% agree with you.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T04:09:56.821Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What are your thoughts on the ending of the film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T04:11:01.170Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I was rooting him on from that point on! Kind of surprised me that he actually became their dad! No everyone get's to say they have a super cool supervillian as a parent! Lol", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T04:11:39.554Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah true! What would you rate the film out of 10 in your opinion?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T04:12:56.693Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well I guess I know what my next binge watch movie day will consist of :)", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T04:13:17.162Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I would give it at least an 8. What about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-17T04:13:44.608Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I would give it an 8 as well!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-17T04:13:58.983Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-17T03:10:46.096Z", 
  "uid1LogOutTime": "2018-03-17T04:14:03.045Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-17T03:10:46.103Z", 
  "uid2LogOutTime": "2018-03-17T04:14:11.246Z", 
  "uid2response": {
    "feedback": "According to the other user, the movie is definitely a must see. I researched and found out that Despicable Me is actually the most successful animated franchise of all time. The user and I agreed on many points and were both moved by the theme. ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2254", 
  "user2_id": "USR4298", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 16
}