{
  "date": "2017-12-19T16:58:07.356Z", 
  "docType": 0, 
  "history": [
    {
      "docIdx": 0, 
      "text": "I think it's amazing how packed this movie was considering it was only 106 minutes.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T16:58:54.427Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree, I was really interested in checking it out being a fan of war movies, especially WWII settings, and I certainly wasn't disappointed. Christopher Nolan doesn't seem to ever disappoint! ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T16:59:43.506Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Agreed! I thoroughly agree with the 92% rating,", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:00:19.090Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you see it in IMAX? The 70mm screen was impressive.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:00:49.481Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Same here, I typically look at metacritic over rotten tomatoes, and sometimes they can vary vastly in their ratings, but even on metacritic it got a 94!", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:00:53.677Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, the critical ratings were very consistent.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:01:20.169Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I didn't see it in imax, unfortunately, as there aren't any near me, but seeing it in regular theatre was just as good. Fionn Whitehead being cast as the lead was absolutely perfect. He knocked his character, Tommy, out of the park. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:01:56.294Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Agreed. I think it was a clever move to name him Tommy to make him more representative of the average person.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:02:42.592Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really enjoy how there's not a whole lot of dialogue in the movie. It definitely creates a very suspensful setting engaging the audience with just the sights and music. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:02:59.689Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The use of time period specific things, like boats that participated in the evacuation was also a nice touch as well\n. They certainly went all out in making sure this movie was a hit. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:05:00.194Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I especially like their use of practical effects--Nolan's a champ at that. So much better than trying to use CGI for everything!", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:06:46.410Z"
    }, 
    {
      "docIdx": 1, 
      "text": "George going blind and everything that resulted from that was so sad; I can't imagine what that was like.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:07:35.944Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The scene where they find a wounded man after the German dive-bomber attack I found very interesting. When they rushed his stre\ntcher onto a hospital shit but weren't allowed to board the ship themselves, just think if they were allowed on and then perished when it was sunk by that torpedo. Whole different ending in many ways. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:09:03.877Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, for sure. I liked how they built up the suspense for something so simple as just getting a stretcher onto a ship. The constant beats of finding safety and losing it again definitely drives the story forward.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:10:07.574Z"
    }, 
    {
      "docIdx": 1, 
      "text": "They also almost never went to Dunkirk. After they rescued that officer from the wrecked ship and he tried to turn them around. That was a pretty pivotal point in the movie. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:11:58.428Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It really highlights how both individual moments (the one boat) and communal efforts (the entire civilian boat squad) matter in war, I think.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:13:16.071Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Definitely. To think, if they never had that tussle with the officer that was shell-shocked and tried to get them to turn around, George wouldn't have suffered that head injury and went blind. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:14:18.274Z"
    }, 
    {
      "docIdx": 2, 
      "text": "And the scene with Gibson is so heart breaking. Tommy tried to defend him when they find out he's french, but it didn't matter and he died anyway.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:15:18.894Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree, the moment he got tangled in that chain, I knew it was going to spell disaster. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:16:36.463Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The same thing happened with George too, really. Him lying to protect the shell-shocked officer's peace was a brave thing.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:17:21.731Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Agreed. On another note, I thought the visuals were pretty awesome when Farrier shot down that bomber and it rashed into the oil slick from that destroyer. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:18:39.166Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was a great moment, particularly since they then revealed that Peter had lost his own brother.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:19:27.481Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I almost forgot about that. He was a pilot as well if I remember correctly, and also died in the war. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:20:02.672Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah. It's so amazing that they managed to get so many men out, and I loved hat the Commander stayed behind to help the French too. It was a good callback to trying to save Gibson.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:20:59.077Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yea, how crazy was it that over 300 thousand people were evacuated? 10 times more than what they expected. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:22:39.558Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's amazing how something that can seem like a failure at first--as per Alex's understanding--can wind up being an amazing success just on the sheer scale of it.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:23:30.157Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Agreed, things look so much different on the outside than being in it I'm sure. Look at the hero's welcome they received, and everyone's praise of them being heroic. ", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:24:55.004Z"
    }, 
    {
      "docIdx": 3, 
      "text": "For sure. The use of the newspaper to get Churchill's speech in was a nice touch, and I also loved that they honoured Geo\nrge too.", 
      "uid": "user2", 
      "utcTimestamp": "2017-12-19T17:25:45.105Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree, the reference to Churchills paper wasn't overdone, and really added an element that needed to be shown, without it coming off too cheesy. George was one of my favorite characters, and him being honored as a hero was great!", 
      "uid": "user1", 
      "utcTimestamp": "2017-12-19T17:26:44.846Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2017-12-19T16:58:07.356Z", 
  "uid1LogOutTime": "2017-12-19T17:26:48.877Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2017-12-19T16:58:07.370Z", 
  "uid2LogOutTime": "2017-12-19T17:27:10.411Z", 
  "uid2response": {
    "feedback": "Takes way too long for the pay. $4 would have been more appropriate.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR203", 
  "user2_id": "USR2143", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 9
}