{
  "date": "2018-03-20T01:45:02.777Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Have you seen Toy Story?  I really love that it was as good as the critics say - if not better!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:46:29.670Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have seen it and I would agree with you! The rotten tomato score is great! What did you think of the plot?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:47:10.456Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was really good - I love how the toys were really themselves while giving that feeling of imagination that playing with toys gives :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:47:54.162Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes! It is so fun to watch the toys come back to life. It is interesting to know that it was the first film produced by Pixar.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:48:43.973Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wow I didn't realize that!  They had some good voice actors there too - Tom Hanks and Tim Allen are wonderful picks", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:49:18.311Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really do think that Tom Hanks made Woody very believable! What did you think about the different charachters? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:50:15.105Z"
    }, 
    {
      "docIdx": 0, 
      "text": "They're all really good - especially the scene where Buzz realizes he's \"just\" a toy - pretty eye-opening even for kids.  Did you know that Steve Jobs was an executive-producer?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:51:38.328Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wow! I did not know that. I'm sure that added to the purity and imagination of the movie! Critics say that it is one of the best voiced animated movies! Would you agree? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:53:31.679Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I would - even Don Rickles as Mr. Potato Head - I had to look that one up as I didn't realize that's who it was.  John Lasseter did a great job directing, even as it was his first film", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:54:47.141Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I did not realize that either! I did know that Tim Allen played Buzz Lightyear. It was great casting and created a believable friend relationship between him and Woody. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:55:47.683Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Indeed. The scene where they Buzz is given as a gift at the party is a really cute way to introduce a character - but I guess as a toy, it's a wonderful idea", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T01:57:19.326Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes! I could not agree more. It is a beautiful representation of friendship as the work together to be reunited with their friend Andy. I think it really does give kids the right idea. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T01:58:31.311Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So true! it's ingenious that the toys use baby monitors to communicate back and forth - adorable and something kids can easily relate to.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:00:10.568Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Agreed! I love the added characters such as the slinky dog and Rex. I believe that it added many different personalities to the movie!\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:02:28.635Z"
    }, 
    {
      "docIdx": 1, 
      "text": "For sure.  It's good too that they can all come together and work as a team - kids can benefit from such positive examples.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:03:55.545Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes! The examples here provide so many real life examples. I love that it gives kids an idea of how moving affects the family too. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:06:03.947Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It's sad though how Woody starts to feel upstaged by Buzz - we've all been there though.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:07:14.848Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree. It lets kids know the different interpretations of a moving situation can affect\n other characters. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:08:32.083Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Can you believe they get stuck in the crane game!  How silly :) ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:09:10.053Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Haha! I could not believe that scene. I do think that is one of the scenes that makes the movie a comedy genre. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:11:05.626Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It's interesting that even when thinking about toys, the idea of jealous comes up like when they think Woody knocked Buzz out of the window.   Drama - even in the world of toys!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:12:19.317Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Right! I think this movie is so interesting! What is your overall opinion of the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:14:25.921Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's really good!  Just like some of the critics say \"a work of genius!\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:14:53.308Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree! I love the scene where Woody and Buzz attempt to make it in the moving truck. It is so suspensful! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:16:26.146Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Indeed!  I love when the dog chases them - and his name is Scud - hilarious!!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:17:01.471Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think that it is interesting to see how many skills Buzz has. He really is a complex character. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:17:51.362Z"
    }, 
    {
      "docIdx": 3, 
      "text": "For sure - he can even fly which is so wonderful! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:18:30.343Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes! I do believe that is why Woody grows to be envious of him", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T02:20:38.488Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think you're right. The ending was adorable though - the puppy is a whole new world of mess!  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T02:21:11.809Z"
    }
  ], 
  "rating": 2, 
  "status": 1, 
  "uid1LogInTime": "2018-03-20T01:45:02.777Z", 
  "uid1LogOutTime": "2018-03-20T02:21:17.487Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-20T01:45:02.813Z", 
  "uid2LogOutTime": "2018-03-20T02:21:24.406Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3180", 
  "user2_id": "USR788", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 29
}