{
  "date": "2018-02-13T21:25:00.825Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:25:38.014Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello there. How are you? I was just reading about the movie La La Land. Have you seen it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:27:19.478Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No, what is it about?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:29:02.784Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I would love to watch it, may I have more information about it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:29:40.625Z"
    }, 
    {
      "docIdx": 0, 
      "text": "If you are into musicals, it is a really classical approach to a new age musical. It stars Ryan Gosling and Emma Stone as two people trying to find their way in Los Angeles.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:30:06.865Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I love musicals! Especially modern musicals, I am definitely interested in watching it because I love Ryan Gosling. He has a great voice.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:32:24.487Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ryan Gosling is a struggling jazz musician and Emma Stone is an aspiring actress. They meet along the way and develop a relationship of sorts. As the movie progresses, you see the main characters go through times of joy and times of struggle.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:32:48.824Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, Ryan Gosling sort of disappeared for a little while and then as of late he has been in a lot of movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:33:37.303Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Great, with a touch of romance too. I am definitely interested in watching this. Is this a recent movie or has it been out for a few years?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:34:37.750Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I've seen this movie and honestly, I think it was definitely worth watching. It gives quite the perspective on the struggle in Hollywood. It came out in late 2016.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:35:28.781Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Okay. I have a high interest in the Hollywood life to and what really goes on behind the scenes of Hollywood. I know it isn't always what it seems. I will definitely watch this. I can't believe I haven't heard of it.\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:37:30.313Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Do you have a favorite character in the movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:37:58.539Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I like Ryan Gosling's character personally. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:38:32.417Z"
    }, 
    {
      "docIdx": 1, 
      "text": "After watching it, does it make you look at Hollywood in a different perspective?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:40:14.491Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So, Ryan Gosling plays the character Sebatian and Emma Stone plays the character Mia. Mia first sees Sebatian when he is playing Christmas songs at the club he works at. This is how the movie starts, but they don't really meet that night because Sebatian is so caught up within himself at the beginning of the movie, that he practically runs Mia over on the way out of the night club.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:43:23.595Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm gonna try not to spoil anything for you, this is in the description of the movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:44:04.083Z"
    }, 
    {
      "docIdx": 1, 
      "text": "When they finally meet at a house party, they have quite the night and that night spans into the scenery of the Hollywood hills. All of this whilst they sing and dance throughout the night it seemed.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:45:48.182Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Okay, sounds interesting. Were they living two different lifestyles? & were  they in school?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:47:25.283Z"
    }, 
    {
      "docIdx": 2, 
      "text": "So, anyway, it really gives you quite the insight into Hollywood. I felt as though I had a better understanding of the hustle and bustle of Hollywood.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:47:45.317Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Okay, I see. What Hollywood careers were they seeking? Like singing acting?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:49:44.197Z"
    }, 
    {
      "docIdx": 2, 
      "text": "What was the plot of the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:50:22.680Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, they were living two entirely different lives, separate from each other. When watching the movie, it is like watching two separate stories. Sebastian is living out his life as they both collaborate on a project together. Mia, on the other hand, is working on the collaboration nonstop. In the meantime, they both are falling in love with each other, but it doesn't seem like they really want to commit to each other. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:50:47.684Z"
    }, 
    {
      "docIdx": 2, 
      "text": "They weren't in school", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:51:04.212Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Sebatian is trying to get out of the club and start his own band. So, he is gone a lot.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:51:46.660Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Mia, has a lot of personal issues, so she almost seems sort of lazy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:52:25.955Z"
    }, 
    {
      "docIdx": 2, 
      "text": "When it comes to her career that is.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:52:55.122Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Interesting, was there anything in particular that stood out to you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:54:12.010Z"
    }, 
    {
      "docIdx": 3, 
      "text": "& any characters that you disliked?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:54:23.945Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I sort of didn't like Mia's character in a way. She seemed like she was conflicted, and I don't want to say much more about her so I don't spoil anything.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:55:41.909Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I love Emma Stone as an actress, but the character was a bit shallow. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:56:48.524Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I just know that Mia was more of the type of character to lean on someone like Sebatian, and when he wasn't around, she didn't push herself. Like, she gave up when people weren't looking.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:58:36.730Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Okay, yes, she is a great actress. It can be kind of difficult at first adjusting to an actor/actress that you like character when they are the complete opposite than what you are used to seeing.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:59:27.199Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Hmm, I wonder if it could have been because of problems she was dealing with at home although that is no excuse at all.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:00:25.763Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Don't get me wrong. all of this really adds depth to the story, and the twists that happen throughout. Without it, the story would be boring, and it couldn't do what it does.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:00:57.197Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Some sort of mother issues going on.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:01:37.121Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-13T21:25:00.825Z", 
  "uid1LogOutTime": "2018-02-13T22:03:24.727Z", 
  "uid1response": {
    "feedback": "The other user was very in depth about the explanations that he gave and seemed to have knowledge about the movie other than what he read as well. Another thing is I can tell that he was interested because he was responding pretty quickly and accurately. There was a couple things that I was confused on that that the other User did not address but overall I received a great deal of information and I am interested in watching this movie.", 
    "response": [
      1, 
      2, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T21:25:00.843Z", 
  "uid2LogOutTime": "2018-02-13T22:03:34.397Z", 
  "uid2response": {
    "feedback": "The conversation went fairly, but the way the document presented itself sort of chopped the conversation up a bit.", 
    "response": [
      1, 
      2, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR52", 
  "user2_id": "USR4867", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 3
}