{
  "date": "2018-02-05T22:36:22.127Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi, h\nave you seen the Wonder Woman movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:37:09.520Z"
    }, 
    {
      "docIdx": 0, 
      "text": "yes I have .it was a good drama superhero movie. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T22:37:40.052Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yep. Confirmed by the fact that it scored a 92% on rotten \ntomatoes ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:38:05.970Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think chris pine played a good steve trevor an american pilot. he potrays that old timey look", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T22:38:58.831Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, and he and Gal Gadot, as wonder woman, have good screen chemistry I thought.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:39:52.599Z"
    }, 
    {
      "docIdx": 0, 
      "text": "i thought that the fact that it was directed by a female -which is rare- made it even better than other action movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T22:40:59.371Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, the first female director of a live-action theatrical comic book superhero movie and it's one of the best of all hopefully will mean more female directors in the future. Plus her name is Patty! Not a lot of women named patty anymore, let alone movie directors.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:43:18.589Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I also liked how the movie was based in the world war 1 era. it gives a sense of history and fantasy of what could have been?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T22:45:59.703Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, I just wonder how or if they are going to explain the rise of Hitler and WWII because it seems like at the end of the movie she's ended war but maybe they might go down an alternate timeline? Could be interesting", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:47:46.266Z"
    }, 
    {
      "docIdx": 0, 
      "text": " One critic says this about the movie which I agree with 100%, \"taking more notes from Richard Donner than\nfrom Christopher Nolan, Patty Jenkins' Wonder Woman provides a welcome respite\nfrom DC's house style of grim darkness—boisterous, earnest, sometimes sloppy, yet\nconsistently entertaining.\" It felt like what the other DC comic movies in the DCEU (extended universe) should feel like", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:49:27.053Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I am looking forward to seeing other sequels and see how they bring in diana's family from themyscira. I am sure it would be interesting to see how the convey zeus and queen hippolyta in the coming movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T22:50:46.264Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That could be really interesting, dive deeper into the mythology of Wonder Woman. Maybe bring them into the modern era? Also, \n I wonder if Patty Jenkins is going to stay on to direct all the upcoming sequels or if she moves on to other works. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:53:53.096Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think the overall demi god potrays are good. I feel like if patty stayed on she would find some interesting actors and actresses to take on these heroic roles.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T22:54:32.096Z"
    }, 
    {
      "docIdx": 1, 
      "text": "There's a movie about the fight between all the gods and Ares but that wouldn't be a wonder woman movie, or at least, I don't know how you would get her to be in it (unless you somehow used time travel which would probably be a bad decision.) ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:57:19.182Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Do you think with the vast positive reception the wonder woman movie got that the sequel can live up to the first? What do you think the rating on rotten tomatoes would be for the sequel?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T22:58:32.267Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Time travel would probably mess up the story line. To me the part where steve trevor crashes on the island was a little loopy. But i suppose in another dimension it wouldn't be so far fetched. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T22:59:04.152Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I feel like the rotten tomatoes score would most likely stay the same. If it did go any higher I would say it would go to 95%", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T22:59:37.370Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, Steve and Diana's meeting for the first time wasn't handled great, but that's always a tough thing to write in movies. Add in that Diana lives on a hidden island created by zeus and I'm not sure if you can have them meet in a non-loopy way. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:02:59.217Z"
    }, 
    {
      "docIdx": 2, 
      "text": "How do you feel about the critics review. I felt that the word sloppy from one critic was a little harsh.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:03:02.437Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The scene where ludendorff is trying to create a deadly gas is a good portrayal of how intense the war was back then. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:04:31.135Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I thought it was pretty accurate. But all superhero movies have a bit of sloppy to them, I think. The way ares is handled at the end and some of the stuff with the German general Ludendoriff wasn't great", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:04:42.325Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I liked the spanish chief chemist Maru a lot. She was a great comic book type villain. Sad backstory that makes her sympathetic but also a psychopath who you root\n against. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:06:13.949Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I also thought she was played by winona ryder for the longest time, lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:06:47.175Z"
    }, 
    {
      "docIdx": 2, 
      "text": "there was a sad part where antiope sacrifices herself for diana. that would be interesting if there was a way to bring her back in some elaborate comeback story.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:08:36.718Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was a good scene though when the german ship invaded the island trying to get trevor. there was a lot of action and it was awesome to see women take control. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:09:32.039Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah, I could see them doing that with Antiope, and it being based on greek mythology where that type of story happens often. I thought showing diana's lasso in only a small part of the movie was a pretty cool trick. I expect we'll see more of her lasso of hestia in the upcoming movies", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:11:17.583Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I am more of a action movie enthusiast so when i saw it was drama I was a little concerned\n if I would like it. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:11:45.288Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yeah, but it's a DC comics based movie. Drama is only to set up the action set pieces (but the drama was still nicely handled I thought). ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:12:29.121Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Although somewhat expected, I thought making Diana the \"godkiller\" was a good way to tell the audience just how powerful wonder woman really is. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:13:51.752Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Also, it was a nice reveal that the old guy using a cane was the bad guy (god ares) the whole time. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:14:55.265Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That is true. I thought it was a little crazy when sir patrick revealed himself as ares. It gave the movie a thriller vibe. It also made you wonder if that is going to be a theme in the next movies", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:15:07.711Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And if bruce wayne/batman is going to be in the future movies (possible love interest?)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:15:47.200Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I liked how it also cut to the present day and showing diana emailing batman. I feel like there will be chemistry there.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:16:05.264Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Definitely. Also a nice tribute to her first love and the friends she remembers who helped shape who she was with the plate he gives her. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:16:48.312Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was interesting to see that throughout the decades she still remains the same and doesn't seem to age. I feel like that is going to be interesting in terms of casting in future movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:17:01.064Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was a little heartbreaking though that her love interest steve died. I feel like they invested so much in the character to just kill him off like that. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:17:52.085Z"
    }, 
    {
      "docIdx": 3, 
      "text": "His death is what 'creates wonder woman' so I think it was necessary. And it's why I think the sequel will be in the future (or present day) but maybe they'll do something crazy and have steve come back but this time, he's evil!) (I hope not.)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T23:19:18.595Z"
    }, 
    {
      "docIdx": 3, 
      "text": "But i guess there was a silver lining when diana killed ares in the end. it was sort of like payback for creating war on humans and leaving them to act that way. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T23:19:34.305Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-05T22:36:22.127Z", 
  "uid1LogOutTime": "2018-02-05T23:19:20.032Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-05T22:36:22.172Z", 
  "uid2LogOutTime": "2018-02-05T23:19:45.328Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      -1
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3183", 
  "user2_id": "USR2881", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 8
}