{
  "date": "2018-02-15T02:33:59.168Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi!  What do you think of the Disney Animated movie Frozen?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T02:35:42.741Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I love Kristen Bell and Idina Menzel's singing", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:36:25.868Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you think it was well made?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:37:12.032Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think the 3D effects were great, and I sobbed like a baby more than once, it was so emotional in parts. I think it was right up there with Beauty and the Beast, how about you?  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T02:37:47.306Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree. I loved the 3D animation. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:39:25.659Z"
    }, 
    {
      "docIdx": 0, 
      "text": "How did you feel about the songs?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:39:41.834Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I must say I love snowy films, living where its hot. Eh, they were good, but nothing I would put on my playlist after I left the theater.  Any movie with a snowman in it though makes my heart melt. Did you like the Snowman and Iceman?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T02:41:13.795Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes I did. I think CinemaScore nailed it with an A+ rating.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:43:05.842Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think so too, though Rotten Tomotoes could have upped it a bit, though a high rating I think it deserved even higher.  Would you see it again?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T02:45:32.757Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely. I would even own it on DVD. Do you think you would buy it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:46:33.822Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I don't know, we already have so many Disney movies from when I was growing up still on VHS tape!  But I suppose if I saw it on sale I could grab it.  It's a perfect movie for summer and family night.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T02:48:01.439Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Did you like the beginning, middle, or end more?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:49:40.502Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I like them all, but mostly the beginning and middle, though I am still trying to figure out what cryokinetic magic is. Do you know?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T02:50:50.192Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think it may be the art of freezing things, maybe?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:51:55.334Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I personally liked the middle the best because it was so light hearted", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:52:15.959Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah well, kids know more about that fancy magic stuff than I do. Though I did like the trolls, I think they were graphically or CG generated or however you say that, great!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T02:54:58.469Z"
    }, 
    {
      "docIdx": 1, 
      "text": "\nI feel like this would do really well on Broadway, don't you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T02:59:06.406Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree with you there completely.  And the music performed live would be fantastic.  But then again a story with two kids locked in a castle might not be the same on stage as it would be in the film.  And animals are never the best performers on stage. I guess they could get 2 people in a reindeer suit for that.  Though I bet the Broadway version on the King and Queen's costume would never be as epic as it was in the film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:03:20.767Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree, the ice castle might also be quite challenging to replicate on stage", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:06:38.954Z"
    }, 
    {
      "docIdx": 2, 
      "text": "True. How did you like the part after they grew up, and Elsa is courted by the two gents?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:07:32.666Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm not sure which part you're talking about?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:09:48.285Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Did you know it was Disney's 53rd animated feature film?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:12:46.053Z"
    }, 
    {
      "docIdx": 2, 
      "text": "After she grew up and was crowned the queen, the castle gates were opened and she got two suiters. Lucky her, and of course she had to run away. No I didn't know that, that makes me feel OLD.  Did you know it was inspired by A Han's Christian Anderson fairy tale?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:14:10.722Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No I didn't. I actually didn't know who Han's Christian Anderson was before this movie. I heard it was based on his works called \"The Snow Queen\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:16:03.875Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm assuming that's who Prince Hans got his name from.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:16:50.505Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Perhaps, did he wear a crown?  All I can recall is Elsa leaving the kingdom and making it cold and that other guy, the Duke, calling her a Monster.  That's no way to -get the girl- if you ask me.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:19:44.111Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah he later locks Anna in a room to die after Elsa freezes her heart, he definitely isn't a ladies man", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:21:41.597Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I know right, too bad she didn't like trolls because Grand Pabble seemed like a really nice healer fellow-troll.  In some ways it reminds me of the old princess kisses the frog stories. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:23:07.658Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What did you think of the Giant snow creature Elsa creates?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:24:17.703Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I loved the name of it, Marshmallow.  That made the kids laugh, me too.  But I think Anna really needed a beauty salon after her hair started turning white at such a young age.  What did you think with that plot twist with Hans?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:26:02.700Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I thought it was shocking. But relieved that Elsa escaped from the detention cell Han's puts her in.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:27:52.100Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, I really hated him towards the end, and then he put Anna in a room to die and wanted to execute the queen!  SO much for love!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:30:36.556Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Right! He is really nasty", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:31:02.439Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Have a good night!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T03:31:24.274Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You too!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T03:32:18.803Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-15T02:33:59.168Z", 
  "uid1LogOutTime": "2018-02-15T03:32:46.835Z", 
  "uid1response": {
    "feedback": "I hope I finished the task, there seemed to be no sign of -you are done- and the other user left the chat after quite a few exchanges so I ASSUME we did it correctly.", 
    "response": [
      1, 
      2, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-15T02:33:59.309Z", 
  "uid2LogOutTime": "2018-02-15T03:31:28.480Z", 
  "uid2response": {
    "feedback": "The document loaded in a very confusing manor and it definitely took more than 3 exchanges between me and the other user before the next document appeared. It took much longer to complete this hit than the 30 minutes it was suppose to take.", 
    "response": [
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3080", 
  "user2_id": "USR1545", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 0
}