{
  "date": "2018-03-28T18:08:22.219Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi, have you watch Toy Story?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:09:01.391Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I have! Have you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:09:15.765Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, I love that it has the voices of Tim Allen and Tom Hanks, they play great together don't you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:09:46.549Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh absolutely!  I think it tells a very heart warming tale, a childhood classic for sure.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:10:27.593Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, obviously CGI has gotten better since then, but it has a real razzle-dazzle look to it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:10:58.340Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think it is what what makes it a really great film. I also think the heft and believablility Tom Hanks brought to his Woody, really makes the whole film worth while.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:12:14.059Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah. I never had any cowboy toys growing up really, but I'd have loved to have some space figure like Buzz. What about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:12:48.774Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I also was much more of a space figure kind of kid, I only had a few cowboy action figures, most of which were Woody from the film because I was so inspired by his character.\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:13:54.493Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That's cool. You know, I didn't know that Jim Varney was even in this movie until recently? I really like him though so it was awesome to find out. Who did you like most in Toy Story?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:14:51.918Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I would have to say Tim Allen as Buzz was my favorite at the time, by as I grew up I learned to appreciate the director John Lasseter. Did you know it was his directing debut?! \n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:16:00.925Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I did. He really knocked it out of the park. A lot of stuff works shockingly well in the movie, so he deserves a lot of credit. The glory days of Pixar started strong. But yeah, Buzz is cool too, even as an adult I like the childish charm.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:17:47.200Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I completely agree, I especially like the scene when Buzz was introduced to the film. It was very creative and a great introduction into the concepts covered by the rest of the film. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:19:33.010Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, they did justice to most of the characters despite a pretty large cast. I liked Don Rickles as comedy relief as Mr. Potato Head a lot more than the comic relief from Rex, but Rex was still pretty adorable for his part. Gotta have some broad appeal to different audiences, right?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:21:05.973Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think that is what made the film such a success is that they hit such a wide audience without overwhelming the viewer, probably why it did so well in the ratings! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:23:04.246Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, for sure. So aside from Buzz and Woody who could obviously carry a story on their own, who would you most watch a spinoff of? I think the green army men could be really entertaining to watch, if they found a way to keep it fresh and interesting for an entire feature.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:24:16.574Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh that would be very amusing, but I always thought a film around Wallace Shawn", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:24:56.987Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Wallace Shawn's character\n would make a great film as well, Rex is really funny!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:25:18.021Z"
    }, 
    {
      "docIdx": 2, 
      "text": "You can't go wrong with dinosaurs right? I like how Rex kept if feeling light, even with some of the darker stuff with Sid.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:26:21.066Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He was definitely a nice, bright, relief. I really enjoyed how to film developed into a quest for two enemies to find their way home after being lost. I think that is such a great concept! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:27:36.473Z"
    }, 
    {
      "docIdx": 2, 
      "text": "A great way to come together, just find common ground against an even worse enemy! Haha. Buzz thinking he was a real toy played well with them being in real danger I thought.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:28:33.571Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That was by far one of my favorite scenes! What did you think of the great scene with the claw machine? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:29:14.393Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The CLAW! Yeah I have to admit that those toys of the little three eyed aliens were a lot of stupid childhood fun for me. Something about them.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:30:06.687Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I love those little things, I'd love to get my hands on one now! It was just such an inspirational film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:31:06.158Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah. What about the scene where they fly with the rocket? As a kid I kind of wanted to be buzz right then. Looked like a lot of fun, danger regardless of course.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:31:51.881Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh I was always envious of RC that looked like a wild ride!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:32:34.527Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I still want a human sized RC car because of that, heh.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:33:01.380Z"
    }, 
    {
      "docIdx": 3, 
      "text": "haha for sure! I will still always remember the worried look Buzz and Woody gave each other after they say Andy's new best friend, do you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:33:51.156Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, I thought it was a cute clever way to wrap up the movie. The life of a toy beautifully captured.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-28T18:34:25.102Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Absolutely\n, thank you for having a conversation with me, have a great day!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-28T18:35:47.570Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-28T18:08:22.219Z", 
  "uid1LogOutTime": "2018-03-28T18:35:48.994Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-28T18:08:22.222Z", 
  "uid2LogOutTime": "2018-03-28T18:35:54.290Z", 
  "uid2response": {
    "feedback": "Thank you", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR141", 
  "user2_id": "USR937", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 29
}