{
  "date": "2018-03-26T19:46:49.899Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Do you agree with what the critics said about Home Alone?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T19:47:40.609Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Not really, I mean, it seems like they are pulling it apart a little too much and forgot to watch it from an entertaining angle. What do you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T19:48:45.694Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree with you. To be honest, I rarely agree with critics. Do you consider the opinions of critics when deciding to watch a film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T19:49:17.426Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really don't. Sometimes, I'll check in to see what people think, but usually I avoid critics so I can watch the movie fresh without anybody's opinions in my head. Did you like the slapstick humor in this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T19:50:42.722Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do, but I think I have fond memories of it from when I was a kid. I'm not sure how I would feel reacting as an adult watching it for the first time. Did you watch it as a kid?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T19:51:26.402Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Totally. I did watch it as a kid. I think the slapstick works better here because Kevin talks to the camera. I thoroughly related to him with his older brother, reminded me of my own brother! I loved Catherine O'Hara in this too!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T19:53:06.931Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh yeah! I think the technique of breaking the fourth wall works. It reminds me a bit of Ferris Bueller's Day Off in that respect. I don't think you see that as much in films these days. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T19:54:09.582Z"
    }, 
    {
      "docIdx": 0, 
      "text": "You're right, you don't see it much these days. Perhaps, it's the charm of John Hughes that made it work so well. I think if it happened today it would only come off as cheesy. How much did you want one of those recorders as a kid, after seeing this film?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T19:55:28.704Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I wanted one so badly. I think my sister got one but I didn't. But as an adult I want the house. I always kind of wondered how the family afforded the house in the film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T19:56:58.717Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you like Joe Pesci in the film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T19:59:23.423Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh man, tough break! I wondered the same about the house. It's funny to rarely have thought of how people paid for things, but then wondering how a fictional family could afford the house in a movie. And how amazing to live in that house and be able to take the entire family to Paris. \n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T19:59:31.878Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I did like Pesci! I was just going to say that Pesci and Stern were perfectly cast! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:00:02.070Z"
    }, 
    {
      "docIdx": 1, 
      "text": "How about Daniel Stern? He was in so many movies during that time.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:00:22.901Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He was good! I'm actually not super familiar with his other work though, so I'll have to look some of them up. Did you think the part where they forgot Kevin was believable? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:01:56.977Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I liked the crazy morning freakout when the family is awakened by the airport van service and I think because there are sooo many people involved, it makes it more plausible that Kevin could be forgotten. What do you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:02:58.428Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Pretty believable. You would think that at least one person would have noticed though! Kevin's probably still in therapy from being forgotten. Between being forgotten and his siblings, I would be. What did you think about the family interaction in the film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:05:43.174Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh yeah, or that his Mom would have thought of him sooner. I thought the family interactions were delightfully exaggerated, like everyone is acting out at the same time, but I always hated that Kevin's uncle treated him so disdainfully. I suppose it's necessary to have a bit of a villian in the family to keep it interesting. Do you think Frank was necessary to the story?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:09:03.752Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I don't think he was necessary to the storyline, but he added to the mood of the film. There are some cool online theories suggesting that he was behind the crime! Do you think the traps Kevin set up were believable?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:11:38.437Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Ha! I've never seen those theories, but, I mean, he's kind of the skeevy type to try that! I think that they did a great job of suspending disbelief while watching the film, so that you are just in the moment. Certainly, pulling all of that off in reality would cause so much more harm than shown in the movie, but I do think they do a good job of making it believable in the context. Probably the play on old timey slapstick and old cartoons helps sell this. Do you think the traps were believable? I don't know if I would've ever thought to do any of that!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:16:52.232Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Some of them were. The trip wire and the BB gun were. The flamethrower was maybe harder to believe. I'm more impressed that an 8 year old kid came up with them, but some of them seemed kind of deadly! Do you think it made sense for the Mom to try and rush back, or should she have contacted someone back home to go check on Kevin? That seems like it would make more sense than leaving him home alone that whole time.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:19:21.041Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I know, I'm amazed anyone could live through them, but, I guess it is a comedy! It would be too much of a bummer for someone to die. :\\  If it were me, I'd try to rush back as well, but I also would've been calling everyone I know to go check on him. I feel like if they had all of that money, they probably knew a TON of people and at least one family would be home during the holidays. I liked the addition of the polka band driving Kate back to Chicago, how about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:22:22.778Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I did like that! I would have liked to see the polka band figure a little more prominently. It's such a fun addition to have. Do you think it's believable that Kate would have had such a hard time getting back home?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:24:15.685Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, it was pretty fun. And added some levity to her dire situation. As a kid, it seemed totally believable. Now, it's easy for me to wonder, with all that money, why didn't she rent a car or get a bus ticket, or hire a cab or.... But they did do a good job making every option seem absolutely impossible. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:29:37.798Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I would also think the airline companies would have tried to help her more. Or that someone would have at least offered to contact the police for help, given that this was a child by themselves. But then we wouldn't have had the fun polka moving van scene! What did you think about Catherine O'Hara as Kate?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:32:42.935Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I love Catherine O'Hara as Kate! I think she has the ability to pull off all the exasperation, anger, worry, etc. both with her voicings and facial expressions to put forth a believable Mom.  Did you like the interaction that Kevin had with Marley? \n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:38:40.558Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think I was actually more moved by the scenes with Marley than by most of the film. And it was funny because I remember having neighbors I was scared of as a kid too! But I was really moved by the reuniting of Marley with his family and Kevin with his. Why do you think Kevin kept quiet about the burglars?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:40:19.902Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree, I found the scenes with Marley very moving and I thought that it was such a good thing to portray, knowing that millions of kids would be watching this, learning something about how to treat people, how we perceive others. I always wondered why he kept quiet about the burglars! Maybe he thought he would be the one in trouble? Or that the situation was fixed because the police took care of it? I don't know. What do you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:44:07.272Z"
    }, 
    {
      "docIdx": 3, 
      "text": "If I'm not being cynical, I think he didn't want to scare his family with what happened when he was left. If I'm being cynical, I think it's because he didn't trust them or was worried they would be angry with him. Why do you think Marv liked to flood the houses as his calling card? Why not just rob them?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:47:51.312Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, I think you are right. He probably was so relieved that Kate had returned, soon followed by the rest of the family, that he didn't want to make them any more upset. I think Marv was obsessed with being a revered criminal and wanted to have a \"thing\". This just adds another element to his \"idiotic\" nature, because it would give you away more than anything! You could just get in and out without leaving a clue. I thought that is was a good addition to his character because it brought out more regarding the two men's working dynamic. Don't you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-26T20:51:14.607Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh definitely! I think he let his ego get to him. Did you like the ending with Buzz getting upset about the room?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-26T20:53:24.055Z"
    }
  ], 
  "rating": 2, 
  "status": 1, 
  "uid1LogInTime": "2018-03-26T19:46:49.899Z", 
  "uid1LogOutTime": "2018-03-26T20:53:32.994Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-26T19:46:49.932Z", 
  "uid2LogOutTime": "2018-03-26T20:54:39.516Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4400", 
  "user2_id": "USR2436", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 20
}