{
  "date": "2018-02-13T20:47:17.281Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! Have you ever seen the movie Jaws?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:48:05.755Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello. No unfortunately I haven't seen this movie. Have you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:49:46.298Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It looks like it could be a cool gore/action type of film, what do you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:50:22.860Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes I have. I originally\n saw it was I was twelve. It was very scary back then. Not so much now.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:50:27.275Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It does not compare to the gore movies of today.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:50:46.603Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can believe you have not seen Jaws. Wow. How old are you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:51:15.971Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah I know what you mean, I was rewatching the movie \"Carrie\" the other day that seemed scary when I first saw it around the age of 7. But now in my 30's it's just not as scary or interesting.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:51:34.855Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I know what you mean. I am in my fifties. When I saw the Jaws the first time it was the scariest movie have had ever seen. Now it is sort of funny with the fake shark.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:53:01.513Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am 40. I saw quite a few movies but Jaws was one that somehow slipped through the cracks. I've been to the Universal Studios \"Jaws\" set drive through that was kind of cool though. Have you ever been there. Yeah by today's standards seems like it could be kind of a campy film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:53:15.525Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah I love the modern comedy movie's that spoof alot of other films!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:53:58.477Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No I have not. Funny after I saw it, I wanted to be a marine biologist for a while. I lived in New England.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:54:15.409Z"
    }, 
    {
      "docIdx": 1, 
      "text": "HaHa,\n yeah one thing I can say about alot of the 1980's films is they were creative and original, rather than all these sequels trilogies and remakes going on now.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:55:19.254Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Have you ever seen any of scenes of the movies. I was really popular. The first scene with the girl swimming was awesome.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:55:20.284Z"
    }, 
    {
      "docIdx": 1, 
      "text": "We used to redo the scene when we were kids in the pool. Her being pulled under by the shark.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:56:08.037Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Then of course, people would try to scare you at the beach by sneaking up under you while you were in the water. Do you live where there are lots of beaches?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:57:18.704Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah the theatrical trailors made it seem kind of compelling like who was going to make it out alive. I definitely remember the theme beat of the shark movement \"dun dun dun dun\" type of thing. What do you think of this critical response where it says \"not once do we feel particular sympathy for any of the shark's victims\" was that true were the characters kind of flat in the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:57:23.950Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I felt sympathy for the victims. Maybe not for the fisherman trying to kill the shark though.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T20:59:07.410Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I live in Texas now so the closest thing is creeks and lakes but I used to live in southern California and yeah I grew up with that constant scare of sharks at the beach (probably made bigger than the actuality because of this movie) although realistically I only got to go maybe once every four years if I was lucky.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T20:59:38.834Z"
    }, 
    {
      "docIdx": 2, 
      "text": "So almost a Moby Dick kind of feel with the fisherman trying to kill the shark. So you disagree then with that reviewers opinion?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:00:24.823Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes. I thought it was a great movie. I also read the book. It was suppose to be a modern day Moby Dick.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:01:27.384Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Quint, the old fisherman, who get eaten by the shark at the end is my favorite character. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:02:02.112Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Have you ever seen one of the \"Creepshow\" films of the time where a giant blob in the ocean was pulling people under including their cars, where no one survived? I don't know why but as a kid that one was kind of scary and reminds me of a \"Jaws\" type category feel.\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:02:51.616Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No, I never saw that movie. There were tons of rip offs to Jaws. One was about a giant Octopus. it was laughable.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:03:51.365Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yean there were alot of camp movies in the 1980's that were bad acting but pretty funny to watch whether they intended to be or not.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:04:34.392Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You should really try to see the original Jaws. it was one of Spielbergs best.\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:05:27.827Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah there are certain movies where you feel more connection to the \"bad guy\" character rather than the supposed victim or \"good guy\" character just because those characters seem so vapid. I really liked a movie called \"Valentine\" with David Boreanaz that I thought was from the 1990's along those lines.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:06:11.872Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think I might have seen the sequel to that movie. Was it about a mine?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:07:16.255Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I will put \"Jaws\" on my to see watch-list. I have two children that are in early elementary and I am having them watch some of the movies I liked as a kid or that remind me of generations growing up if it's good enough when they get older I may add this to that list.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:07:52.626Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You know what, I'm not sure. I wasn't aware they had a sequel to \"Valentine\" but then again what don't they make sequel's to now-a-days to where it probably was. Was the part 2 good as well in your opinion?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:09:05.690Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Lol. The kids today are growing up with Shark Week. When I watched with my young daughter and her friend they laughed at me when I told them to hide their eyes. They knew what real great whites looked like. I think the movie I saw was a sequel or remake of the original Valentine. Very campy. It was good.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:10:54.186Z"
    }, 
    {
      "docIdx": 3, 
      "text": "This article just list's a basic summary of the film it would be a pretty dull conversation to just pull the facts from this sheet. Do you have any interesting comments or questions you can think from it? I can't think how to do this assignment by just following this synapsis sheet personally.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:10:55.251Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I know. Especially since you did not see the movie. Did you pick Jaws?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:11:29.057Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It is hard to engage with the predetermine sheets they want us to use.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:12:02.696Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I am trying to get some of the factoids in but it is difficult. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:12:41.191Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Shark Week haha that's cute. Yeah the school's are more exciting at least for the kids with all the themes they create for them. No I think it was just random, I agree. Well I think we met the 15 line minimum, what do we do now? I'm glad I got to talk to you, it was interesting.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:12:54.961Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Me too. We have one more paragraph to go over. Number four. They need better directions for this task. Last person just gave up because she did not know we have four paragraphs. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:14:24.162Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Let me tell you. At the end of the movie, when the character Brody finally kills the shark, the whole audience cheered. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:15:42.490Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I have never been to a movie where the audience cheered. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T21:16:01.704Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sorry would you mind explaining to me what we do further to close out this task? I may have misunderstood but I thought we basically discussed the movie detailed in the summary of at least 15 comments and that was basically the end of the assignment, is there another sheet to read and discuss as well? I agree with you I just want to make sure we get the credit of completing this turk. I'm sorry the other Mturker just \"boned out\" to quote Bender from Futurama. Haha this Brody guy wasn't too great then huh?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:17:33.985Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I guess this is the end?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T21:18:16.035Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-13T20:47:17.281Z", 
  "uid1LogOutTime": "2018-02-13T21:18:19.108Z", 
  "uid1response": {
    "feedback": "The conversation went fine but the details of the movie were sparce enough that it would be difficult to have a long or interesting conversation about the Jaws summary.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T20:47:17.296Z", 
  "uid2LogOutTime": "2018-02-13T21:17:16.800Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR936", 
  "user2_id": "USR1898", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 2
}