{
  "date": "2018-02-09T18:31:47.718Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi, there! Remember that old movie Jaws? Did you see it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:32:12.133Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes! It’s been forever since I’ve seen that movie ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:32:54.856Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Same here. Remember, it stars Roy Scheider. You should really see it again. I'd even forgotten it was directed by Stephen Spielberg until recently!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:33:27.014Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh you’re right! I think it was his first block buster! All I can remember is the scary music ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:34:28.098Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ha ha! That's great!  Richard Dreyfuss is in it, too. I'd say it was the real thriller of 1975!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:35:04.065Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It’s been that long! How does the technology hold up?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:35:34.806Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well, I'd say that since they consider the most frightening sequences to be those without the shark, either the technology doesn't hold up, or it does a great job regardless!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:36:39.813Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh you’re right! The music did build that tension. Wasn’t John Williams the composer for that film?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:37:35.963Z"
    }, 
    {
      "docIdx": 0, 
      "text": "You know, I honestly don't know. Seems kind of unfair, down't it. It's funny that the island they work on is Amity Island since it's a thriller-type movie, though, isn't it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:38:32.904Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yah I remember the location being the selling point since so many people were intrigued by just that!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:39:47.923Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Pulled under at a beach party on the island. I\"m sure that impacted a lot of people's summer fun. I really need to watch it again. A professional shark hunter? How do you get to be that and charge $10,000? Anyway, I gotta see it again! You should see it again, too! Always good to refresh in retrospect.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:41:20.679Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Seriously! My family are avid watcher of films so I would put that film up for consideration ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:42:35.410Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Poor shark has a bounty on his head. All he wants to do is eat vacationers. I mean, it's his job, right? I say watch it and root for the shark. None of the people are very sympathetic, anyway, and he has to defend his fin from the Diner's Club set.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:43:32.810Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You know I can recall alway being on the sharks side. The crew was kinda more corrupted if you think about it ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:44:58.265Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I totally agree. How about the amateur shark-hunting frenzy that the second death sets off? Whose water is it, anyway????? Defending its home is what I say.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:46:04.072Z"
    }, 
    {
      "docIdx": 2, 
      "text": "You’re right and who just swims in the middle of the night (that lady) in the ocean not expecting something bad to happen? She was in shark territory ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:47:28.576Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Totally! \nAnd how about the mayor protecting the tourism trade by declaring the beaches safe as soon as a couple of local fisherman catch a shark, even though no human remains are found in it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:48:24.508Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Maybe the message of the film was showing the idiocy and greed of people or so called sharks manifesting into actuall shark attacks ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:49:30.002Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I totally agree. They do find a big shark tooth in the hull of a sunken boat, though, which probably made some little kid somewhere happy. Of course when the beach is packed for the 4th of July, the real shark strikes again!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:51:51.291Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Interesting! I totally going to rewatch this film now in a newer perspective!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:53:33.771Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Same here. You know, I think it was a mistake to drop and abandon that shark's tooth, though, when he sees the corpse. I can understand being jarred by the partial corpse, but he should have totally put that tooth in his trunks. He could definitely have eBayed it in a few decades. I wonder if today they would close the beaches or just add additional safety precautions like they did in the movie (which resulted in the July 4 debacle). I can't tell if safety or tourism would win out!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:55:16.570Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You know that’s true with that! And the island was some sort of attraction too! It like even though we don’t like danger. Us humans always still want to face it. I need to analyze this movie more ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:56:53.016Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think it's great that they name their boat that they hunt the shark in the \"Orca.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:58:10.271Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Why do you think they used that water creature to label their ship?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T18:58:47.958Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't know, probably out of respect for sea creatures, ha ha!!! Anyway, I consider it poetic justice when the shark devours the bounty hunter who's after him. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T18:59:46.411Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes! They seemed meaner than the shark which as discussed may have been the intention all along", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T19:01:30.054Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree. They have to stuff a pressurized scuba tank in his mouth and then shoot it from afar, causing it, and the shark, to explode. Totally rude. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T19:02:27.488Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes but hey those sequels show that the shark had the last laugh since their babies took the reigns ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-09T19:03:38.828Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Really? I didn't know that! That's awesome! Well, I guess if the shark got it in the end, at least he told them that they can call anything they want to a \"shark proof cage,\" but that don't mean nothing. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-09T19:04:23.268Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-09T18:31:47.718Z", 
  "uid1LogOutTime": "2018-02-09T19:05:36.632Z", 
  "uid1response": {
    "feedback": "I've seen bits and pieces of it. I mostly remember the SNL parody.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-09T18:31:47.856Z", 
  "uid2LogOutTime": "2018-02-09T19:03:42.070Z", 
  "uid2response": {
    "feedback": "It was a great conversation! I’m really enjoy this ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR338", 
  "user2_id": "USR3374", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 2
}