{
  "date": "2018-03-27T18:05:41.730Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello! Do you agree with the ratings of this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:06:28.699Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello! I think Rotten Tomatoes should have given it a higher score, I thought it was better than just average. What about you\n?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:07:13.482Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree that it was better than average, but after reading some critical responses I can see where they are coming from in their scores.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:07:37.010Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can agree with that as well. Did you like the movie overall then?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:08:15.350Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did like the movie, but it was rather predictable. I agree with the statement that the beginning is flat and unsurprising since you can imagine how the plot will proceed based off of the title alone.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:09:10.400Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree. I felt like I can totally agree with the statement saying its totally the kind of traps that any 8 year old could devise if he had a budget of ten thousand dollars and a film crew. I don't think any 8 year old could do all of th\nat. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:10:35.348Z"
    }, 
    {
      "docIdx": 0, 
      "text": "sorry that.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:10:49.389Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Agreed. His traps definitely make the film seem implausible; but the slapstick humor certainly can be enjoyed by some.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:11:39.249Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Who was your favorite character in the movie comedy wise?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:12:06.396Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Comedy wise, I enjoyed Kevin the most. He was enjoyable in the final scenes, and the stunts he did lend him to being the most humorous I believe.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:13:24.408Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Totally. Could you believe the scene with the winds causing a power outage, what bad luck.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:14:45.106Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It did seem like bad luck, but almost too much of a coincidence that it would happen to them and cause their alarm clocks to malfunction exactly the night before they needed to be awake early for their trip.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:15:19.260Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Agreed. Do you usually watch movies with an average score?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:16:15.660Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I like to watch movies that I find interesting based off of their trailers mostly, but critic scores do have an effect on whether I will pay see a movie while it is still in theaters. I'm not sure I would pay to see a movie at the cinema that is only a 5.5/10 on rotten tomatoes.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:17:16.317Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I feel the same way. I feel like Rotten tomatoes can be harsh sometimes as well. I mean look at the CinemaScore, it gave Home Alone an A.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:18:21.481Z"
    }, 
    {
      "docIdx": 2, 
      "text": "But it can also be accurate! Do you think that the plot could be predicted before the scene when Kevin wishes his family would disappear? Or did that scene make you realize what was happening... or even maybe you didn't realize it until it happened?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:19:35.565Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That scene made me realize what was about to happen. Like the universe was aligning with this 8 year old boys little wish. I could not believe it took the family until Mid flight to notice he was missing.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:20:37.701Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree, I feel like if I had a family that large, I would be checking and counting constantly to make sure I had all of my family members always present.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:21:20.012Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Right always doing a head count constantly", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:21:42.160Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you think it was probable for all of the flights they needed to get home to really be booked like they were?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:22:33.613Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No, I feel like they could have found something, again everything going the worst it could.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:23:19.562Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, it seems unlikely that so many things could go wrong with their trip and they never caught a break.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:24:02.764Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I do love the final scene though when the family returns what about you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:24:30.979Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, it was touching that they were able to reunite on Christmas day.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:25:04.827Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I loved the way he was so disappointed\n and then they made an entrance of course.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:26:21.009Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was crazy that Kevin was able to hide everything that happened - almost!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:26:57.347Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You can never hid everything from your family, someone will always find out something happened one way or the other I feel like.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:27:29.555Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's true. I wonder what Peter was thinking when he found the gold tooth on the floor.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T18:28:05.755Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Overall, I would say I did enjoy the movie and if I had to give it a rating out of ten I would have given it a 5.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T18:28:11.306Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-27T18:05:41.730Z", 
  "uid1LogOutTime": "2018-03-27T18:28:08.120Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-27T18:05:41.775Z", 
  "uid2LogOutTime": "2018-03-27T18:28:13.902Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1260", 
  "user2_id": "USR4150", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 20
}