{
  "date": "2018-03-02T00:25:20.159Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hmmm what do you think about The Social Network?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:27:01.389Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think it was a really interesting movie. I think I liked it more because I am a Facebook user so it was more relatable. What did you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:27:34.936Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I love the people who play in it. They are excellent actors and with it being about Facebook, it's super relatable to anyone watching it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:28:21.609Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you have a favorite character or actor? I really liked Jesse Eisenberg in this movie as mark Zuckerberg ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:28:59.586Z"
    }, 
    {
      "docIdx": 0, 
      "text": "He was really good, I really liked how well Andrew Garfield did as Eduardo Saverin. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:29:45.349Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What do you think of having Saverin being consulted for the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:30:31.522Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think that was a good idea. But I have to wonder how accurate the whole movie is since Zuckerberg didn't get to consult on the movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:31:51.007Z"
    }, 
    {
      "docIdx": 0, 
      "text": "and he is the founder!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:31:53.934Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do find it interesting they didn't get him in on the movie. I wonder if it's because he refused to do it or they  decided just not to contact him?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:32:51.501Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think he didn't want to get involved with the whole Hollywood scene and perhaps the movie doesn't make him look as good as he would like", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:34:38.569Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Because in the movie, Facebook started as a whole Hot or Not program, which is slightly offensive haha ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:34:56.472Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's what I was thinking. I figured the movie made him look like a bad guy and he didn't want to get anything additionally bad tagged to him. That and he may be trying to stay away from the lime light with something like that", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:36:13.367Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think that the Winklevoss twins also looked bad in the movie, like they were trying to take credit of everything.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:37:05.914Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It looks like it! I'm wondering if they were trying to just make him do the dirty work and them get all the ladies for it or if they could really see the big picture with Facebook and it's future", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:38:55.880Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's a good point. I remember when this movie came out and everyone was talking about it. Do you think this movie was successful?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:40:49.194Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think initially it definitely successful. I don't know if it was impactful. You think this will be a classic movie that is remembered or just another controversial movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:41:27.735Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think that it is a classic movie just because not many like it have been made. But I also think a lot of its success came from the Facebook craze and not the quality of the movie itself", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:42:59.402Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think it will be definitely remembered for this time era. With the different controversies that went with it, which one do you think was most surprising? The sex, money or betrayal? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:45:21.613Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think the betrayal was more surprising because it started as a team effort so it was sad to see the team members become greedy", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:46:40.456Z"
    }, 
    {
      "docIdx": 2, 
      "text": "What do you think of the phrase 'facebook me' you think it's almost as popular as saying to 'google' something?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:49:33.131Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes I think that Facebook is definitely the most widely known social network. Even if it's not as popular as it used to be, everyone I know still uses Facebook almost daily.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:50:19.158Z"
    }, 
    {
      "docIdx": 2, 
      "text": "DO you think scene 1 or 2 was more interesting ?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T00:51:28.828Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I like scene 2. It shows the initial growth of facebook and kinda gives it a look into what it is now. What do you think is better? The first or second scene?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T00:52:34.913Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I like scene 1 because it shows the true nature of Facebook's beginnings and explains how Zuckerberg managed to scale up and develop the project.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T01:00:07.475Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What do you think if it essentially starting as a dating website?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-02T01:01:17.335Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think it's very interesting how the movie emphasizes Facebook's start as a romantic connection website and how it shifted into primarily being aimed towards connecting with friends and acquaintances ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-02T01:02:33.606Z"
    }
  ], 
  "rating": 3, 
  "status": 0, 
  "uid1LogInTime": "2018-03-02T00:25:20.159Z", 
  "uid1LogOutTime": "2018-03-02T01:03:20.193Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-02T00:25:20.252Z", 
  "uid2LogOutTime": "2018-03-02T01:02:52.926Z", 
  "uid2response": {
    "response": [], 
    "type": "abandonWithoutAnsweringFeedbackQuestions"
  }, 
  "user1_id": "USR1839", 
  "user2_id": "USR3567", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 17
}