{
  "date": "2018-02-14T22:16:11.861Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:16:56.055Z"
    }, 
    {
      "docIdx": 0, 
      "text": "hello, have you ever watched the avengers?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:19:24.636Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No. What's it about?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:19:33.985Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's a take on the Marvel Universe, an American superhero film, where a team known as The Avengers are recruited to S.H.I.E.L.D to stop Thor's brother Loki from taking over and destroying Earth. Pretty epic I might add. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:21:15.516Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That sounds interesting. Who's in it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:21:40.555Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Tony Stark as the one and only Ironman. Chris Evans as Captain America. Mark Ruffalo as Hulk. Chris Hemsworth as Thor. Scarlett Johansson as Black Widow. Jeremy Renner as Hawkeye. They are rather witty, and entertaining. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:23:13.134Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Those are some really famous actors from what I've heard. Is it a new movie or has it been out for a while?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:23:49.539Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's been out since 2012, but still is very popular, as there are sequels now. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:24:45.066Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh cool. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:25:03.938Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Rotten Tomatoes has given it a 8/10, and cinemascore rates it an A+", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:25:23.113Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's a pretty good rating. Do you know if it was popular with the critics?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:25:45.705Z"
    }, 
    {
      "docIdx": 1, 
      "text": "69% ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:26:20.602Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Could be better, could be worse I suppose", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:26:28.858Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah. But if it got an 8/10 on Rotten Tomatoes, I feel like audiences must have liked it when it came out.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:27:02.565Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Definitely. The story is really compelling. Loki, the villain, encounters an exterrestial race known as the Chitauri. For obtaining the Tesseract, a powerful energy source, Loki is promised an army which he can take over Earth. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:28:21.356Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That sounds intense. Why do the Chitauri want the teseract?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:28:50.973Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Because it is a powerful energy source with an immeasurable power. It opens wormholes among space and planets, allowing Loki, and the Chitauri to go where they want and have immense power hopping to the wormhole allowing the Chitauri to immerge on Earth.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:31:41.339Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh. That makes sense. So is Loki from Earth? Or is he from another planet?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:32:23.219Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Loki and Thor are from Asgard. Another dimension of the sorts. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:32:58.452Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Ok. So there's other planets and dimensions in this movie. Sounds like Sci Fi. Would you say it's more Sci fi or Fantasy? Or a different genre?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:33:32.604Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I would say a drama, superhero genre with sci fi and fantasy elements. The Avengers are superheroes formed by S.H.I.E.L.D. to take down extraterrestrials like these Chitauri.The superhero genre seems to be growing since this movie to be honest. It's definitely a superhero vs. villain complex. But the aliens, and the dimensions/planets, ect give it the sci-fi element. With the superhero powers, and supernatural aspects, you could add the fantasy into it. But again, mainly a superhero drama with those smaller elements.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:36:27.538Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I would highly suggest you to watch this movie, as it's deep on many elements to begin with. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:37:20.176Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That sounds compelling. What makes it deep?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:37:51.924Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well you have different avengers wanting to approach the problems Loki has brought on Earth differently, which poses a separation in the group, providing another element of drama. While they all argue, Barton and Loki's other possessed agents attack Hellcarrier, disabling an engine, and at the same time, the Hulk emerges making a bigger mess. Stark (Ironman) and Rogers (Captain America) realize that it's not only defeat Loki wants, he wants to overpower them and take over Earth pubically. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:41:57.177Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That sounds like a lot happens at once. This movie must have a lot of action. So Loki has possessed agents. Can he do mind control?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:43:36.343Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It brings out the them having to work together to move forward. For instance, Starks and Rogers must work together to get the engine to run again. And yes, he most certainly can by using the Terrasect and a device Sevig built to open a wormhole over Stark Tower \nin New York City. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:46:03.215Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Who is Sevig?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:46:52.224Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Dr. Erik Selvig is a physicist that was researching the Terrasect before it was taken by Loki, who enslaved Dr. Selvig. He was used to learn more about the Terrasect. It turns out that Loki put the Terrasect in his sceptre to begin controlling people. He also, built a machine to help the Chitauri come to Earth.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:50:21.438Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh. Ok. It sounds like there's a lot going on with this movie. If I've never watched many super hero movies, is this a good one to be my first watch?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:51:06.736Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Definitely. It's one of the best superhero movie series, which is now a trilogy. As you said the ratings are high in this movie's favor. Many people like it to give it an A+, and 8/10 as an average score. An 8/10 on any movie is a good score in my opinion.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:52:44.923Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's true. Well thanks for telling me about the movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T22:53:35.659Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Your very welcome. Ty for being interested.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T22:53:53.327Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-14T22:16:11.861Z", 
  "uid1LogOutTime": "2018-02-14T22:53:57.820Z", 
  "uid1response": {
    "feedback": "I love this movie. It was a good one for me to describe because I understood the movie to begin with.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-14T22:16:11.912Z", 
  "uid2LogOutTime": "2018-02-14T22:53:57.056Z", 
  "uid2response": {
    "feedback": "I'm not sure I would watch this movie after the other user's explanation. It seems like a complicated plot with a lot of characters to follow and not much explanation of who those people are. I was a little confused when the other user was describing the plot.", 
    "response": [
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4851", 
  "user2_id": "USR2455", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 7
}