{
  "date": "2018-03-01T19:18:39.534Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi I really enjoy this movie I especially love how Frank Abagnale is so young but able to pull of these cons", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:19:22.008Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I was not aware that this was a Spielberg film. It feels so different than his other works", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:19:58.947Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah I guess it seems more focused on a smaller story arc than other movies by Spielberg. Great casting choices though really round it out with Christopher Walken and Leonardo DiCaprio and Tom Hanks", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:21:39.588Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The fact that the FBI hired him because he was so great at check fraud is great.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:22:24.063Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Or the fact that he claimed to be both a doctor and a lawyer and everyone just accepted that", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:23:00.213Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Its such a funny movie that i forget its a Crime film", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:23:14.848Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah it doesn't really seem to fit in that genre because of all the comedic elements and the fact that they put the criminal in such a good light with his different jobs and cons.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:24:07.704Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Frank Abagnale lived such a crazy life that it is almost hard to believe that this move is based on his actual life and not just a work of fiction", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:25:22.434Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah it would be hard today to constantly reinvent yourself, even in the 1960s he eventually got found out. Maybe if the movie, and the true story, was set a little earlier they never would have caught him", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:26:47.508Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Thats true. Especially with the check fraud. They basically took him at face value", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:28:16.575Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I guess maybe they didn't think a clean-cut kid would do something like that. The new document we just got jogged my memory about the French class scene and I think its just another example of a clean-cut kid being able to get away with murder by just acting the part", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:29:58.049Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He was very resourceful. Most children who run out of money would end up heading back home after running away", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:30:58.458Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's true, he must've really been shattered by his home life. Its a little sad actually. I think DiCaprio did a good job of conveying that betrayal you really saw it in his face at different scenes. \n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:32:29.965Z"
    }, 
    {
      "docIdx": 1, 
      "text": "His acting was top notch in this. I also always forget that Amy Adams was in this!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:34:09.155Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh wow that's right. It must have been one of her earliest big works. It was kind of a bad situation for her character though just getting taken for a ride by the 1960s equivalent of a catfish", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:35:38.451Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He catfished every one. The Louisiana Bar association, the Georgia Hospitals. Pan Am. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:37:16.348Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh boy just remembered the ending, that scene was so sad with him looking through the window at how he basically was replaced!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:38:52.336Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That was so sad! i remembered watching the scene where Carl is waiting for Frank to walk in on monday. Part of me didnt believe he was going to come through that door", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:39:45.603Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah that ending seemed a little too perfect, I wonder if that is how it happened in real life. It is great though how he was able to switch right back to being an airplane pilot. Like I imagine him just getting up in the morning and deciding on a whim to be a pilot for the day.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:41:04.356Z"
    }, 
    {
      "docIdx": 2, 
      "text": "You have to be so confident in your skills. He even straight up told carl that the check was fake. Just to prove how good he was. He didnt need to help carl out. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:42:03.898Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think it was smart for him to do though, maybe it was another con when he just decided to be a good old boy and join the FBI", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:42:29.542Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I wish that I had the skill to just choose to fly a plane. Like, i can see how you fake being a lawyer. You can study and read different laws. But flying planes, and surgery. You dont get too many chances to practice. and those are life and death situations. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:43:58.203Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think being a pilot would be easier than a lawyer, because when he was a pilot he had help from the other pilots but as a lawyer he is kind of stuck up there by himself. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:45:05.722Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thats true i suppose. What i really like about this movie, is that at the end you see that he is one of the people who put alot of work in making checks unforgeable. Its almost like a test to other forgers. You have to beat Frank Abagnales test to prove your worth", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:46:58.913Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And by working for the man instead of fighting him he was able to make even more money and didn't have to run. Maybe it was the ultimate con", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:47:37.478Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Ahh, yes. That long con. Though 2.8 million isnt something to thumb your nose at. Especially in 1960's money. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:48:45.213Z"
    }, 
    {
      "docIdx": 3, 
      "text": "that's true plus I wonder if the government ever found all of the money he stole. I think that was left ambiguous in the movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:50:47.756Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, it was a sort of a nod and wink. Like this is what we KNOW he has. Over all though. I agree with the rotten tomatoes score for this. and i usually find those to be either way too high or low. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:51:58.590Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I am more partial to metacritic usually. I would think the movie would score a little higher than 76. Maybe if got some more attention today it would do better.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:52:49.279Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-01T19:18:39.534Z", 
  "uid1LogOutTime": "2018-03-01T19:52:54.750Z", 
  "uid1response": {
    "feedback": "I had a great conversation about the movie!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-01T19:18:39.653Z", 
  "uid2LogOutTime": "2018-03-01T19:52:41.765Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2809", 
  "user2_id": "USR1292", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 19
}