{
  "date": "2018-02-21T17:31:12.425Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hi the movie is here despicable me would you be interested in learning more about it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:32:50.902Z"
    }, 
    {
      "docIdx": 0, 
      "text": "yes of course. tell me about it!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:33:18.935Z"
    }, 
    {
      "docIdx": 0, 
      "text": "this movie is animation based and its a comedy movie but also awesome graphics that would entertain any kids", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:35:14.088Z"
    }, 
    {
      "docIdx": 0, 
      "text": "that sounds pretty interesting. do you know any of the storyline of the movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:36:18.131Z"
    }, 
    {
      "docIdx": 0, 
      "text": "yes, a\n man who delights in all things wicked, supervillain Gru (Steve Carell) hatches a plan to steal the moon. Surrounded by an army of little yellow minions and his impenetrable arsenal of weapons and war machines, Gru makes ready to vanquish all who stand in his way. But nothing in his calculations and groundwork has prepared him for his greatest challenge: three adorable orphan girls (Miranda Cosgrove, Dana Gaier, Elsie Fisher) who want to make him their dad.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:37:19.276Z"
    }, 
    {
      "docIdx": 0, 
      "text": "wow steve carell and miranda cosgrove are some pretty big names in this film. little yellow minions sure can attract the views of a child, which is why i see why you said the movie would entertain any and all kids. is gru successful in stealing the moon?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:39:28.026Z"
    }, 
    {
      "docIdx": 0, 
      "text": "yes he did successfully stole the moon but Do you generally watch movies with (good/bad) ratings? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:41:11.953Z"
    }, 
    {
      "docIdx": 0, 
      "text": "i try to look beyond the ratings if i want to see the movie. but yes typically so", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:42:00.005Z"
    }, 
    {
      "docIdx": 0, 
      "text": "ok the ratings are Rotten Tomatoes:81% and average: 6.8/10 Metacritic Score: 72/100 \nCinemaScore: A", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:42:41.928Z"
    }, 
    {
      "docIdx": 1, 
      "text": "rotten tomatoes having a score of 81% is pretty high! the movie must be very highly liked among lots of people", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:43:24.860Z"
    }, 
    {
      "docIdx": 1, 
      "text": "yes theres even people that commented \"Short, sweet-and-sour, and amusing rather than funny, Despicable Me can't help but be\nlikable.\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:44:42.967Z"
    }, 
    {
      "docIdx": 1, 
      "text": "did anyone comment any really negative things about the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:45:43.119Z"
    }, 
    {
      "docIdx": 1, 
      "text": "surprisingly i see none who commented negatively to this movie\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:46:37.946Z"
    }, 
    {
      "docIdx": 1, 
      "text": "thats crazy. must be a really great film! what do you think of it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:47:30.491Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think its a great movie with awesome 3D cartoon that will make kids go crazy for it", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:48:22.284Z"
    }, 
    {
      "docIdx": 2, 
      "text": "i agree. maybe i will go to see it. seems like a really really popular movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:49:22.336Z"
    }, 
    {
      "docIdx": 2, 
      "text": "yes you will also love even if ur adult thank you enjoy the movie", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:50:01.237Z"
    }, 
    {
      "docIdx": 2, 
      "text": "thank you for explaining it to me i will ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:50:46.373Z"
    }, 
    {
      "docIdx": 2, 
      "text": "let me tell you more about the movie ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:51:20.518Z"
    }, 
    {
      "docIdx": 2, 
      "text": "yes tell me more", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:51:48.185Z"
    }, 
    {
      "docIdx": 2, 
      "text": "this is another key lines of the movie Eventually, Gru and the girls arrive at Vector's fortress, and Gru steals the shrink ray. The\ngirls then suggest a day at a theme park; Gru agrees, believing he can abandon the girls\nthere, but instead he warms up to them. Later, Gru contacts Perkins via video chat, stating\nthat he finally has the shrink ray. Margo, Edith, and Agnes interrupt the meeting, and\nPerkins announces that he has lost confidence in Gru and will no longer fund his\noperations. As Gru tells the Minions he can no longer pay them for their services, the girls\noffer the contents of their piggy bank. Gru, inspired, sells parts of his lair to construct a\nspacecraft. Gru plans to steal the Moon when it is nearest the Earth, but this is the same\nday as the girls' ballet recital. Gru becomes conflicted, and Dr. Nefario, seeing the recital as\ninterfering with the plan, arranges for the girls to be returned to the orphanage. At the same\ntime, Perkins informs Vector, revealed to be Perkins' son, of Gru's possession of the shrink\nray and the adoption of the three girls, encouraging Vector to act. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:51:54.208Z"
    }, 
    {
      "docIdx": 3, 
      "text": "wow i cant believe that Gru has to deal with these little girls while hes trying to steal the moon. talk about being side tracked. the girls love gru and his minions though so thats great", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:53:50.186Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Gru successfully shrinks and steals the Moon, and rushes back to Earth to attend the\nrecital—only to find a ransom note from Vector, who has kidnapped the girls. After arriving\nat Vector's headquarters, Gru surrenders the Moon, but Vector reneges on the deal, flying\noff with the girls and the Moon. Meanwhile, Dr. Nefario has discovered that the effects of the\nshrink ray are temporary; the bigger the object's original size, the faster the shrinkage will\nwear off. As the Moon starts to expand in Vector's ship, Gru, Dr. Nefario, and the Minions\nexecute a daring mid-air rescue of the girls just as the Moon explodes out of Vector's ship\nand launches itself back into orbit, with Vector trapped on it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:54:44.599Z"
    }, 
    {
      "docIdx": 3, 
      "text": "wow. rest in peace to Vector but gru didnt think he can actually get away with stealing the moon did he? :/ hopefully he didnt. this movie has so many twists and turns i cant even begin to imagine how colorful the 3d cartoons look", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:56:44.966Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yes he might have stole the moon but effect of the shrink ray are temporary and yes I agree its a colorful visual movie", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:58:22.581Z"
    }, 
    {
      "docIdx": 3, 
      "text": "really really interesting plot line hope it was a happy ending", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T17:59:16.241Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yes", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T17:59:32.118Z"
    }, 
    {
      "docIdx": 3, 
      "text": "i think i will go watch it", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T18:00:20.234Z"
    }, 
    {
      "docIdx": 3, 
      "text": "you will enjoy it thank you ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-21T18:00:43.904Z"
    }, 
    {
      "docIdx": 3, 
      "text": "thank you!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-21T18:00:50.880Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-21T17:31:12.425Z", 
  "uid1LogOutTime": "2018-02-21T18:00:52.636Z", 
  "uid1response": {
    "feedback": "the users description of the movie was extremely interesting and the way the plot sounded makes me really want to go see the movie. i will watch it!", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-21T17:31:12.503Z", 
  "uid2LogOutTime": "2018-02-21T18:00:54.264Z", 
  "uid2response": {
    "feedback": "great chat", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2461", 
  "user2_id": "USR621", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 16
}