{
  "date": "2018-02-07T19:24:27.286Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hey let's talk about the movie Inception", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:25:39.528Z"
    }, 
    {
      "docIdx": 0, 
      "text": "So Leonardo DiCaprio infiltrates peoples' dreams in this movie", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:27:18.729Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Cool, is that the movie with Leo decaprio", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:27:18.915Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes it is", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:27:28.338Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I remember seeing the previews for that", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:27:39.618Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, he and Joseph Gordon-Levitt are pretty big parts in the movie. Gordon-Levitt (Cobb in the movie) manages and researches the missions", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:28:09.642Z"
    }, 
    {
      "docIdx": 0, 
      "text": "So are the missions to steal information like nuke codes that someone has in their mind", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:28:42.414Z"
    }, 
    {
      "docIdx": 0, 
      "text": "They do corporate espionage by getting in the subconscious of their targets and get the valuable info through the shared dream world", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:28:57.960Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ellen Page was Ariadne in the movie. She was the graduate student architect that DiCaprio (Cobb) recruited to reconstruct the various dreamscapes", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:29:51.549Z"
    }, 
    {
      "docIdx": 0, 
      "text": "how do they get into the targets minds don't they need some kind of connection", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:30:25.816Z"
    }, 
    {
      "docIdx": 0, 
      "text": "So I guess that the target of Dicaprio and gordon levitt was a Japanese businessman who then revealed he arranged the mission himself to see if they could plant an idea in someone else's head", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:31:58.107Z"
    }, 
    {
      "docIdx": 1, 
      "text": "sounds like it has a lot of twists in it", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:33:24.054Z"
    }, 
    {
      "docIdx": 1, 
      "text": "definitely.I guess the Japanese man (Saito) wanted to break up the energy conglomerate of Maurice Fischer by convinving Fischer's son and heir to dissolve the company", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:34:41.649Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's a good way to do it lol, was it successful?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:35:34.800Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm not sure...\nSaito (the Japanese Business man) involved with Dicaprio (Cobb) sedates Fischer's son after Maurice dies", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:36:54.852Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Well its sounds like a good movie to see as long as you are able to pay attention to it and not be in a room full of kids or something", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:37:44.701Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree. You should definitely watch it without kids", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:37:56.750Z"
    }, 
    {
      "docIdx": 1, 
      "text": "it's a complicated movie...I guess the guy's mind that they sedated was set up to protect against intruders in his dreams and it backfires and DiCaprio starts to die in the dream", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:39:06.804Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Will have to see if it on Netflix or something", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:39:07.047Z"
    }, 
    {
      "docIdx": 2, 
      "text": "SO they do have blocks in place", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:39:34.424Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I guess so", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:39:41.843Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well, like I said sounds like a good movie and I like those actors they almost always in decent films even if they are not my style - Titanic comes to mind", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:42:39.203Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Despite what happened the mission was still continued. DiCaprio was sent into like a limbo because he was dying in the dream and the sedative was strong. I'm not sure who Mal is but he apparently went into Limbo with her and spent fifty years in a dream reconstructing favorite shared memories. She refused to come back to reality and ended up killing herself and framing Cobb for her death to try and get him to kill himself. Cobb ends up fleeing the us because he was framed and left behind his kids with Professor Miles (I think Gordon Levitt)", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:43:53.178Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yea I mean the movie has an average rotten tomatoes score of 86% so it's a good watch", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:44:16.066Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you generally like movies like this?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:45:52.051Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Espionage, murder, framejob, all sounds good for a movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:45:58.765Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And a little bit of love.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:46:34.756Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I liked how they had an object (totem) to help discern dreams from reality. They used a top as a totem. If it was a dream, the top would keep spinning. In reality the top stops spinning", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:48:40.138Z"
    }, 
    {
      "docIdx": 3, 
      "text": "like a spinning top", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:48:53.879Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes but it depends on the story line meaning if its believable or not. There are some future set movies that make no sense if you think about it. This one actually sounds like this could be something like this in the future. Reminds me of old keanu reeves movie Jonny Mnemonic movie for some reason", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:48:55.148Z"
    }, 
    {
      "docIdx": 3, 
      "text": "the top is based on what most people say about out of body/dreaming in real life that you have to have a lifeline or object that is your anchor to the real world", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:50:11.396Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh I did not know that. Very cool... I guess ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:50:48.422Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yea Scientific movies can be unbelievable. But I mean the ratings are pretty good. I feel like sometimes reading a plot synopsis after watching a movie helps me to put it together", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:52:04.167Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's just cool though. The architect grad student ends up killing Mal's projection ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:52:59.494Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Mal was the one who framed cobb when she killed herself to try and get him to kill himself", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:53:17.106Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I prefer user ratings to critics as they tend to like whatever they like. with users you get at least an overall sense if the movie is worth seeing or not", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-07T19:53:56.952Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I get that. I think the IMDB score was 8.8, I think those are user ratings. Not sure, you could look that up though?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-07T19:54:29.670Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-07T19:24:27.286Z", 
  "uid1LogOutTime": "2018-02-07T19:54:48.690Z", 
  "uid1response": {
    "feedback": "sliated eht ll a teg ot flesym eivom eht ees dna erom tuo dnif ot tnaw em edam stneve eht fo noitpircsed ehT", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-07T19:24:27.327Z", 
  "uid2LogOutTime": "2018-02-07T19:54:32.426Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4628", 
  "user2_id": "USR1277", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 5
}