{
  "date": "2018-02-13T23:50:14.759Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "What did you think about La La Land?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:51:48.003Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought it was okay. I'm not usually a fan of romantic comedies but this one was pretty good", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:52:31.619Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am not big into musicals for the most part, but this one was decent. How did you like the setting?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:53:45.280Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I feel hollywood settings are in general over done, but the movie spoke to me on another level. It was engaging and distracted from the cliche. I understand the movie wasn't really about the setting but about other things like dying dreams or persuing something though you know you might not succeed. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:55:23.803Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think a Hollywood backdrop was ideal for the telling of a story about dreaming, and perhaps losing those dreams somewhere along the way. Ryan Gosling is not the greatest actor in the world. So that is a solid minus.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:57:09.696Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, it worked for the story, but I'd prefer another setting occasionally. Ryan Gosling has his looks, but isn't Leonardo. I like him a lot better. I wish Leonardo would have been able to play the role more than Ryan.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:58:15.175Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I can completely agree with the Leonardo idea. It got pretty good ratings. I do not really know what the percentage on Rotten Tomatoes means for sure tho. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:00:24.837Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I guess the rating means how much people like it in general? It looks like it got pretty good ratings from other people. I'm not sure I would have rated it that high personally. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:01:36.343Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I would not rated it that high. It seems to be sorta saggy in the middle like most romance movies.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:04:37.467Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I find a lot of movies actually have this lull period. Romantic comedies do have more than most. I also find it only satisfying based on the ending of the movie. If it's too sweet, I roll my eyes. If its bitter, it's not a romantic comedy at that point. It's a fine balance, which La La Land pulled off decently. I wouldn't say it could go to the Oscars though", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:06:35.818Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I did not really get why Sebastian would play something outside the setlist of Christmas songs. It was to setup the girl seeing his passion, but you are getting paid to play. Do your job.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:09:34.667Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, I know right? It makes him seem even more like a snob more than the rest of the movie. He could have just as easily played a christmas song with improv, like Jaz is famous for, and shown his passion through that song. It's what a great musician does. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:10:50.392Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I would also assume most women are not wanting to compliment or date a freshly fired man, but romantic comedies also show such foolishness. It is much harder to chat to a random person than I thought. Isn't it a bit odd for you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:14:45.027Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, romantic comedies aren't really known for their rational thought process. A lot of decisions seem based on folly and 'love'. They describe love in a way that would never make sense in the real world. I'm actually okay talking to you. I wrote my thesis on animated films so it's similar enough that I do just fine. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:16:43.992Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I would think  a romance that embraced the cold, rational world could actually show emotion better than a sugar-coated tale. I am not an artist so what do I know anyway. Also if the fellow is in a pop cover band. Then I would assume his life of being a serious musician is over.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:20:50.201Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah. I agree with that one. I'm not in the theater to avoid the harsh realities of the world. I go to see someone overcome the world in a way. To see things can get better. It's my favorite part anyway. A pop cover band does seem a dead end path, so I didn't understand why he would even choose that one. Just because he was fired from one spot doesn't mean he can't go to another? And if the city is so dead, why not move to another city? There were just so many questions left open ended.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:22:46.820Z"
    }, 
    {
      "docIdx": 2, 
      "text": "They then move in together and the fellow is offered steady pay, and he takes it. I thought this guy was so passionate he would get fired for not following a set list, but he will do this for her. I just do not buy it. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:29:35.642Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He did seem to change personalities in the movie a lot. They make it seem like the guy is always required to fill a certain role. Then the girl sees his sacrifice. I'm just not a fan of that particular type of romance. It doesn't feel real. I thought it was fun enough, but these are some of the big pot holes in the movie. Besides, why would she be so 'disturbed' by the fact he was doing it? The intentions and depth of character doesn't seem to be there for me.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:32:05.373Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, she would not be disturbed. I could see feeling somewhat guilty. IF the band is being successful just ride the gravy train. Then when you get enough cash do what you want. So many great artists have followed paths like this, but it is rarely in movies.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:36:23.087Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree with you. It seemed more natural to feel moved and deeply connected to him because he would make a sacrifice except his sacrifice was not exactly a sacrifice. I mean, most people would kill for a chance to play in front of an audience. His sacrifice was that he was a snob and he had to 'lower' himself to some station beneath him. This is not the kind of guy to end up with. It makes him seem arrogant. This type of guy usually ends up being the villain but because its a rom com it's okay.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:38:41.105Z"
    }, 
    {
      "docIdx": 2, 
      "text": "This would be significantly easier if I had actually watched this movie. I can get the idea from this written format, but this is pretty tiring. Did you watch this movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:43:58.949Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I haven't seen it. I heard it was a rom com and avoided it. I usually prefer suspense, action thrillers, sci fi and the such.This sounds actually kind of bad for a rom com. Maybe it was better watching the movie than reading it. The scenes just sound so bad.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:45:39.363Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah. This truly does sound horrible, and that is why I avoided it like the plague. So this next scene they get into an argument, he misses her play and the play sucked(surprise). That is some truly horrible writing and setup. I think it would best if these two stay away from each other.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T00:49:44.682Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They really don't seem like they should end up together. THough, it would have been ingenius to actually set it up this way and have him realize how stuck up he had been, go and apologize heart felt then try to help her out more. Just missing the play and having her go away seems like it wouldn't influence him out of such behavior though. Then maybe she could agree she hadn't been the best either. Maybe he then tries to 'follow his dreams' in a bit nicer more down to earth fashion and she can follow her dreams in such a way as well. I'm not sure. It sound better that way to me. Not realistic still though", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T00:52:59.437Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That does seem a bit abrupt, and I do not know what purpose it serves in the narrative. It would feel much more real if she stayed and just wallowed in her guilt while he wasted away doing something he actively disliked. Their love would be keeping them together in the most tragic way possible.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-14T01:00:50.965Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Then it wouldn't be a rom com. It would just be drama. That's kinda funny in it's own way though. Well, in the story, it needs some sort of saving grace. He needs at least to be more grateful and get off this tangent he's on. She needs to say something about it and grow up. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-14T01:02:31.013Z"
    }
  ], 
  "rating": 2, 
  "status": 0, 
  "uid1LogInTime": "2018-02-13T23:50:14.759Z", 
  "uid1LogOutTime": "2018-02-14T01:04:14.431Z", 
  "uid1response": {
    "feedback": "It was quite difficult to chat about something I had not watched. The other user was decent at conversation so it went okay.", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T23:50:14.796Z", 
  "uid2LogOutTime": "2018-02-14T01:04:01.935Z", 
  "uid2response": {
    "response": [
      2
    ], 
    "type": "abandon"
  }, 
  "user1_id": "USR1928", 
  "user2_id": "USR1075", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 3
}