{
  "date": "2018-03-01T19:09:51.130Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "The movie is How To Train Your Dragon. I think it's an excellent moving to watch due to the emotional possibilities", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:10:43.527Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What is the movie about?  I am looking to watch a movie with my kids this weekend, but want to make sure it is a kid friendly movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:11:27.000Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is an animated film that is great for both kids and adults alike. It is fantasy film that involves a friendship between a man and a dragon.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:13:11.074Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sounds like a movie that my children and I would love to see.  Is it a fairly new movie or been out for awhile?  I am assuming the man trains the dragon, but what is he training it to do?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:14:16.206Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was made in 2010, so it has been out for a bit, but it isn't outdated. I'm not sure exactly how he trains the dragon, but it is based off of a book.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:16:11.644Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I see, I wonder if I should read the book first?  I try not to do that because the book will typically ruin the movie for me.  The movies can never quite capture the details or feelings I get from a book.  Well I will definitely have to give the movie a try and see what it is all about.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:17:55.034Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think you will love the onscreen adaption of it. It's got witty animation and intelligent dialogue. The animation paired with the content will be perfect for you and your children. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:19:05.360Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That sounds great!  Well I think I have made my decision and I thank you for your time and insight.  Have a great day!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:21:05.264Z"
    }, 
    {
      "docIdx": 0, 
      "text": "You're welcome. I am glad I could help you! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:21:33.855Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Now if I could only get this to move forward so I can finish my task and go watch this movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:25:20.105Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Who makes the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:26:52.504Z"
    }, 
    {
      "docIdx": 1, 
      "text": "There is more information on this movie. The dragons sometimes steal the livestock, so there are warriors that fight the dragons. Instead, the main character Hiccup is not able to kill a dragon who is hurt, so he sets it free.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:27:10.881Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It is a Dreamworks Animation film and the directors are Chris Sanders and Dean DeBiois.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:27:28.784Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I love Dreamworks movies usually, definitely have to see it now.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:27:54.643Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It has a Rotten Tomatoes score of 98% and a CinemaScore of an A. It definitely has great ratings.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:28:38.401Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Would you like to know some of the voice actors?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:28:59.365Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Rotten Tomatoes is pretty spot on with their ratings usually!  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:29:10.961Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, please indulge me with some of the voice actors", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:29:22.154Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Gerard Butler, Craig Ferguson, America Ferrera, and Jay Baruchel are some of the amazing voice actors in this movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:30:15.575Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Blockbuster cast in this movie!  I can't believe I have never heard of this movie, especially since I have children. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:30:52.267Z"
    }, 
    {
      "docIdx": 2, 
      "text": "There is another key scene that you might enjoy. The dragon that Hiccup could not kill, Night Fury, stays in the forest where it is injured and cannot fly. Hiccup creates a prosthetic so the dragon can fly. He learns how to subdue captive dragons in training due to this event.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:31:41.444Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can't either! It's a classic and a movie you and your kids will never forget.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:32:02.349Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That makes sense, I was trying to picture in my mind how a human could capture a huge dragon bare handed!  Was there multiple movies made or just the one?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:33:57.798Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I am not sure. I think that information might be online. Would you like information about an additional key scene?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:34:33.530Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes please, just no spoilers!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:34:46.781Z"
    }, 
    {
      "docIdx": 3, 
      "text": "No problem! The third scene sets up Hiccup's empathy for the dragons and his desire to free them. I don't want to give too much away.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:35:52.382Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He looks at the dragons as gentle loving creatures, versus beasts that cause chaos.  That will definitely capture the audience's attention.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:37:14.726Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I believe that is why the film is so incredibly popular. Critics really enjoyed it, mainly the cinematography and how great it looked, but also the tale in general and how funny it is. One critic claims they easily exceeded \"the juvenilia Dreamworks released in the last nine years.\" ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:38:46.737Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Great, well once again thank you for your insight I really appreciate it.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:39:38.857Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You're welcome. Have a wonderful day and I really hope you get to enjoy this film!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:40:05.280Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-01T19:09:51.130Z", 
  "uid1LogOutTime": "2018-03-01T19:40:10.008Z", 
  "uid1response": {
    "feedback": "I had to imagine as if I was responding and genuinely curious to see this movie.  I have seen this movie and did thoroughly enjoyed it.  ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-01T19:09:51.149Z", 
  "uid2LogOutTime": "2018-03-01T19:40:07.242Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1389", 
  "user2_id": "USR4723", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 10
}