{
  "date": "2018-02-19T23:24:40.848Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "ok", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:26:02.668Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It seems like Christian Bale received praise for his portrayal of Batman", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:27:04.486Z"
    }, 
    {
      "docIdx": 0, 
      "text": "There were good reviews about his portrayal of batman. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:28:04.557Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Although it seems like the movie overall might have been criticized for not giving the characters more depth.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:29:32.625Z"
    }, 
    {
      "docIdx": 0, 
      "text": "i dont know about \"criticized\". it got an \"A\" score from CinemaScore and is 84% on Rotton Tomatoes. Seems like it was liked. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:31:11.271Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sure, but it's Metacritic & Rotten Tomatoes scores are high, but not too high, and one of the critical responses suggests some characters are in it for \"their own aggrandizement\" - that seems at least a little critical", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:33:16.589Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well, i think there are for sure elements critics can for sure be critical about. Overall, it seems it was a solid movie done well. Especially comparing Bale with his work in American Psycho. It seems to be well received, with it's understable issues that might exist. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:37:29.622Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did like that the film focused on what lead to Bruce Wayne becoming Batman and that it seemed to feature characters that felt like they were real people, just not comic book characters. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:40:05.659Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That is exactly what i liked about the movie. That all the characters seemed to be real people. Not individuals with crazy super powers or anything. It seems almost real. And I think that is what the critics picked up on also. Do you agree with the ratings?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:42:18.539Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, I think the ratings are fair, although I'm surprised the Metacritic score isn't higher. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:43:09.547Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, i agree. It seems like critics should have given it a better overall score. The first key scene of bruce wayne as a child, i think its good background information, but there are probably other key scenes i would list before that one. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:46:35.927Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I don't know. It seems pretty pivotal to the development of his Batman persona and does lead, in a way, to the death of his parents.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:47:53.296Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Pivotal - yes. But i guess it's just not the first scene ... or first five scenes ... i would think of when i think of Batman Begins. It's a key to his development. Absolutely. I just know know if i would list it as a key scene. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:51:47.961Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Fair point. The death of his parents during the mugging is pretty key, though. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:52:27.541Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It is a pretty great \"beginnings\" story in the SuperHero genre altogether. Are you a SuperHero genre fan?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:54:04.908Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, I am. And Batman is my favorite superhero, although I'd say I would not have chosen to go with Scarecrow in an origins film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:54:43.993Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree. He is absolutely my favorite as well. Scarecrow was an interesting choice, but i dont think the best choice. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-19T23:56:20.644Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I appreciated that they included Rachel Dawes in the film, but Katie Holmes's casting never felt right. Especially when she was scolding Bruce after he planned to kill Joe Chill.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-19T23:58:03.955Z"
    }, 
    {
      "docIdx": 2, 
      "text": "As a side note, what kind of name is Joe Chill? That character's name always bothered me. ... Katie Holmes did alright - just maybe not the best casting. But that scene is definitely important to the story. It kind of gave him the necessary motivation to leave the country and travel the world. Which helped lead him to the League of Shadows. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T00:01:33.436Z"
    }, 
    {
      "docIdx": 2, 
      "text": "True. I really enjoyed the scenes involving Bruce's training with the League and his response to their plan to bring down Gotham really made visible how focused he was on the idea of justice. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T00:03:20.692Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah - the part of the movie that takes place when he leaves Gotham is fascinating and well told. The audience sees his development and his commitment to justice. So much so he stands up to those that trained him - the League. Very compelling. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T00:05:46.647Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So interesting, too, that as he burns the League down he saves Ducard, who saved him and basically gave him the training to become Batman.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T00:06:47.405Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Right. And then when he returns to Gotham, he learns that Ducard is actually Ra's al Ghul. And then we learn that the one person he saved with the League is now coming to tear down the city that he loves. Gripping stuff.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T00:10:19.236Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I do think the whole Scarecrow storyline fell short - he doses Falcone and Rachel? I feel like having Falcone shut away in Arkham Asylum was a waste of a character.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T00:12:44.090Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Agreed. \nThe only thing it did was create a way to introduce Arkham Asylum into the storyline. I agree, scarecrow was not necessary for that. And the character was not really that important to the story. It could have been done without him as well. I think Ra's al Ghul was a the only \"badguy\" needed in this movie. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T00:14:48.779Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, Ra's plan to vaporize the water and make all of Gotham hallucinate & crazy felt like a waste of him as well and a little cheesy.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T00:16:51.341Z"
    }, 
    {
      "docIdx": 3, 
      "text": "A little bit cheesy - yes. But it was an interesting way to get the drug to the population at large. A very stealth way to undermine the population and stability of life. And the tool to do it was the Wayne Enterprised Vapor. I guess making everything come full-circle. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T00:20:06.300Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, suggesting even the good guys do bad things. I do love Michael Caine as Alfred and that it is Alfred who ultimately comes to Bruce's rescue.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-20T00:21:09.776Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Michael Caine and Morgan Freeman did solid jobs in their roles. Very good takes of those characters. And very necessary allies for Batman. Good point.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-20T00:22:27.868Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-19T23:24:40.848Z", 
  "uid1LogOutTime": "2018-02-20T00:21:17.241Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-19T23:24:41.070Z", 
  "uid2LogOutTime": "2018-02-20T00:22:33.537Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3224", 
  "user2_id": "USR1908", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 14
}