{
  "date": "2018-02-13T22:31:27.484Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "I don't really like animation but I do like musicals.  This movie came through for me  and I liked it.  The beginning was great, it got a little slow in the middle but it picked up at the end.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:35:04.960Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like animation, especially from Disney. I though that the movie was great. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:36:09.545Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do like fairy tale adaptations so it was nice to see The Snow Queen redone.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:37:01.111Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did not know that it was based on a fairy tale. That is cool.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:37:19.829Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The voices were well done.  Good casting!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:37:53.262Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, I liked Kristen Bell, she has an amazing voice.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:38:22.891Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is one of those movies you can watch with the whole family and I think everyone will like parts of it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:39:10.106Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, the story's message is applicable to people of all ages. And the comedic side characters, Olaf and the reindeer were pretty fun.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:40:40.561Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you watch many Disney movies?  I have but I don't always like them, Frozen was a bit different from their usual.  Loved Olaf! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:42:06.560Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think I have watched all of the 3D computer animated Disney movie. I found all of them very well done. I mean their ratings are always very good. I think it was around 2013 when Disney moved from 2D animation to 3D.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:44:50.329Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I wonder how the Broadway version will/does compare to the movie.  I have seen Elsa redone in other venues so I am guessing the recreation will be great.  I hope it captures the emotion of the movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:47:10.306Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do really like Broadway musicals. It is just that it you can do a lot of cool effect in 3D, but on Broadway, it has to be all practical\n effects. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:49:22.275Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The 3D in this movie is different from what I am used to.  I remember the old 3D where you had to wear glasses and when you did it looked like things were coming at you.  They have definitely perfected the art.  Was Pixar involved in the movie? I know Disney owns Pixar.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:52:12.367Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I did not like the old version of 3D. It hurt my eyes, but that is more of a me problems. I don't think Pixar was involved in this. I think that this was a Disney only film though. Do you think this movie really renewed Disney's cultural relevance>", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:56:17.419Z"
    }, 
    {
      "docIdx": 1, 
      "text": "?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T22:56:18.833Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I do think it renewed Disney's cultural relevance.  I found some of the other movies historically inaccurate and that was annoying to me.  Many of their other movies had outdated stereotypes.  This one was a move to strong female characters.  What do you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T22:58:05.991Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, I am really happy that Disney is making more films about different cultures and about empowering women. What did you think of the story, overall? Like what made you dislike it?\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:01:47.701Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh, I liked it.  I just normally don't like animation but this was different.  I saw it much later than its release and I heard all of the hype and I think it was very good.  I'd even watch it again!  I kind of wish they would have a sequel.  I would also like to see the play.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:04:02.923Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Okay, I went in, not knowing anything about the film. If anything, I though it would be bad. But, lo and behold, it was really good. I did not expect the twist in the end where Hans becomes a bad guy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:05:35.313Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you agree with the rating of the movie?  I actually think it should be higher than the 89% from Rotten Tomatoes.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:08:11.196Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, I though it would be much higher. Also metacritics scored it very low. But most of the reviews are good. Do you think that middle was a bit slow? Some critics said it \nwas a bit subpar.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:10:48.428Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't agree with the metacritics low rating.  I was surprised it was so low.  I do think the movie lagged a little in the middle but I don't think it hurt the movie at all.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:13:04.859Z"
    }, 
    {
      "docIdx": 3, 
      "text": "\nD", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:28:48.034Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you think the middle of the movie lagged and made it subpar?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:29:06.025Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It might for some people. I found it fine though. What made the middle lag.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:29:48.035Z"
    }, 
    {
      "docIdx": 3, 
      "text": "?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:32:19.623Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm not sure but do you know what the tragic death of lyricist Howard Ashman was?  How did he die?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:32:48.969Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He made the song tracks for old Disney movies. I believe he died because due through natural causes. I don't really know though. The music was really good in this film though, so whoever they got now is pretty good.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:35:46.222Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree and I do like Idina Menzel.  I saw her in Wicked.  She has a great voice.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:38:43.937Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Agreed. All the actors were really good. I liked Jonathan Groff who played Kristoff.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-13T23:40:38.306Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm happy that CinemaScore gave the movie an A+", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-13T23:41:46.895Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-13T22:31:27.484Z", 
  "uid1LogOutTime": "2018-02-13T23:41:51.744Z", 
  "uid1response": {
    "feedback": "We didn't get four pages of text.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-13T22:31:27.501Z", 
  "uid2LogOutTime": "2018-02-13T23:40:42.853Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3099", 
  "user2_id": "USR2308", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 0
}