{
  "date": "2018-02-06T14:44:48.892Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello! Have you seen any good movies lately?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:45:47.449Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello, yes I have one in particular in mind.  Have you seen the Avengers?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:46:06.633Z"
    }, 
    {
      "docIdx": 0, 
      "text": "NO not yet!   How was it? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:46:49.482Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It came out in 2012 starring Robert Downey Jr. as well as Chris Evans and Mark Ruffalo.  It is based on the Marvel Comics superhero team!  Walt Disney STudios made it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:47:11.265Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Is this the very first Avengers ?I guess there are a few right?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:47:43.157Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am not certain about that, but it's called The Avengers so it is probably the first.  Samuel L. Jackson is also in it!  It really has a fantastic cast.  It got incredible reviews, too, with Rotten Tomatoes giving it a 92% and an A+ from Cinematics.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:48:28.148Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Awsome ! Is there a lot of action?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:49:13.504Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The director, Joss Whedon, is very highly acclaimed, and it has been called \"robustly entertaining superhero smash-up\" so I'm assuming that is a lot of action.  The team is trying to stop Thor's brother Loki from destroying Earth, which is pretty intense I imagine.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:49:56.014Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What character does Mark Ruffalo play?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:50:25.225Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I love me some Mark Ruffalo!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:50:38.181Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm not sure about Mark Ruffalo's specific character, but critics have stated that \"Ruffalo is the revelation, turning Banner into a wry reservoir of Calm ready to become a volcano\" so perhaps he plays someone named Banner?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:51:19.006Z"
    }, 
    {
      "docIdx": 1, 
      "text": "OH BRUCE BANNER! Oh the HULK is in it ? Very cool!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:52:06.161Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Loki and thor they are Scandinavian gods? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:52:38.496Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes!  It includes Bruce Banner, which is amazing, and I see now that Mark Ruffalo plays Bruce Banner, the Hulk!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:53:08.370Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Wow!  How cool the hulk!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:53:29.287Z"
    }, 
    {
      "docIdx": 1, 
      "text": "And I am not sure about the gods, but Robert Downey Jr. plays Iron Man, aka Tony Stark, and Scarlett Jahansson plays Black Widow", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:53:38.166Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Iron Man and Scarlett Johansson as well .... it sounds like a power packed movie!!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:54:19.832Z"
    }, 
    {
      "docIdx": 2, 
      "text": "yes!  and critics stated that Tony Stark is a \"sharp tongued man of the world\" as well as Mr. Downey's \"quicksilver presence\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:54:51.774Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Definitely packed with power!  Additionally, some of the key scenes include Loki encountering the Other, which is a leader of an extraterrestrial race, as well as the division of the Avengers over how to attack SHIELD", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:55:41.283Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He is pretty sharp isnt he.  Tony stark that is. I had no idea that they all were in it!  And you said Joss welden or weeden directed it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:55:51.924Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, it was Joss Whedon, highly acclaimied director.  In the scene where the Avengers become divided, Loki winds up escaping and actually ejecting Thor from an airship!  There is just too much action in this movie for words", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:56:39.671Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Is that the same Joss Whedon who directed firefly? If so it has to be a very well done movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:57:33.288Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think if you love action, ,you are sure to love this.  I don't want to give too much away, but there are scenes with wormholes, radiating strange energy, becoming ruler of the earth, and launching things into space.  I'm not sure what other movies Joss Whedon has directed.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:58:04.573Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Nick Fury is actually the director of the espion organization called SHIELD in the movie, and he tries to recruit Iron Man, Captain America, the Hulk, and Thor to stop Loki", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:59:03.754Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I have a son who would prob. Love to see this... do you know if there is any romance?  especially since Scarlet Johanssen is in it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:59:28.927Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's a pretty complex plot for certain.  But one that is sure to entertain, with such a fantastic cast.  SHIELD is a peacekeeping organization", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T14:59:33.329Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wow every one is in it!!! ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T14:59:58.719Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I have not seen anything about romance mentioned.  Eventually, they all start rallying to defend New York City, which is where the wormhole is actually located!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T15:00:08.145Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They wind up trying to launch a nuclear missile in midtown Manhattan, which is sure to be an intense scene.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T15:00:53.437Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So many people could be hurt I bet I would be on the edge of my seat!! What do you think is the best part? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T15:01:09.351Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And yeah it does have a truly all star cast.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T15:01:11.942Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think it sounds like the ending is the best, because so much has built up to it and everyone is fighting to deal with this missle and its detonation, and honestly their forces wind up being disabled on Earth!  The wormhole is closing and they have to escape in the nick of time.  Will they make it...or not???", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T15:01:50.461Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I\"m sure your son would enjoy it especially if he likes Marvel Comics, because it just combines so many of the great stars and the characters and pulls them all together into an action packed story", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T15:02:46.241Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh my gosh  !  You really make it sound exciting!  I", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T15:02:54.860Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I believe that it is.  I would love to tell you the ending but I will have to keep that a secret so that you can be surprised when you watch it!  It's a real cliff hanger though!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T15:03:22.306Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Does this end automatically do you know or do we have to click finish? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T15:04:11.553Z"
    }, 
    {
      "docIdx": 3, 
      "text": "No no don't tell me .... it sounds like with a great director and great actors and great action that it really is a good movie I cant believe I haven't seen it.....", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T15:04:42.768Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Is there a finish option I have no clue...", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-06T15:05:12.466Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes definitely one to add to your list!  I believe we have satisfied requirements here so have a fabulous day and I hope you enjoy the Avengers!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-06T15:05:28.421Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-06T14:44:48.893Z", 
  "uid1LogOutTime": "2018-02-06T15:05:33.321Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-06T14:44:48.985Z", 
  "uid2LogOutTime": "2018-02-06T15:05:41.840Z", 
  "uid2response": {
    "feedback": "User two made it sound very exciting and thrilling they gave great information that made me want to take my kids to the movie.", 
    "response": [
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2221", 
  "user2_id": "USR1249", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 7
}