{
  "date": "2018-03-27T04:18:49.395Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hey", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:19:00.578Z"
    }, 
    {
      "docIdx": 0, 
      "text": "hello", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:19:07.649Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am interested in the movie, and would love to hear more about it", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:19:22.407Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you have a working title? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:19:30.865Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Plot? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:19:36.341Z"
    }, 
    {
      "docIdx": 0, 
      "text": "have you seen malficient  before?  And I thought I pick another movie but somehow the survey assign us a movie on malficient", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:19:38.762Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have seen parts of malficient", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:19:56.110Z"
    }, 
    {
      "docIdx": 0, 
      "text": "when you say working title, pilot, you mean the title for the movie and pilot of the movie right?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:20:01.135Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes the plot and title", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:20:14.607Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Parts of it?  did you see the beginning, the middle or the end?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:20:15.445Z"
    }, 
    {
      "docIdx": 0, 
      "text": "a little of the middle", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:20:22.937Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What did you think of the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:20:35.736Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I thought it was interesting", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:20:47.158Z"
    }, 
    {
      "docIdx": 1, 
      "text": "would you care to share the beginning and end of it with me", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:21:01.835Z"
    }, 
    {
      "docIdx": 1, 
      "text": "refresh my memory on the middle? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:21:09.173Z"
    }, 
    {
      "docIdx": 1, 
      "text": "please and thank you :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:21:14.795Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Haha, I also only got a glimpse here and there of the movie, but I think there was a princess, a dark fairy, a human helper", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:21:45.283Z"
    }, 
    {
      "docIdx": 1, 
      "text": "lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:22:03.270Z"
    }, 
    {
      "docIdx": 1, 
      "text": "i see ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:22:05.856Z"
    }, 
    {
      "docIdx": 1, 
      "text": "well would you reconsider watching the movie? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:22:17.686Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think I will watch the movie again", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:22:48.783Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I am seeing the plot right now and apparently the dark fairy was in love in with a human when they were both young, and then they separated and the fairy was taking care of the moors, the kind of the human try to invade the moors thus leading to the complication that continue with the princess, and the love between the fairy and the other human, and a war", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:23:40.712Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Feel free to finish the conversation at any time", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:23:41.699Z"
    }, 
    {
      "docIdx": 1, 
      "text": "sounds super interesting", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:23:59.401Z"
    }, 
    {
      "docIdx": 1, 
      "text": "i will rewatch i\nt", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:24:08.083Z"
    }, 
    {
      "docIdx": 2, 
      "text": "haha, we have to finish the conversation according to instruction so you will have to keep chatting with me until it meet the requirement", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:24:08.233Z"
    }, 
    {
      "docIdx": 2, 
      "text": "oh crap", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:24:17.336Z"
    }, 
    {
      "docIdx": 2, 
      "text": "how ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:24:26.022Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The other user will read a document about a movie.\nIf you are not told the name of the movie, try to ask the movie name.\nAfter you are told the name of the movie, pretend you are interested in watching the movie, and try to gather all the information you need to make a decision whether to watch the movie in the end.\nYou don’t have to tell the other user you decision in the end, but please share your mind at the feedback page.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:24:43.036Z"
    }, 
    {
      "docIdx": 2, 
      "text": "i finished mine lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:24:50.468Z"
    }, 
    {
      "docIdx": 2, 
      "text": "it's not really that bad, you just have to keep chatting with me about the movie and its related", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:24:54.398Z"
    }, 
    {
      "docIdx": 2, 
      "text": "well maleficent", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:25:04.182Z"
    }, 
    {
      "docIdx": 2, 
      "text": "not the worst movie ever", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:25:10.301Z"
    }, 
    {
      "docIdx": 2, 
      "text": "havent seen it", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:25:13.876Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Eventually, the finish conversation button will work once we talked about it enough", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:25:16.355Z"
    }, 
    {
      "docIdx": 2, 
      "text": "i think it sounds super worth watching", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:25:28.901Z"
    }, 
    {
      "docIdx": 2, 
      "text": "have you done many of these things", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:25:42.410Z"
    }, 
    {
      "docIdx": 2, 
      "text": "this is my first one. about maleficient", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:25:53.645Z"
    }, 
    {
      "docIdx": 2, 
      "text": "in general. what a great idea for a film", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:26:07.629Z"
    }, 
    {
      "docIdx": 3, 
      "text": "so after the human and the fairy love each other when they were young and they grow apart, and then the king of the human was wounded, then the war started, the human was trying to kill the fairy played by Angelina jolie, this was when the human who was once her childhood lover tried to kill her but could not get herself to", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:26:39.527Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Maleficent is a 2014 American dark fantasy film directed by Robert Stromberg from a screenplay by Linda Woolverton, and starring Angelina Jolie as Maleficent with Sharlto Copley, Elle Fanning, Sam Riley, Imelda Staunton, Juno Temple, and Lesley Manville in supporting roles. Loosely inspired by Charles Perrault's original fairy tale and Walt Disney's 1959 animated film Sleeping Beauty, the film portrays the story from the perspective of the eponymous antagonist, depicting her conflicted relationship with the princess and king of a corrupt kingdom.[4]\n\nWalt Disney Pictures announced the film's development in 2010, with Joe Roth as producer and Jolie, Don Hahn, and Michael Vieira as executive producers. Principal photography took place between June and October 2012. The film special screening took place in London on May 9, 2014, at Kensington Palace.[5] Maleficent premiered at the El Capitan Theatre in Hollywood on May 28, 2014, and was released in the United Kingdom that same day. The film was released in the United States on May 30, 2014 in the Disney Digital 3D, RealD 3D, and IMAX 3D formats, as well as in conventional theaters. It was met with mixed reviews from critics, but was a commercial success, having grossed over $758 million worldwide, becoming the fourth highest-grossing film of 2014 and the highest-grossing film starring Jolie. The film received an Academy Award nomination for Best Costume Design at the 87th Academy Awards.\n\nContents  [hide] \n1\tPlot\n2\tCast\n3\tProduction\n3.1\tWriting\n3.2\tFilming\n3.3\tRe-shoots\n3.4\tVisual effects\n4\tMusic\n4.1\tTrack listing\n5\tRelease\n5.1\tMarketing\n5.2\tNovel\n5.3\tHome media\n6\tReception\n6.1\tBox office\n6.1.1\tCommercial analysis\n6.2\tCritical response\n6.3\tAccolades\n7\tThemes\n8\tSequel\n9\tReferences\n10\tExternal links\nPlot[edit]\nMaleficent is a powerful fairy living in the Moors, a magical forest realm bordering a human kingdom. As a young girl, she meets and falls in love with a human peasant boy named Stefan, whose love for Maleficent is overshadowed by his ambition. As they become older, the two grow apart, and Maleficent becomes protector of the Moors. When King Henry tries to conquer the Moors, Maleficent mortally wounds him and forces him to retreat. As he lies dying, he declares that whoever kills Maleficent will be named his successor and marry his daughter, Princess Leila. Stefan visits Maleficent in the Moors. He drugs her, but cannot bring himself to kill her. Instead, he cuts off her wings with iron, which is lethal to fairies, and presents them to the king. Devastated by Stefan's betrayal, Maleficent turns the Moors into a dark kingdom. She finds a raven named Diaval to act as her wings, spy and confidant. She transforms him into different forms as needed, including human.\n\nAfter some time, Diaval informs Maleficent that Stefan, now king, is hosting a christening for his newborn daughter, Aurora. Bent on revenge, Maleficent arrives uninvited and curses the infant princess: on her sixteenth birthday, she will prick her finger on the spindle of a spinning wheel and fall into a deep sleep from which she will never awaken. When Stefan begs for mercy, Maleficent mocks him and offers an antidote: the curse can be only broken by true love's kiss. Fearing for his daughter's safety, Stefan sends Aurora to live with three pixies—Knotgrass, Thistlewit, and Flittle—until the day after her sixteenth birthday, while he destroys all the spinning wheels in the kingdom and hides their remnants in the castle dungeon. He sends his armies to find and kill Maleficent, but she surrounds the Moors with an impenetrable wall of thorns. King Stefan slips into madness and paranoia, trying to prevent the curse, even neglecting to see his wife on her deathbed.\n\nDespite her initial dislike for Aurora, Maleficent begins to care for her when the bumbling and neglectful pixies fail to do so. After a brief meeting with the young Aurora, Maleficent watches over her from afar. When Aurora is fifteen, she encounters Maleficent. Knowing that she is being watched over, she calls Maleficent her \"fairy godmother.\" Maleficent tries desperately to undo the curse but is unsuccessful, as the curse proves to be unbreakable by any means other than true love's kiss. In the forest, Aurora meets Prince Philip, and the two are attracted to each other. On the day before Aurora's sixteenth birthday, Aurora tells Maleficent that she would like to live with her in the Moors. When Aurora returns to the cottage, the pixies inadvertently tell Aurora of her past. Having learned of Maleficent's true identity, Aurora runs to her father's castle.\n\nAfter a brief reunion with his daughter, Stefan locks her away in a room for her own safety while setting up a plan to kill Maleficent. However, the power of the curse draws Aurora to the dungeon, where a spinning wheel magically reassembles itself. She pricks her finger and falls into a deep sleep, fulfilling the curse. Maleficent, intent on saving Aurora, abducts Phillip and infiltrates Stefan's castle, but Phillip's kiss fails to awaken Aurora. At her bedside, Maleficent apologizes to Aurora and kisses her forehead. Aurora awakens, as Maleficent's motherly feelings towards her count as true love. However, as Maleficent and Aurora attempt to leave, they are ambushed by Stefan and his guards, with an iron net dropping on her. Maleficent transforms Diaval into a dragon, and he battles Stefan's guards, but he is eventually caught as well. Stefan taunts Maleficent, who is dizzy and sick from the iron, his former love for her fully gone, but before he can deliver a killing blow, Aurora finds her wings and releases them. They fly to Maleficent and reattach themselves. Maleficent carries Stefan to the top of the castle's highest tower and beats him easily and quickly in battle, but cannot bring herself to kill him. Stefan attacks her as she turns away, however, and both plummet from the tower. Maleficent breaks away and sends Stefan to his death.\n\nIn the end, Maleficent returns the Moors to its former glory, and Aurora is crowned queen to unify the two kingdoms.\n\nCast[edit]\n\n\n\nAngelina Jolie (left), Sharlto Copley (center) and Sam Riley (right)\nAngelina Jolie as Maleficent\nIsobelle Molloy as Young Maleficent\nElla Purnell as Teen Maleficent\nSharlto Copley as Stefan[6]\nMichael Higgins as Young Stefan\nJackson Bews as Teen Stefan\nElle Fanning as Aurora\nVivienne Jolie-Pitt as Little Aurora\nEleanor Worthington Cox as Pre-teen Aurora\nJanet McTeer as Elderly Aurora/Narrator\nSam Riley as Diaval[6]\nImelda Staunton as Knotgrass[6]\nJuno Temple as Thistlewit[7]\nLesley Manville as Flittle[6]\nBrenton Thwaites as Prince Philip[8]\nKenneth Cranham as King Henry[6][9]\nHannah New as Princess Leila\nProduction[edit]\nAngelina Jolie had long been attached to the project since March 2010, when Tim Burton, who had tentatively planned to direct, chose not to pursue it.[10][11] Jolie's desire to play this role stemmed from her love of the character when she was a little girl.[12] Linda Woolverton was commissioned to write the script for the film.[13] On January 6, 2012, Disney announced that Robert Stromberg, the production designer of Alice in Wonderland and Oz the Great and Powerful, would direct the film.[14] Joe Roth, Don Hahn, and Richard D. Zanuck were hired as producers, although Zanuck died later that year.[15] Roth said the film would not have been made if Jolie had not agreed to take the title role: \"She seemed like the only person who could play the part. There was no point in making the movie if it wasn't her.\"[16]\n\nIn March 2012, Elle Fanning was reported to be in talks for the role of Princess Aurora, the Sleeping Beauty.[17][18] Her casting was officially announced in May 2012, along with Sharlto Copley as the male lead, King Stefan, Princess Aurora's father, then described as the half-human, half-fairy son of a human king, along with Imelda Staunton; Miranda Richardson as Queen Ulla, then described as a fairy queen who is Maleficent's aunt with a dislike of her niece; Kenneth Cranham as a king; Sam Riley as Diaval, a raven who changes into human form and is Maleficent's right hand; and Lesley Manville.[6]\n\nDirector Stromberg highlighted the \"wonderful\" contrast between the two lead actresses, Elle Fanning and Angelina Jolie, calling the character of Aurora the \"beacon of light\" that he was looking forward to blending with the darkness of Maleficent.[19]\n\nWriting[edit]\n\"I was really moved by the script from first reading. It was like uncovering a great mystery. We all know the story of Sleeping Beauty and we all know Maleficent and what happened at the christening because we've all grown up with that. But what we've never known is, what happened before?\"\n—Angelina Jolie[20]\n\nLinda Woolverton's screenplay went through at least 15 versions as the film progressed in the production.[21] Director Robert Stromberg said: \"I met many times with Linda Woolverton, the writer. We did lots of roundtable discussions and sort of cut out the fat as much as we could and sort of purified the storyline as much as we could\".[22] In some earlier versions of the story, Stefan was the half-human, half-fairy bastard son of King Henry. The version of the screenplay which went into shooting originally included two characters called Queen Ulla and King Kinloch, the fairy queen and the fairy king of the Moors, and the aunt and uncle of Maleficent.[6] Miranda Richardson and Peter Capaldi were cast and shot the Queen Ulla and King Kinloch scenes, but their roles were cut in the editing process together with more than 15 minutes of the first act of the film. Stromberg said: \"We spent a bit more time originally in the fairy world before we got into the human side of things ... we wanted to get it [the film] under two hours. So we cut about fifteen minutes out of the first act, and then that had to be seamed together with some pretty basic reshoots.\"[23]\n\nStromberg later claimed in an interview that he employed an \"age-old\" emotional storytelling for the film and called it \"the biggest thrill\" against all technology advances.[19] \"And the way we play with that is we have somebody who's perhaps in love but betrayed and doesn't believe that true love exists. So the moral to it is we can all feel dark ourselves but not to lose hope because there is light in places where we might not be expecting\", he explained.[19]\n\nFilming[edit]\nPrincipal photography began on June 13, 2012.[24] Some filming took place in the Buckinghamshire countryside.[25]\n\nRe-shoots[edit]\nJohn Lee Hancock assisted Stromberg with re-shoots for the film. Hancock, who had just finished overseeing the final post-production stages of Saving Mr. Banks, was approached by producer Joe Roth, with whom he had worked on Snow White and the Huntsman. Roth said: \"He's not directing. He wrote pages, and I hired a first-time director, and it's good to have him on set.\" Roth was asked why a \"film of this magnitude was entrusted to a novice director\", and he noted that Stromberg won Academy Awards for production design on Avatar and Alice in Wonderland. Roth said: \"The movie is gorgeous to look at, and the last 75 minutes are really entertaining. The issue was the opening, which was re-shot over eight days.\"[26]\n\nVisual effects[edit]\nAs a previous production designer, Stromberg sought to balance the use of practical and computer-generated effects. For example, while Maleficent's horns and facial prosthetics were created by makeup artist Rick Baker, Digital Domain took facial capture of Imelda Staunton, Lesley Manville, and Juno Temple for the three pixies to be generated with high authenticity with the help of special rigging by Disney Research in Zurich.[19] For the visuals, Stromberg wanted to make it \"a bit more grounded\" and \"not too surreal\" because it could be distracting from the simplicity of the story.[19] He also regretted not employing bigger sets and allowing actors to work in a more tangible environment, on \"real sets with real lights\".[19]\n\nMusic[edit]\nJames Newton Howard was hired to score the film in October 2012.[27] On January 23, 2014, it was announced that recording artist Lana Del Rey would be covering the song \"Once Upon a Dream\", from the 1959 film Sleeping Beauty as the title song for Maleficent. The song \"Once Upon a Dream\" is based on the Grand Waltz from ballet \"Sleeping Beauty\" written by Russian composer Tchaikovsky. [28][29]\n\nDel Rey was handpicked by Angelina Jolie to perform the song.[30] The single was released on January 26 and was made available for free for a limited time through Google Play.[31][32]\n\nMaleficent (Original Motion Picture Soundtrack)\nFilm score by James Newton Howard\nReleased\tMay 27, 2014\nStudio\tAbbey Road Studios\nGenre\tOrchestral\nLength\t1:11:46\nLabel\tWalt Disney\nTrack listing[edit]\nAll music composed by James Newton Howard (Tracks 1–22).\n\nMaleficent (Original Motion Picture Soundtrack)\nNo.\tTitle\tWriter(s)\tPerformer(s)\tLength\n1.\t\"Maleficent Suite\"\t \t \t6:38\n2.\t\"Welcome to the Moors\"\t \t \t1:05\n3.\t\"Maleficent Flies\"\t \t \t4:39\n4.\t\"Battle of the Moors\"\t \t \t4:58\n5.\t\"Three Peasant Women\"\t \t \t1:04\n6.\t\"Go Away\"\t \t \t2:26\n7.\t\"Aurora and the Fawn\"\t \t \t2:28\n8.\t\"The Christening\"\t \t \t5:30\n9.\t\"Prince Philip\"\t \t \t2:29\n10.\t\"The Spindle's Power\"\t \t \t4:35\n11.\t\"You Could Live Here Now\"\t \t \t2:26\n12.\t\"Path of Destruction\"\t \t \t1:47\n13.\t\"Aurora in Faerieland\"\t \t \t4:41\n14.\t\"The Wall Defends Itself\"\t \t \t1:06\n15.\t\"The Curse Won't Reverse\"\t \t \t1:21\n16.\t\"Are You Maleficent?\"\t \t \t2:10\n17.\t\"The Army Dances\"\t \t \t1:28\n18.\t\"Phillip's Kiss\"\t \t \t2:20\n19.\t\"The Iron Gauntlet\"\t \t \t1:35\n20.\t\"True Love's Kiss\"\t \t \t2:33\n21.\t\"Maleficent Is Captured\"\t \t \t7:42\n22.\t\"The Queen of Faerieland\"\t \t \t3:25\n23.\t\"Once Upon a Dream\"\tJack Lawrence, Sammy Fain\tLana Del Rey\t3:20\nTotal length:\t1:11:46\nRelease[edit]\nThe film was originally slated for a March 2014 release, before it was changed to July 2, 2014. On September 18, 2013, the film's release date was bumped up from July 2, 2014 to May 30, due to Pixar's The Good Dinosaur having production problems and delays.[33] In the United Kingdom, the film was released on May 28.[34]\n\nMarketing[edit]\nOn August 10, 2013, as part of the live action motion picture panel of the 2013 Disney D23 Expo in the Anaheim Convention Center at Anaheim, California, Disney unveiled its first look of Maleficent by revealing the new logo of the film's title and one-minute clip from the film. Angelina Jolie made a surprise visit to the expo and talked with the attendees about her fascination with Disney's Sleeping Beauty as a child, her working experience with the filmmakers on the film, and her love of Disney. She also remarked on how she scared little girls when she was in costume, makeup, and acting during shooting; this led to the decision of hiring her own daughter, Vivienne Jolie-Pitt, for the role of the young Princess Aurora, since she would not be scared of her own mother during principal photography.[35]\n\nWalt Disney Pictures released the teaser poster for Maleficent on November 12, 2013, featuring Jolie in costume and makeup, akin to the character's depiction in the original film.[36][37] The first trailer was released the following day, on November 13. The first teaser trailer was attached to Thor: The Dark World, The Hunger Games: Catching Fire, Frozen, and Vampire Academy: Blood Sisters.[38] Two more trailers were released in January 2014, revealing Maleficent's appearance. A third trailer featured Lana Del Rey singing \"Once Upon a Dream\".[39] The final trailer was released on March 18, 2014.[40]\n\nStarting April 18, 2014, Disney's Hollywood Studios and Disney California Adventure previewed the film inside the ABC Sound Studio and It's Tough to Be a Bug! theaters, respectively.[41] Disney Infinity 2.0 featured Maleficent as a playable figure utilizing the look from the movie.\n\nNovel[edit]\nA tie-in novel was published alongside the movie's release in 2014, written by Elizabeth Rudnick. The novel elaborates on the movie, utilizing a brief prologue detailing Maleficent's birth, early childhood and parentage. The movie never fully elaborates on how the intense hatred amongst men and fairfolk during King Henry's reign came to be, a void the novel fills. The novel also features some different versions of key moments in the film, for example, Stefan angrily smothers King Henry on his deathbed after he declares that he's still unfit to rule even after having brought Maleficent's severed wings to him. Later, Stefan forges a Royal Proclamation declaring himself as the late monarch's chosen successor. Maleficent's encounter with the infant Princess Aurora in the forest also differs from the one in the film, since Aurora does feel afraid of Maleficent after she frightens her away. Some of these ideas had originally been filmed but were either cut or altered during post-production while others may have been dramatic license on the part of the author.[citation needed]\n\nHome media[edit]\nMaleficent was released by Walt Disney Studios Home Entertainment on Blu-ray Disc, DVD, and digital download on November 4, 2014.[42] The film topped the home video sales chart in its first week of release.[43] As of February 2015, Maleficent has made over $74 million in total home video sales.[44]\n\nReception[edit]\nBox office[edit]\nMaleficent earned a gross of $241.4 million in the USA & Canada, and $517.1 million in other countries, for a worldwide total of $758.5 million against a budget of $180 million.[3] Calculating in all expenses, Deadline.com estimated that the film made a profit of $190.77 million.[45] Worldwide, in its opening weekend, the film earned $175.5 million,[46][47] $9 million of which was from IMAX locations.[48] It is also the biggest debut among films starring Angelina Jolie,[48] and the actress' highest-grossing film of all time worldwide,[49][50] as well as the fourth-highest-grossing 2014 film (behind Transformers: Age of Extinction, The Hobbit: The Battle of the Five Armies, and Guardians of the Galaxy), and the 15th Disney-distributed film to surpass the $700 million mark at the worldwide box office.[51] The film is also one of four Walt Disney Studios releases in 2014 to gross over $500 million; the other titles being Guardians of the Galaxy, Captain America: The Winter Soldier, and Big Hero 6.[52]\n\nIn North America, Maleficent earned $4.2 million in Thursday night showings, surpassing the midnight or late-night grosses of previous live-action fantasy films, Alice in Wonderland, Oz the Great and Powerful[53][54] and Snow White and the Huntsman. By the end of its opening day (including late-night Thursday earnings), the film earned $24.3 million, similar to Oz, but ahead of Snow White and the Huntsman and behind Alice.[55] Maleficent finished its debut weekend at first place with $69.4 million[46] ($6.7 million of which was earned from IMAX locations and 35% of which was earned from 3D showings),[56][57] which exceeded Disney's expectations of a $60 million opening[58] and making it the largest opening-weekend performance for a live-action film starring Jolie (a record previously held by her 2008 film Wanted),[56] as well as the third-highest opening weekend for a solo female star (behind the first two films in The Hunger Games series).[59] Disney reported that 46% of ticket buyers in Thursday previews were male,[53] while weekend reports said family audiences accounted for 45% of the film's total audience, and couples and teens accounted for 38% and 18% respectively.[56][58] Female audiences and moviegoers over 25 years old held respective proportions of 60% and 51%.[56] Dave Hollis, head of Walt Disney Studios Motion Pictures, attributed this success to \"some momentum and great word-of-mouth.\"[58] During its first week, the film earned a total of $93.8 million, ahead of Snow White yet behind Oz and Alice.[60] In its second weekend, Maleficent dropped by 50.6% to $34.3 million, finishing in second place.[46] It experienced a smaller second-weekend drop than Snow White,[61][62] yet still bigger than Oz and Alice.[63] In North America, Maleficent is the eighth-highest-grossing 2014 film.[64]\n\nMaleficent opened outside North America on the same weekend as North America, earning $20.1 million from 35 territories in its first two days (May 28–29, 2014).[65] During its opening weekend, the film topped the box office with $106.1 million from 47 territories.[47] Its largest opening weekends were in China ($22.2 million),[66] Mexico ($14.0 million) and Russia and the CIS ($13.0 million).[48] On the second weekend of release, Maleficent fell to $61.7 million, earning from 52 markets.[67][68] It was in first place at the box office outside North America on three weekends, its first, third ($39.2 million)[69][70] and fourth ($47.9 million).[71]\n\nMaleficent is the fourth-highest-grossing 2014 film,[72] and Angelina Jolie's highest-grossing live-action film.[49] In total earnings, the film's top markets after North America are Japan ($57.6 million), China ($47.7 million), Mexico ($46.2 million), Russia ($37.7 million), Brazil ($33.2 million), the United Kingdom ($31.7 million), Venezuela ($24.5 million) and Italy ($19.1 million).[73] It was also the most watched film at the Maltese box office in 2014, enjoying an eighteen-week run.[74]\n\nCommercial analysis[edit]\nDave Lewis, writing for HitFix, predicted that although Disney fairy tales and Angelina Jolie's performance might attract audiences, Maleficent would not gross even as much as Oz the Great and Powerful, explaining that the film was released on the same time frame with competitive releases like X-Men: Days of Future Past, Godzilla and A Million Ways to Die in the West,[75] even though it outperformed those films later on. Boxoffice wrote that Maleficent had a successful marketing campaign, featured Jolie in the title role, and its \"female-driven\" themes and plot aimed at women. However, the site also noted that the film would have to compete with other summer releases, and the character of Maleficent may not attract young children.[76] Todd Cunningham of The Wrap shared the same opinion, writing that \"[the film's] connecting with parents and that Jolie's considerable star power is having a big impact.\"[77][78] Wells Fargo's Marci Ryvicker predicted that Maleficent might be \"too dark and scary to be profitable\" and was likely to force Disney \"into a write-down\", as reported by The New York Times; while RBC Capital Markets' David Bank commented that \"It's definitely in the 'not a sure thing' bucket.\"[79][80][81] Wall St. Cheat Sheet explained that the film approached to a more \"grown-up\" and \"sinister\" aspect of the classic, and targeted for an older audience like young adults. \"It's just too scary for younger children,\" the site wrote.[82] ScreenRant added that the PG rating of the film would \"fill a void in the marketplace, which is currently without a traditional \"family friendly\" option.\"[83] Box Office Mojo primarily compared the film with 2012's Snow White and the Huntsman (another film that also focused on a fairy tale villain), predicting that Maleficent \"has a good chance\" of matching Snow White's gross in North America box office.[84] The film however, ended up grossing double the amount projected.\n\nVariety wrote that the film's opening weekend outperforming initial box-office projections was later attributed by analysts in part to Disney's successful marketing to the \"potent demographic\" (female audiences) much like the studio accomplished with Frozen, in which both films feature a strong female lead.[85] Disney argued that a lack of family-friendly options in the marketplace would \"bode well for Maleficent's [box office] performance\" in its two first weeks of release.[85]\n\nThe cost of the film was offset by a rebate from the UK in the amount of £23,535,108 ($37 million in 2012, the period in which it was shot).[86]\n\nCritical response[edit]\nMaleficent received mixed reviews from critics. The film holds a 51% approval rating on the review aggregator website Rotten Tomatoes, based on 211 reviews, with an average score of 5.7/10. The site's consensus reads, \"Angelina Jolie's magnetic performance outshines Maleficent's dazzling special effects; unfortunately, the movie around them fails to justify all that impressive effort.\"[87] On Metacritic, the film has a rating of 56 out of 100, based on 44 critics, indicating \"mixed or average reviews.\"[88] Audiences polled by CinemaScore gave the film an \"A\" grade on a scale of A+ to F.[89][90] Angelina Jolie's performance in the film has been repeatedly singled out for praise by critics.\n\nThe New York Times stated, with two shorn wings and an astonishing maternal kiss, \"Maleficent\" demolishes stereotypes that were only tweaked in \"Frozen\". [91] Kate Taylor of The Globe and Mail was very positive about the film, writing that \"[it] surprises not for its baroque visions of a colourful woodland enlivened by joyous fairies and a forbidding castle peopled by unhappy humans, but rather for the thematic richness of its story gloriously personified by Angelina Jolie in the title role.\" While criticizing the overuse of CGI and 3D effects, she particularly praised the positive message of the film and Jolie's performance. She concluded her review with \"Long live the feminist revisionist backstory.\"[92] On the contrary, Keith Staskiewicz, writing for the Entertainment Weekly, awarded the film a \"B-\" and wrote that \"there's a lot of levitating cliffs and odd flora. But despite their bleeding-edge digital design, the backgrounds have all the depth of the old matte-painted backgrounds of the analog days,\" which made the film \"[feel] classical in nature.\" He further commented that \"The characters are boiled down to their essentials, the humor is timelessly broad.\"[93] Michael Philips of the Chicago Tribune gave the film two and a half stars, commenting that the recent \"formula\" that \"a new angle on a well-known fairy tale appears in the light\" \"works\" with Maleficent. He also said that the film \"is all about second thoughts\", as Maleficent \"spends much of the film as Aurora's conflicted fairy godmother.\" Phillips particularly praised Jolie and Elle Fanning's acting, Rick Baker's makeup (for Jolie's \"angular, serrated look\"), but criticized James Newton Howard's \"sloshy, pushy\" musical score.[94] Robbie Collin of The Daily Telegraph wrote, \"This Disney reimagining of Sleeping Beauty lacks true enchantment, but Angelina Jolie saves the day.\"[95] Betsy Sharkey of the Los Angeles Times gave the film a positive review, writing \"This is Jolie's film because of the Maleficent she makes. Everyone else, even Aurora, fades in her presence.\"[96] J.C. Maçek III of PopMatters wrote, \"Even at its silliest, Maleficent is a well-acted film, with Sharlto Copley turning in a memorable performance and Elle Fanning proving to be an inspired choice for Aurora/Sleeping Beauty. Jolie manages to steal her own show in most every scene. Jolie is excellent as the hopeful fairy, enjoying the world she flies through. She is also brilliant as the Dark Lady, who could be a perfect counterpart to any Darth Vader, as she malevolently takes her revenge on those who have wronged her.\"[97]\n\nAnn Hornaday of The Washington Post awarded the film three-and-a-half out of four stars, commenting that \"Still, for all its limitations, \"Maleficent\" manages to be improbably entertaining to watch, due solely to its title character.\"[98] Writing for Roger Ebert's website, Matt Zoller Seitz awarded Maleficent three out of four stars, praising the themes of the film and the acting of Jolie. Seitz also called the scene in which Maleficent discovers the loss of her wings \"the most traumatizing image I've seen in a Hollywood fairy tale since the Christ-like sacrifice of Aslan in 2005's The Chronicles of Narnia: The Lion, the Witch and the Wardrobe.\"[99] The review in The Globe and Mail further explained that \"in the simple context of a fairy tale, Jolie does make both the terrifying horned creature and her gradual awakening heartfelt,\" extolling the \"emotional richness\" behind her physical acts.[92] Richard Roeper of the Chicago Sun-Times felt more negatively, assigning it a D. Although Roeper praised the visuals, he criticized the acting and writing, stating that \"the story itself might well put you into the same type of coma that befalls the heroine.\"[100] However, some such as Stella Morabito of The Federalist, criticized the film for its negative portrayal of men. According to Morabito, \"Maleficent lacks a single complex male character\". Morabito also criticized the film for portraying Maleficent as a hero.[101]\n\nMary Costa, who voiced Aurora in the 1959 animated motion picture, called the film, \"a very good movie\". She added that “the concept and perspective are totally different than the original film’s, which makes it new and interesting.\" As for Jolie's performance, she said \"No one could have played the part of Maleficent better,\" concluding that \"she was absolutely magnificent!”[102]\n\nAccolades[edit]\nList of awards and nominations\nAward / Film Festival\tCategory\tRecipient(s)\tResult\n87th Academy Awards[103]\tBest Costume Design\tAnna B. Sheppard\tNominated\nBroadcast Film Critics Association[104]\tBest Costume Design\tAnna B. Sheppard\nBest Hair & Makeup\t\nHeartland Film Festival[105]\tTruly Moving Picture Award\tRobert Stromberg\tWon\nHollywood Film Awards[106]\tHollywood Production Design\tDylan Cole and Gary Freeman\nHollywood Music in Media Awards\tOriginal Score - SI-FI/Fantasy Film\tJames Newton Howard\tNominated\nNickelodeon Mexico Kids' Choice Awards[107]\tFavorite movie\t\nPeople's Choice Awards\tFavorite Movie\t\tWon\nFavorite Family Movie\t\nFavorite Movie Actress\tAngelina Jolie\tNominated\nFavorite Action Movie Actress\nPhoenix Film Critics Society[108]\tBest Live Action Family Film\t\nBest Costume Design\tAnna B. Sheppard\nSatellite Awards\tBest Costume Design\tAnna B. Sheppard\nBest Art Direction & Production Design\tDylan Cole, Frank Walsh, Gary Freeman\nTeen Choice Awards\tChoice Movie: Action\t\nChoice Movie Actress: Action\tAngelina Jolie\nElle Fanning\n45th Annual British Academy Children's Awards[109]\tBAFTA Kid's Vote - Film in 2014\t\nChildren's Feature Film\t\nSaturn Award[110]\tBest Fantasy Film\t\nBest Actress\tAngelina Jolie\nBest Performance by a Younger Actor\tElle Fanning\nBest Costume\tAnna B. Sheppard\nKids' Choice Award\tFavorite Movie\t\nFavorite Actress\tAngelina Jolie\nFavorite Villain\tAngelina Jolie\tWon\nFavorite Actress\tElle Fanning\tNominated\nVisual Effects Society Awards (VES Awards)[111]\tOutstanding Visual Effects in a Visual Effects-Driven Photoreal/Live Action Feature Motion Picture\tCarey Villegas, Barrie Hemsley, Adam Valdez, Kelly Port, Michael Dawson\nOutstanding Performance of an Animated Character in a Photoreal/Live Action Feature Motion Picture\tDarren Hendler, Matthias Wittmann, Jeremy Buttell, Elliot Rosenstein\nHollywood Post Alliance Awards (HPA Awards)[112]\tOutstanding Visual Effects – Feature Film\tCarey Villegas, Adam Valdez, Seth Maury, Kevin Hahn, David Seager // MPC\nThemes[edit]\nMultiple reviewers and commentators have opined that an early scene in the movie, in which Stefan drugs Maleficent and removes her wings from her unconscious body, is a metaphor for rape. Hayley Krischner of The Huffington Post interpreted the scene as an important reference to rape culture: \"This is the horrific side of rape culture. We're so enmeshed in it that it's impossible to ignore a metaphoric rape that occurs in a Disney movie\". She went on to praise the film for giving a positive and hopeful message to rape victims, ultimately allowing \"the woman to recover. It gives her agency. It gives her power. It allows her to reclaim the story\".[113] Monika Bartyzel of The Week noted the scene's implications in her review: \"In its first act, Maleficent offers a dark, surprisingly adult exploration of rape and female mutilation\". However, Bartyzel went on to opine that the film portrayed Maleficent's actions as \"a rape revenge fantasy\" and criticized the film for not following through on its early subtext, ultimately calling it less feminist and reductive compared to its 1959 counterpart: \"In Maleficent, Aurora is the product of a cold and loveless marriage and a vengeful, unhinged rapist. Her safety relies on a trio of clueless and dangerously careless fairies, and her Godmother is the woman who cursed her — and who had, in turn, been violated by her own father\".[114] Angelina Jolie addressed the issue during an interview with BBC Radio 4 on the Woman's Hour programme and claimed that the subtext was intentional: \"The question was asked: 'What could make a woman become so dark and lose all sense of her maternity, her womanhood, and her softness?' [...] We were very conscious, the writer and I, that [the scene] was a metaphor for rape\". She further explained that the answer to the question \"What could bring her back?\" was still \"an extreme Disney, fun version [of the story]\", but \"at the core it is abuse, and how the abused then have a choice of abusing others or overcoming and remaining loving, open people\".[115][116]\n\nJordan Shapiro of Forbes argued that the film's main subtext was the detrimental effects of ultimatums between capitalist and socialist societies. He pointed out that the Moors represented a socialist, nature-oriented, democratic society while the human kingdom was one of capitalism, industry and absolute monarchy. Shapiro further commented that the character of Stefan, his theft of the Moors' riches (the jewel) and his mutilation of Maleficent's wings for the sake of his ambition were references to the American Dream. He conceived the wing-tearing scene as \"a social commentary that any hierarchical rise to power inherently happens through the exploitation of others\", explaining that it was the reason why \"without her wings, Maleficent also becomes an oppressive ruler of the Moors. Everything she represents, believes and stands for has been grounded\", and \"like most victims of oppression\", \"she takes it out on those who are smaller and weaker\". He concluded that through the merge of the two kingdoms at the end of the film, it sought to weave together capitalism and socialism and let go oppositions: \"It is time to leave the kingdom of familiar partisan oppositions: let's replace either/or with neither/nor or both/and\".[117]\n\nSequel[edit]\nOn June 3, 2014, Angelina Jolie hinted about the possibility of a sequel.[118] On June 15, 2015, Disney announced the sequel with Linda Woolverton returning to write the screenplay and Joe Roth to produce the film.[119] On April 26, 2016, it was confirmed that Jolie would reprise her role as Maleficent.[120] On August 30, 2017, Disney hired screenwriter Jez Butterworth to re-write the initial script by Woolverton.[121] On October 3, 2017, it was reported that Joachim Rønning (Pirates of the Caribbean: Dead Men Tell No Tales) is in talks on directing the sequel.[122] In January 2018, it was reported that the sequel would start filming in April 2018.[123]\n\nReferences[edit]\nJump up ^ \"Maleficent (PG)\". British Board of Film Classification. May 14, 2014. Retrieved May 15, 2014.\nJump up ^ FilmL.A. (May 2015). \"2014 Feature Film Study\" (PDF). FilmL.A. Feature Film Study. Retrieved November 11, 2017.\n^ Jump up to: a b \"Maleficent (2014)\". Box Office Mojo (IMDb). Retrieved December 6, 2014.\nJump up ^ \"Maleficent: Press Kit\" (PDF). The Walt Disney Studios. Archived (PDF) from the original on June 8, 2014. Retrieved June 6, 2014.\nJump up ^ \"Brad Pitt and Angelina Jolie at the Maleficent Screening\". Ikon London Magazine. 10 May 2014. Retrieved 8 March 2018.\n^ Jump up to: a b c d e f g Kit, Borys (May 7, 2012). \"Imelda Staunton, Miranda Richardson Joining Angelina Jolie in 'Maleficent' (Exclusive)\". The Hollywood Reporter. Retrieved May 7, 2012.\nJump up ^ Kit, Borys (May 17, 2012). \"Juno Temple Joins Angelina Jolie's 'Maleficent' (Exclusive)\". The Hollywood Reporter. Retrieved June 19, 2012.\nJump up ^ Fleming, MIke, Jr. (May 30, 2012). \"Disney Crowns Young Prince In 'Maleficent'\". Deadline Hollywood. Retrieved May 30, 2012.\nJump up ^ Eagan, Daniel (May 29, 2014). \"Film Review: Maleficent\". Film Journal International. Retrieved May 29, 2014.\nJump up ^ Brooks, Xan (March 29, 2010). \"Tim Burton's Sleeping Beauty: Angelina Jolie poised to play Maleficent\". The Guardian. Retrieved October 25, 2014.\nJump up ^ Kit, Borys (May 6, 2011). \"Tim Burton Won't Direct Disney's 'Maleficent' (Exclusive)\". The Hollywood Reporter. Archived from the original on May 18, 2011. Retrieved May 30, 2014.\nJump up ^ Leyland, Nick (October 27, 2014). \"Interview: Angelina Jolie talks \"Maleficent\"\". The Movie Network. Archived from the original on June 10, 2016. Retrieved March 9, 2015.\nJump up ^ \"Disney, 'Alice' scribe team for film about 'Sleeping Beauty's' evil queen (exclusive)\". The Hollywood Reporter. March 23, 2010. Archived from the original on July 26, 2010.\nJump up ^ Fleming, Mike, Jr. (January 6, 2012). \"Disney Sets Robert Stromberg To Helm 'Maleficent'\". Deadline.com.\nJump up ^ Orzeck, Kurt (January 6, 2012). \"Disney's 'Maleficent,' Starring Angelina Jolie, Gets a Director\". TheWrap.com. Retrieved August 4, 2013.\nJump up ^ \"Joe Roth | Producer Joe Roth Would Not Have Made Maleficent If Angelina Jolie Turned The Role Down\". Contactmusic.com. World Entertainment News Network. April 10, 2014. Retrieved May 15, 2014.\nJump up ^ McClintock, Pamela (March 8, 2012). \"Angelina Jolie's 'Maleficent' Will Start Shooting in June (Exclusive)\". The Hollywood Reporter. Retrieved March 8, 2012.\nJump up ^ Fleming, Mike Jr. (March 8, 2012). \"Elle Fanning To Join Angelina Jolie In 'Maleficent'\". Deadline Hollywood. Retrieved March 8, 2012.\n^ Jump up to: a b c d e f Desowitz, Bill (May 30, 2014). \"Director Robert Stromberg Talks 'Maleficent': Cutting Edge Virtual Cinema and Age-Old Emotional Storytelling\". Indiewire. Retrieved 30 August 2014.\nJump up ^ \"Angelina Jolie is Maleficent in Cinemas May 29th in 3D\". Finance.yahoo.com. 2014-05-27. Retrieved 2014-07-03.\nJump up ^ Brown, Emma. \"Linda Woolverton and the Making of Maleficent\". Interview. Retrieved June 7, 2014.\nJump up ^ Kaye, Don. \"Maleficent director Robert Stromberg talks bringing Sleeping Beauty to Life\". Den of Geek. Retrieved June 7, 2014.\nJump up ^ Bibbiani, William. \"Maleficent: Director Robert Stromberg on True Love and Reshoots\". CraveOnline.com. Retrieved May 30, 2014.\nJump up ^ Savage, Sophia (June 19, 2012). \"First Look at Angelina Jolie as 'Maleficent'; Disney Kicks Off Production\". Indiewire. Retrieved January 27, 2016.\nJump up ^ McConnell, Donna; McCormack, Kirsty (June 20, 2012). \"Angelina Jolie starts shooting new Disney movie Maleficent\". Daily Mail. London. Retrieved June 18, 2013.\nJump up ^ Kit, Borys; Kim Masters (October 10, 2013). \"Disney's 'Maleficent' Enlists John Lee Hancock for Reshoots (Exclusive)\". The Hollywood Reporter. Retrieved January 27, 2014.\nJump up ^ \"James Newton Howard to Score Disney's 'Maleficent'\". Film Music Reporter.\nJump up ^ \"Lana Del Rey to release new song after the Grammys\". NME. January 26, 2014. Retrieved January 26, 2014.\nJump up ^ McIntyre, Gina (January 26, 2014). \"'Maleficent': Lana Del Rey croons 'Once Upon a Dream' in Grammys spot\". Los Angeles Times. Retrieved January 27, 2014.\nJump up ^ \"Lana Del Rey handpicked by Angelina Jolie to sing Disney classic Once Upon A Dream for Sleeping Beauty remake Maleficent\". Daily Mail. London. January 25, 2014. Retrieved January 26, 2014.\nJump up ^ Graser, Marc (January 26, 2014). \"Disney's Maleficent Takes Advantage of Grammys With Lana Del Rey Song\". Variety. Retrieved January 27, 2014.\nJump up ^ Mendelson, Scott (January 26, 2014). \"Lana Del Rey Covers \"Once Upon A Dream\" For Angelina Jolie's 'Maleficent'\". Forbes. Retrieved January 27, 2014.\nJump up ^ \"Disney Announces New Dates for Maleficent, The Good Dinosaur and Finding Dory\". ComingSoon.net. Retrieved September 21, 2013.\nJump up ^ \"Maleficent\". Walt Disney Company. Retrieved May 21, 2014.\nJump up ^ McIntyre, Gina (August 10, 2013). \"Angelina Jolie arrives in Anaheim to unveil 'Maleficent' at D23\". Los Angeles Times. Retrieved November 12, 2013.\nJump up ^ \"Angelina Jolie is magnificent as Maleficent\". Entertainment Weekly. November 12, 2013. Retrieved November 12, 2013.\nJump up ^ Lewis, Hilary (November 12, 2014). \"Angelina Jolie Bewitches in First 'Maleficent' Poster\". The Hollywood Reporter. Retrieved January 27, 2014.\nJump up ^ Labrecque, Jeff (November 13, 2013). \"'Maleficent' trailer: There's more than horns and thorns to Angelina Jolie's villain\". Entertainment Weekly. Retrieved January 27, 2014.\nJump up ^ \"First Trailer: 'Maleficent'\". Variety. November 13, 2013. Retrieved January 27, 2014.\nJump up ^ \"'Maleficent' New Full Trailer\". Retrieved March 18, 2014.\nJump up ^ Fickley-Baker, Jennifer (March 18, 2014). \"'Maleficent' Sneak Peek Coming to Disney Parks April 18\". DisneyParks Blog. Retrieved April 15, 2014.\nJump up ^ \"Maleficent DVD & Blu-ray\". VideoETA. Retrieved July 25, 2014.\nJump up ^ \"'Maleficent' Captures Top Spot on Home Video Sales Charts, Unseats 'X-Men'\". Variety. Retrieved June 12, 2015.\nJump up ^ \"Maleficent\". The Numbers. 9 November 2014. Retrieved 12 June 2015.\nJump up ^ Fleming Jr., Mike (March 12, 2015). \"No. 6 'Maleficent' – 2014 Most Valuable Blockbuster Movie Tournament\". Deadline.com. Retrieved March 13, 2015.\n^ Jump up to: a b c \"Maleficent (2014) - Weekend Box Office Results — Box Office Mojo\". Box Office Mojo. IMDb. Retrieved June 9, 2014.\n^ Jump up to: a b Tartaglione, Nancy (June 2, 2014). \"UPDATE: Int'l Box Office: 'Maleficent' Awakens $106.1M Overseas; 'X-Men' Adds $95.6M; 'Edge Of Tomorrow' Cruises To $20.1M In Select Markets; 'A Million Ways To Die In The West' Holsters $10M; More\". Deadline Hollywood. PMC. Archived from the original on June 3, 2014. Retrieved June 17, 2014.\n^ Jump up to: a b c \"GLOBAL: 'Maleficent' Edges Out X-Men for Box Office Crown with $100.6M Day-and-Date Debut Overseas\". Boxoffice. June 1, 2014. Archived from the original on June 2, 2014. Retrieved June 2, 2014.\n^ Jump up to: a b \"GLOBAL: Strong Brazil Bow Sends 'How to Train Your Dragon 2' to $43.5 Million Overseas Weekend; 'Maleficent' Takes $20.3 Million in China\". Boxoffice. BoxOffice® Media, LLC. June 22, 2014. Archived from the original on June 26, 2014. Retrieved June 22, 2014.\nJump up ^ Subers, Ray (June 22, 2014). \"Weekend Report: 'Man' Defeats 'Boys,' Falls Short of Predecessor\". Box Office Mojo. Retrieved June 22, 2014.\nJump up ^ Cunningham, Todd (July 22, 2014). \"'Maleficent' Passes $700 Million at Worldwide Box Office\". The Wrap. Retrieved July 27, 2014.\nJump up ^ \"Around-the-World Roundup: 'Jupiter' Ascends to Top Spot Overseas\". Box Office Mojo. Retrieved February 9, 2015.\n^ Jump up to: a b McClintock, Pamela (March 30, 2014). \"Box Office: 'Maleficent' Enchants With $4.2M Thursday Night; Nabs $20.1M Overseas\". The Hollywood Reporter. Retrieved May 30, 2014.\nJump up ^ Subers, Ray (May 29, 2014). \"Forecast: 'Maleficent' Set to Reign On Final Weekend of May\". Box Office Mojo. Retrieved May 30, 2014.\nJump up ^ Subers, Ray (May 30, 2014). \"Friday Report: 'Maleficent' Conjures Up $24.2 Million Debut\". Box Office Mojo. Retrieved May 31, 2014.\n^ Jump up to: a b c d \"NORTH AMERICA: Studio Estimates: 'Maleficent' Casts Box Office Spell with $70.0M; 'A Million Ways to Die in the West' Soft with $17.1M\". Boxoffice. June 1, 2014. Retrieved June 1, 2014.\nJump up ^ Subers, Ray (June 1, 2014). \"Weekend Report: 'Maleficent' Casts Box Office Spell, 'Million Ways' Dies\". Box Office Mojo. Retrieved June 1, 2014.\n^ Jump up to: a b c Bahr, Lindsey (May 30, 2014). \"Box office report: 'Maleficent' reigns with $70 million; 'A Million Ways to Die in the West' disappoints\". Entertainment Weekly. Retrieved June 1, 2014.\nJump up ^ Vary, Adam B. (June 2, 2014). \"Angelina Jolie Proves Why Movie Stars Still Matter\". BuzzFeed.com. Retrieved June 2, 2014.\nJump up ^ \"NORTH AMERICA: 'Maleficent' Casts Box Office Spell with $93.9M in its First Week\". Boxoffice. June 6, 2014. Retrieved June 9, 2014.\nJump up ^ \"NORTH AMERICA: Studio Estimates: 'The Fault In Our Stars' Shines with $48.2M; 'Edge of Tomorrow' Debuts in Third with $29.1M\". Boxoffice. June 8, 2014. Retrieved June 8, 2014.\nJump up ^ Subers, Ray (June 8, 2014). \"Weekend Report: 'Stars' Align for 'Fault,' Cruise Misses with 'Edge'\". Box Office Mojo. Retrieved June 8, 2014.\nJump up ^ \"'Alice' Vs. 'Oz' Vs. 'Maleficent'\". Box Office Mojo. Retrieved June 17, 2014.\nJump up ^ \"2014 Yearly Box Office Results - 2014 Domestic Grosses\". Box Office Mojo. Retrieved July 18, 2014.\nJump up ^ McClintock, Pamela (May 30, 2014). \"Box Office: 'Maleficent' Bewitches Friday Moviegoers for $65 Million-Plus Debut\". The Hollywood Reporter. Retrieved May 30, 2014.\nJump up ^ \"China Box Office 16-22/06/2014\". EntGroup. Archived from the original on July 2, 2014. Retrieved July 2, 2014.\nJump up ^ Tartaglione, Nancy (June 9, 2014). \"Intl Box Office: 'Edge Of Tomorrow' No. 1 With $81M; 'Fault In Our Stars' Shines Bright In Brazil, Mexico, Oz; 'Maleficent' Adds $61.7M; 'X-Men' Crosses $100M In China; More\". Deadline Hollywood. PMC. Retrieved June 9, 2014.\nJump up ^ \"GLOBAL: 'Edge of Tomorrow' Leads the Overseas Box Office, Reaches $140.1M Global Cume Following North American Release\". Boxoffice. June 8, 2014. Archived from the original on June 16, 2014. Retrieved June 9, 2014.\nJump up ^ Tartaglione, Nancy (June 16, 2014). \"Final Int'l Box Office: 'Godzilla' Thrashes Again With $38.4M Weekend Led By China; 'How To Train Your Dragon 2′ Fires Up $24.4M; 'Fault' On Fire In Brazil\". Deadline Hollywood. Archived from the original on June 23, 2014. Retrieved June 17, 2014.\nJump up ^ \"GLOBAL: 'Godzilla' Takes Over China, Crosses $400M Worldwide\". Boxoffice. BoxOffice® Media, LLC. June 15, 2014. Archived from the original on June 20, 2014. Retrieved June 15, 2014.\nJump up ^ Kay, Jeremy (June 22, 2014). \"Maleficent rules international box office on $48m\". Screen Daily. Archived from the original on June 24, 2014. Retrieved July 2, 2014.\nJump up ^ \"2014 Yearly Box Office Results (Sorted by Overseas Grosses)\". Box Office Mojo. IMDb. Retrieved August 19, 2014.\nJump up ^ \"Maleficent (2014) - International Box Office Results\". Box Office Mojo. IMDb. Retrieved June 23, 2014.\nJump up ^ \"Films immirati lejn it-tfal fost l-aktar popolari mal-Maltin\". Television Malta. Retrieved January 19, 2015.\nJump up ^ Lewis, Dave (April 15, 2014). \"Summer Box Office Predictions 2014: 'X-Men,' 'Transformers,' 'Maleficent'\". HitFix. Retrieved June 9, 2014.\nJump up ^ BoxOffice Staff (April 4, 2014). \"Long Range Forecast: 'Maleficent'\". Boxoffice. Retrieved June 9, 2014.\nJump up ^ Cunningham, Todd (May 8, 2014). \"Angelina Jolie's 'Maleficent' Tracking for $60 Million-Plus Box-Office Opening\". The Wrap. Retrieved June 9, 2014.\nJump up ^ Cunningham, Todd (April 25, 2014). \"The 5 Biggest Box-Office Summer Showdowns\". Business Insider. Retrieved June 9, 2014.\nJump up ^ Atkinson, Claire (April 1, 2014). \"Scary prospects for Disney's 'Maleficent'\". The New York Post. Retrieved June 9, 2014.\nJump up ^ Jones, Reid (April 2, 2014). \"Wall St. Predicts Maleficent DOOMED for the Box Office\". MoviePilot. Retrieved June 9, 2014.\nJump up ^ David (April 7, 2014). \"Report: Angelina Jolie's 'Maleficent' \"Scaring Away Investors\" / Set For Box Office Bomb?\". That Grape Juice. Retrieved June 9, 2014.\nJump up ^ Knight, Ella (April 18, 2014). \"12 Future Blockbusters That Will Burn Up the Box Office This Summer\". Wall St. Cheat Sheet. Retrieved June 9, 2014.\nJump up ^ Agar, Chris (May 28, 2014). \"Box Office Prediction: 'X-Men: Days of Future Past' vs. 'Maleficent'\". ScreenRant. Retrieved June 9, 2014.\nJump up ^ Subers, Ray (April 23, 2014). \"Summer 2014 Forecast\". Box Office Mojo. IMDb. Retrieved June 9, 2014.\n^ Jump up to: a b Lang, Brent (June 2, 2014). \"'Maleficent' Shows Strength of Female Audiences at Box Office\". Variety. Variety Media, LLC. Retrieved June 2, 2014.\nJump up ^ Groves, Don (February 1, 2016). \"Hollywood Studios Reap Hundreds Of Millions In British Tax Relief\". Forbes. Retrieved March 3, 2018.\nJump up ^ \"Maleficent (2014)\". Rotten Tomatoes (Flixster). Retrieved March 24, 2017.\nJump up ^ \"Maleficent\". Metacritic. Retrieved May 31, 2014.\nJump up ^ Lang, Brent (May 28, 2014). \"Box Office: Angelina Jolie's 'Maleficent' Looks to Put a Spell on Seth MacFarlane\". Variety. Retrieved May 31, 2014.\nJump up ^ Busch, Anita (May 31, 2014). \"Box Office: Disney's 'Maleficent' Spells Success; 'A Million Ways To Die In the West' Flatlines; 'X-Men' Falls Hard\". Deadline.com. Retrieved May 31, 2014.\nJump up ^ Scott, A.O.; Dargis, Manohla (September 3, 2014). \"Sugar, Spice and Guts\". The New York Times.\n^ Jump up to: a b Taylor, Kate (May 29, 2014). \"Why Angelina Jolie's Maleficent is magnificent\". The Globe and Mail. Toronto. Retrieved June 12, 2014.\nJump up ^ Staskiewicz, Keith (June 11, 2014). \"Maleficent (2014) Movie Review\". Entertainment Weekly. Retrieved June 12, 2014.\nJump up ^ Phillips, Michael (May 29, 2014). \"Review: 'Maleficent' ★★ 1/2\". Chicago Tribune. Retrieved June 12, 2014.\nJump up ^ Collin, Robbie (May 28, 2014). \"Maleficent, review\". The Daily Telegraph. London. Retrieved May 29, 2014.\nJump up ^ Sharkey, Betsy (May 29, 2014). \"Review: Angelina Jolie is wickedly good in the not-quite-classic 'Maleficent'\". Los Angeles Times. Retrieved May 30, 2014.\nJump up ^ Maçek III, J.C. (November 4, 2014). \"In 'Maleficent', Angelina Jolie Channels Shakespeare's Richard III\". PopMatters.\nJump up ^ Hornaday, Ann (May 30, 2014). \"Angelina Jolie stars in 'Maleficent,' a feminist-revisionist take on Sleeping Beauty\". The Washington Post. Retrieved May 30, 2014.\nJump up ^ Seitz, Matt (May 29, 2014). \"Maleficent Movie Review & Film Summary (2014)\". RogerEbert.com (Ebert Digital LLC). Retrieved June 3, 2014.\nJump up ^ Roeper, Richard (June 2, 2014). \"Maleficent (2014)\". RichardRoeper.com. Retrieved June 3, 2014.\nJump up ^ Morabito, Stella (2014-06-06). \"'Maleficent': Once Upon A Screed.\" The Federalist. Retrieved 2016-04-25.\nJump up ^ \"California Institute of the Arts: Mary Costa, Awake and Sing\" California Institute of the Arts, Retrieved September 11, 2015\nJump up ^ Labrecque, Jeff (January 15, 2015). \"Oscars 2015: Full list of nominations\". Entertainment Weekly. Retrieved January 15, 2015.\nJump up ^ Hammond, Pete (December 15, 2014). \"'Birdman', 'Budapest' And 'Boyhood' Get Key Oscar Boost To Lead Critics Choice Movie Award Nominations; Jolie Rebounds From Globe Snub\". Deadline Hollywood. Retrieved December 15, 2014.\nJump up ^ \"Truly Moving Picture Award\". Heartland Film.\nJump up ^ Longeretta, Emily. \"Hollywood Film Awards 2014 Winners — Full List: 'Gone Girl' & More\". Hollywood Life. Retrieved 15 November 2014.\nJump up ^ \"Nickelodeon revela los nominados a los Kids' Choice Awards México 2014\". anmtvla.com.\nJump up ^ \"Phoenix Film Critics Society 2014 Awards\". Phoenix Film Critics Society. Archived from the original on February 6, 2015. Retrieved December 9, 2014.\nJump up ^ \"Children's in 2014\". Bafta.org. 2014.\nJump up ^ \"The Academy of Science Fiction Fantasy and Horror Films\". saturnawards.org.\nJump up ^ \"13th Annual VES Awards 2015: Full list of nominations\". www.visualeffectssociety.com. 2015.\nJump up ^ \"Hollywood Post Alliance Awards 2015: Full list of nominations\".\nJump up ^ Krischer, Hayley (June 6, 2014). \"The Maleficent Rape Scene That We Need to Talk About\". HuffPost. Retrieved June 10, 2014.\nJump up ^ Bartyzel, Monika (June 6, 2014). \"Girls on Film: Maleficent is less progressive than 1959's Sleeping Beauty\". Retrieved June 10, 2014.\nJump up ^ Bahadur, Nina (June 11, 2014). \"Angelina Jolie: 'Maleficent' Scene Is A 'Metaphor For Rape'\". HuffPost. Retrieved June 20, 2014.\nJump up ^ Holmes, Sally (June 12, 2014). \"Angelina Jolie Says Violent Maleficent Scene Was a Metaphor for Rape\". Elle. Retrieved June 20, 2014.\nJump up ^ Shapiro, Jordan (June 5, 2014). \"Why Disney's 'Maleficent' Matters\". Forbes. Retrieved June 10, 2014.\nJump up ^ Coonan, Clifford (July 10, 2015). \"Angelina Jolie Hints at 'Maleficent' Sequel in China\". hollywoodreporter.com. Retrieved June 3, 2014.\nJump up ^ Fleming Jr, Mike (June 15, 2015). \"'Maleficent' Sequel On Disney Drawing Board As Linda Woolverton Makes Scripting Deal\". deadline.com. Retrieved June 16, 2015.\nJump up ^ McClintock, Pamela (April 26, 2016). \"Disney Stakes Out Release Dates for 'Jungle Book 2,' 'Maleficent 2' and More\". hollywoodreporter.com. Retrieved May 5, 2016.\nJump up ^ Drum, Nicole (August 30, 2017). \"'Maleficent 2' Headed Into Production\". comicbook.com. Retrieved September 11, 2017.\nJump up ^ Kroll, Justin (October 3, 2017). \"Angelina Jolie's 'Maleficent 2' Taps 'Pirates of the Caribbean' Director Joachim Ronning\". Variety. Retrieved October 3, 2017.\nJump up ^ Burke, Carolyn (January 5, 2018). \"Maleficent 2 Sets Spring Filming Start Date\". Screen Rant. Retrieved January 13, 2018.\nExternal links[edit]\nOfficial website\nMaleficent on IMDb\nMaleficent at AllMovie\nMaleficent at the TCM Movie Database\nMaleficent at Box Office Mojo\nMaleficent at Metacritic", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:27:17.922Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think you just got to watch it to see if you like it, the story is ok, but there is also special effects and acting, it is worth watching but not on the must watch list", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:27:20.705Z"
    }, 
    {
      "docIdx": 3, 
      "text": "what are you doing? like sending me links, the links really do not work, \n feels like you may be a chatbot", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:27:48.465Z"
    }, 
    {
      "docIdx": 3, 
      "text": "is this the one that you are referring to?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:27:57.935Z"
    }, 
    {
      "docIdx": 3, 
      "text": "no im not a chatbot", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:28:18.831Z"
    }, 
    {
      "docIdx": 3, 
      "text": "i am trying to figure out what it was and type about it", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:28:32.989Z"
    }, 
    {
      "docIdx": 3, 
      "text": "sounds good", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:28:58.084Z"
    }, 
    {
      "docIdx": 3, 
      "text": "the name of the movie is maleficent, and there Angelina jolie play the fairy, but the link you listed does not work so I can not really verify ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T04:28:59.753Z"
    }, 
    {
      "docIdx": 3, 
      "text": "dying to see it", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T04:29:08.028Z"
    }
  ], 
  "rating": 1, 
  "status": 1, 
  "uid1LogInTime": "2018-03-27T04:18:49.395Z", 
  "uid1LogOutTime": "2018-03-27T04:29:15.628Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-27T04:18:49.507Z", 
  "uid2LogOutTime": "2018-03-27T04:29:12.956Z", 
  "uid2response": {
    "feedback": "the other user seems like a chatbot", 
    "response": [
      1, 
      2, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3512", 
  "user2_id": "USR609", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 22
}