{
  "date": "2018-03-16T20:21:32.386Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello, it's interesting that cinemascore gave the film a rating of 'A' but metacritic gave it 70/100. Do you think theres any reason for that?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:24:20.938Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It could have something to do with superhero movies, as they tend to get lower ratings in general.It could imply that it was excellent for a superhero movie, but not as good as a different genre.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:26:19.240Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have not seen any superhero movies actually, what makes such a big difference with superhero movies and other movies? The cast looks excellent and has lots of names I recognize so I'm surprised about the ratings not being higher", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:28:01.095Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I personally very much enjoy superhero movies, but they tend to not get a lot of recognition. It might be because it has a smaller range of viewers. Comedies are similar because not everyone has the same sense of humor. Not everyone enjoys superhero style movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:29:55.261Z"
    }, 
    {
      "docIdx": 0, 
      "text": "This film reboots the batman series apparently, what does that mean? Is it a continuation from the comic books or previous films?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:32:02.961Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It says in the introduction that it reboots the film series. There are many comics and movies. It's not a continuation, but rather a retelling of the story.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:34:30.720Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh I see, that makes sense. Do you need to know anything about if the previous works in the series are needed to be watched/read to understand everything going on in this film?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:35:28.333Z"
    }, 
    {
      "docIdx": 0, 
      "text": "No. The film is an origin story, so it explains how everything started and how Bruce Wayne became Batman. It's the very beginning of the story.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:36:45.000Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Would you recommend this film even though metacritic gave it a low rating? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:39:23.766Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It has very good critic responses and Rotten Tomatoes gave it an 84% rating, which is pretty good. I'm also very fond of superhero movies, so yes I would.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:40:59.325Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What does it mean that the actors were masquerading as bats? Is that like dressing up as/", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:42:51.502Z"
    }, 
    {
      "docIdx": 1, 
      "text": "They were dressed as and pretending to be bats for a certain scene in the opera", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:43:58.478Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's odd that this whole series of events led to his parents getting murdered. Was there any preemptive reason or was it pure coincidence you think?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:44:49.160Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The city of Gotham is overrun with crime, but Bruce Wayne's parents were also the richest people in the city. Both of those things contributed to the crime.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:46:12.785Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh wow, so that explains where batman gets the money to sustain himself after his parents death, and then go on to become batman. Do you think he feels any responsibility for his parents deaths, since he asked them to leave that night?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:47:01.949Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Certainly. He was just a child and he probably feels that if he hadn't asked to leave that night, his parents would still be alive. Of course we can't know if that is actually true, but that is what he believes.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:49:38.397Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you think it's right that bruce went down the path he did, taking him to prison? Was it necessary for him to become batman and do the things he did later?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:51:16.969Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I don't know that it was necessary, but it's what he felt he had to do. It probably has to do with what happened to his parents. He has to make up for what happened to them in his mind, and he also doesn't want anyone else to go through what he did. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:53:09.377Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you think it was right of him to burn down the temple?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:53:36.426Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He felt it was the only way to stop them from destroying his home. I don't know if it was right, but it was what he thought he had to do.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:55:02.554Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Rachel Dawes tells batman that his father would be ashamed, do you agree?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T20:56:12.384Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Probably. I don't think any parent would want their child to become a murderer.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T20:57:09.111Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's interesting that the plot centers around destroying the city. You would think people who intend to do harm would want a city full of crime to flourish", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T21:00:06.729Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, the league of shadows wants less crime in the world. Since Gotham is so incredibly corrupt, they think the only way to save it is to destroy it. Do you agree with that idea?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T21:02:06.956Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Of course, that makes sense. It seems selfish of batman to want to save it for himself then really", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T21:02:54.504Z"
    }, 
    {
      "docIdx": 3, 
      "text": "But there are a lot of innocent people in Gotham. People like his parents who did nothing wrong.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T21:03:57.981Z"
    }, 
    {
      "docIdx": 3, 
      "text": ". I agree. Its a tough situation really, i hadnt thought about that", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T21:05:28.480Z"
    }, 
    {
      "docIdx": 3, 
      "text": "There tends to be a lot of gray area, but I don't think mass slaughter is an effective solution to any problem.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T21:06:10.871Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-16T20:21:32.386Z", 
  "uid1LogOutTime": "2018-03-16T21:06:23.961Z", 
  "uid1response": {
    "feedback": "The conversation felt forced since the other understood the plot already", 
    "response": [
      1, 
      2, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-16T20:21:32.386Z", 
  "uid2LogOutTime": "2018-03-16T21:07:12.382Z", 
  "uid2response": {
    "feedback": "The conversation was very thoughtful and enjoyable.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4340", 
  "user2_id": "USR1179", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 14
}