{
  "date": "2018-03-07T23:41:46.930Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello, have you seen the movie The Social Network?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T23:43:20.615Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have seen it. You mean the 2010 biographical drama directed by David Fincher, about the founding of Facebook, right\n? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T23:44:35.720Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, the one directed by David Fincher. It was a pretty good movie, it has a CinemaScort rating of a B+", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T23:45:20.057Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yea, I wasn't sure how it would turn out, but Jesse Eisenberg (who played Mark Zuckerberg) did a great job. Although I find it odd that Zuckerburg himself (nor Facebook staff) were involved with the project.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T23:48:01.779Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did too. But, there was several celebrities in it, like Justin Timberlake, he played Sean Parker in the movie. The movie was released to the United States by Columbia Pictures. Amie Hammer played two characters in this movie, Cameron and Tyler Winklevoss. I bet that was challenging.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T23:50:55.660Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm sure it did. And I thought Timberlake was great in his role as well. The film takes liberties with the subject matter, and Aaron Sorkin based his screenplay on the book \"The Accidental Billionaires.\" Not sure how much of it is actually factual, but it's certainly enjoyable. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-07T23:55:35.492Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It has a few critical responses but it what said that this was the movie of the year. They say that Fincher and Sorkin takes this even further then that.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-07T23:58:20.700Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yea the critical response so far has been very positive. It received a 96% on Rotten Tomatoes and a Metacritic Score of 95/100. And I have to say it definitely deserves it. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:02:21.347Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree, it does. Very good movie and I enjoyed the actors in it as well. It is said that not only does the movie portray Facebook, it also portrays the lawsuits as well. I learned some things that I didn't know before I watched it. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:04:14.265Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yea, it really defined the dark irony of the past decade. The scathing wit of the film is laced with an aching sadness. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:09:23.738Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I was surprised to find out that Mark Zuckerberg got 6 months of academic probation for hacking into the college databases.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:11:29.980Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yea turned out to be a blessing in disguise though. Remember how Facemash's popularity attracted the attention of Harvard upperclassmen (and twins) Cameron and Tyler Winklevoss and their business partner Divya Narendra? And then they invite Zuckerberg to work on Harvard Connection (a social network for Harvard students aimed at dating).", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:15:54.773Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, and to think all this started because he was dumped by his then girlfriend, Erica Albright. If he would of never written that insulting entry in his Live Journal blog, then none of this\n popularity and wealth would of happened for him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:18:51.125Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yea, it's funny how it all worked out. He stole the photos of female students, for site visitors to rate, due to the bitterness of being dumped. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:22:24.825Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, he posted them on the campus website that he created. It was called Facemash. Kinda funny, that people were rating females faces on this website with it's given name. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:23:51.540Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Not sure how much of those scenes were factual though. I'd imagine he would get much worse than 6 months of academic probation, just for hacking into the college database, alone. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:27:16.974Z"
    }, 
    {
      "docIdx": 2, 
      "text": "You would think so. Zuckerberg and Saverin met another fellow student, Christy Lee, who asked them to \"facebook me\" and they were impressed by this.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:29:01.399Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yea it was interesting how Lee arranged for Saverin and Zuckerberg to meet Napster co-founder Sean Parker, who\npresented a \"billion dollar\" vision for them. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:31:34.098Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, he suggested that they drop \"the\" from \"T\nhefacebook\" and to just call it Facebook. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:32:56.478Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yea, that was probably for the best. He also suggested the company move to Palo Alto. And Saverin remained in New York to work on business development.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:37:13.135Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes. I'm sure it was! When Parker promised to expand Facebook to two continents, Zuckerberg invited him to live in the house that he was using as the companies headquarters. That was really nice of him.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:38:25.747Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yea, I'm sure Parker impressed Zuckerberg with his vision. Plus he was already expanding to other schools like Yale, Columbia, and Stanford University, anyway. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:43:29.456Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I was surprised to learn the twins claimed that Zuckerberg stole their idea.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:44:12.011Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And Saverin claimed his shares of Facebook were unfairly diluted when the company was incorporated ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:45:52.204Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I also was shocked Zuckerberg sent a friend request to Albright after everyone left.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:46:43.545Z"
    }, 
    {
      "docIdx": 3, 
      "text": "And then refreshing the webpage every few seconds as he waits for her response. Sad. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:48:28.521Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes it was. Well, without her breaking up with him, none of this would of happened. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:48:58.237Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Going back to the lawsuit- I really like how Throughout the film, the narrative is intercut with scenes from depositions taken in the Winklevoss twins' and Saverin's respective lawsuits against Zuckerberg and Facebook. I really pulls\n you in and makes you want to find out more. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:50:20.989Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, I was very interested throughout the\n whole movie. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-08T00:50:45.283Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Indeed. Thanks for chatting with me about the film. I'll probably go and see it on Netflix, again. It was that good. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:51:48.770Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Later", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-08T00:51:54.872Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-07T23:41:46.930Z", 
  "uid1LogOutTime": "2018-03-08T00:52:07.549Z", 
  "uid1response": {
    "feedback": "Had some Superman film info in the 3rd part of the convo document. ", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-07T23:41:46.934Z", 
  "uid2LogOutTime": "2018-03-08T00:50:48.172Z", 
  "uid2response": {
    "feedback": "Good survey", 
    "response": [
      1, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4908", 
  "user2_id": "USR3393", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 17
}