{
  "date": "2018-02-17T20:12:12.181Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi there", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:13:35.613Z"
    }, 
    {
      "docIdx": 0, 
      "text": "La La Land is a critically acclaimed musical starting Ryan Gosling and Emma Stone.  It has very high ratings at sites like Rotten Tomatoes and Metacritics.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:14:18.056Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What kind of ratings did it get?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:14:44.711Z"
    }, 
    {
      "docIdx": 0, 
      "text": "On Rotten Tomatoes, it received a 92% and an average of 8.6/10.  On Metacritics, it received 93/100.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:15:20.843Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That's really good for rotton tomatoes. I like Ryan Gosling and Emma Stone. What is the musical about?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:16:17.687Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is a romantic comedy-drama wherein a jazz pianist (Gosling) and an aspiring actress (Stone) fall in live in LA while pursuing their dreams.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:17:06.136Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That sounds interesting! Is it set in modern times  or in the past?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:17:53.818Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Interestingly, it is tough to tell.  That may be a cinematic \ncomponent in the main characters being out of touch with reality.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:19:49.116Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That would be interesting indeed. I'm not usually a big fan of musicals, but would consider going to see it. When does it come out in theaters?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:20:58.446Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It came out in 2016.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:21:18.398Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I see. I hadn't heard of it and thought it was something new. Why do you say that the characters may be out of touch with reality?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:22:53.003Z"
    }, 
    {
      "docIdx": 1, 
      "text": "For example, in one key scene, the pianist, Sebastian (Gosling), slips into passionate jazz improvisation despite warnings from his boss to stick to traditional Christmas songs to entertain the restaurant-goers.  This gets him fired.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:24:28.888Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Wow, that's intense. Was there a specific reason why he defied his boss? Was he trying to impress the girl? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:25:38.281Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He just loves jazz that much and he wants to pursue his dream at any cost.  He actually brushes off Mia (Stone) when she attempts to compliment him after he is fired.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:26:33.399Z"
    }, 
    {
      "docIdx": 1, 
      "text": "So it isn't about the girl at all and he is really passionate about his music. Does it say where love interest comes into play?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:27:48.119Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well, there is inevitable chemistry between the two main characters.  You first see it when Mia runs into Sebastian at a party where he is playing in a 1980s pop cover band. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:29:13.924Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I see. So it seems that the musical is set in the past but not too distant. Was the movie nominated for any awards?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:31:14.693Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was, but we were just getting to the most interesting part of the plot!  Inspired by Sebastian's commitment to his dream of becoming a jazz performer, Mia writes a one-woman play.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:32:53.671Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Is Mia an actress? Does she ask Sebastian to compose the music for the play?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:34:41.915Z"
    }, 
    {
      "docIdx": 2, 
      "text": "She is an aspiring actress, but like Sebastian, struggling in LA.  He does not compose music for the play, but instead begins to perform regularly at a jazz club.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:36:03.827Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Does Sebastian get a break in his career? Is Mia's play successful?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:38:42.693Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sebastian joins a former classmate's band for steady income even though he is dismayed by the band's pop style.  That band does find success.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:39:52.744Z"
    }, 
    {
      "docIdx": 3, 
      "text": "How does the relationship between Sebastian and Mia turn out. Do they end up being together?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:41:11.398Z"
    }, 
    {
      "docIdx": 3, 
      "text": "During the band's first tour, Mia and Sebastian get into an argument: Mia accuses him of abandoning his dreams.  Sebastian, in turn, thinks she liked hime more when he was struggling and unsuccessful.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:42:34.216Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What does Sebastian do? Does he leave the band to get back to his roots or continue touring with the band?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:43:55.144Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He actually misses Mia's first performance of her play due to a band photo shoot.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:44:54.384Z"
    }, 
    {
      "docIdx": 3, 
      "text": "So there is a struggle between Mia and Sebastian. Do they find a way to make things work?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:46:02.110Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sebastian attempts to apologize to Mia for missing the play, but she is unwilling to forgive him and ends their relationship.  Mia then leaves LA and goes back home to Boulder City, Nevada.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-17T20:46:59.787Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Is that how it ends or do they reunite. Is there a happy ending?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-17T20:48:13.411Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-17T20:12:12.181Z", 
  "uid1LogOutTime": "2018-02-17T20:47:06.279Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-17T20:12:12.382Z", 
  "uid2LogOutTime": "2018-02-17T20:54:14.618Z", 
  "uid2response": {
    "feedback": "I do not generally care for musicals or romantic comedies", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2541", 
  "user2_id": "USR1310", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 3
}