{
  "date": "2018-02-15T21:44:53.441Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello! Do you like scientific movies like The Inception?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T21:46:49.086Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hi there, yes I do, I find that the Inception has brought a fresh idea to the genre with a star studded cast nonetheless. What are your opinions on this movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T21:48:47.932Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I appreciate that there is a little bit of a love story in the movie", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T21:49:20.302Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you agree with the rating from IMDB?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T21:51:38.732Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The whole premise of the movie is quite surreal, imagine being able to go into someone else's dreams and extract information from them, and yes I believe that a movie that is this well thought out deserves the praise it has received.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T21:52:28.492Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree as well. I would even rate it higher than the 8.8 that it received from IMDB. Leonardo DiCaprio is one of my favorite actors.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T21:54:24.994Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you agree that his performance \"has never been better as the tortured hero\" as one critic said?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T21:56:05.937Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Every movie that he is in is great and this movie is no exception, especially when it comes to that review. His performance is able to appeal to the larger audience rather than to just fans of the genre.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T21:57:31.295Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What are your opinions on the last review, it would seem that is quite negative towards the Inception?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T21:58:09.999Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The review you are talking about seems quite harsh and I do not agree with it! I love the idea of the film as I believe it was very original. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:00:10.496Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you think that Christopher Nolan did a good job?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:00:40.864Z"
    }, 
    {
      "docIdx": 0, 
      "text": "[Is the HIT broken? According to the task directions we should have received a new document to discuss by now\n] ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:02:29.631Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I feel the same way, and I believe he hit this out of the park. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:02:44.782Z"
    }, 
    {
      "docIdx": 1, 
      "text": "There we go! Did you think this scene was beneficial to the film?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:03:32.783Z"
    }, 
    {
      "docIdx": 1, 
      "text": "[It would appear there was a mistake, on one part it said 3 back and forth conversations, but later on it mentioned 5, so it would appear it takes 5 to switch the document] ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:05:50.760Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I felt this was a key scene, it is our grounding in reality and the start of their mission. What do you think about the idea of having armed projections to protect your dreams from possible intruders?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:05:53.410Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Excellent and very creative. The idea that there is a need for your dreams to be on constant alert is intriguing.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:07:54.567Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Do you find it interesting that characters can be physically injured by these attacks?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:08:46.733Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I do, I also find it frightening that dying in a dream, at least one of this nature where heavy sedatives are involved, would send the dying person to limbo instead of waking them up. How would you feel arriving in a world almost impossible to escape from made of infinite subconscious. If it weren\n'", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:11:13.227Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I would be so scared! I can not imagine having a \"mission\" like that. Did you appreciate the time element where time flows faster in each level?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:12:22.055Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I do, it adds a sense of tenseness to the whole operation, where in the initial layers they might have a few seconds to spare, in the lower levels it could be hours, or even days. It's scary isn't it how Mal believed that she was still in a dream after leaving limbo, resulting in her killing herself to \"wake up\" in her mind.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:15:13.094Z"
    }, 
    {
      "docIdx": 2, 
      "text": "YES! Very scary! I can't believe Mal refused to return to reality", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:18:22.226Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Should Cobb have been charged with murder?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:18:36.681Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He shouldn't have been but Mal made it seem as if she had been murdered by him, forcing him to flee, even though it meant leaving his children behind. I feel that it had to have been difficult for Cobb to share that Ariadne, such a personal and tragic story.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:21:13.781Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I can't believe Cobb was framed like that! Can you imagine spending 50 years that way though and building this world?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:23:07.410Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I feel that after getting so used to that world, it would be difficult to transition back into what was once my real reality. To spend your entire life somewhere, only to wake up and realize it was simply a dream would be an interesting experience, a tragic one at that.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:24:59.916Z"
    }, 
    {
      "docIdx": 3, 
      "text": "How do you feel about the concept of totems?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:25:23.468Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's interesting, its a fail safe just to make sure that you aren't dreaming. I would get paranoid and always wind up checking it to make sure! It's somewhat bittersweet with Fischer isn't it. On one hand he is being told to break up his fathers energy conglomerate, but in some sense getting the affection his otherwise emotionally cold father would've never given him in real life. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:29:19.148Z"
    }, 
    {
      "docIdx": 3, 
      "text": "definitely bittersweet. I like that Cobb ignores the falling top and joins his children. don't you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:30:54.303Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, even though it might not even be them, he won't take the time to find out as he just wants to be with them. I respect the professor that watched over Cobb's children, it must've difficult to explain to what had happened to their parents.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:33:51.076Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:35:10.906Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you think Cobb should have searched for Saito in Limbo?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:35:46.329Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, no one else knows what can happen to someone who spends to much time in limbo, and he might be the only person to be able to get him out. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:36:41.106Z"
    }, 
    {
      "docIdx": 3, 
      "text": "definitely", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:36:54.868Z"
    }, 
    {
      "docIdx": 3, 
      "text": "it was good chatting with you", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:37:02.896Z"
    }, 
    {
      "docIdx": 3, 
      "text": "it was, have a nice day!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-15T22:37:18.826Z"
    }, 
    {
      "docIdx": 3, 
      "text": "you also", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-15T22:37:34.231Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-15T21:44:53.441Z", 
  "uid1LogOutTime": "2018-02-15T22:37:47.999Z", 
  "uid1response": {
    "feedback": "It was slightly confusing as the initial document that we were given took longer to change than the ones that came after it, but other then that, everything went smoothly.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-15T21:44:53.475Z", 
  "uid2LogOutTime": "2018-02-15T22:37:35.919Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3173", 
  "user2_id": "USR1225", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 5
}