{
  "date": "2018-03-20T16:24:06.826Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Let's talk about Monster's University", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:24:27.828Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ok, what is it about", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T16:24:45.912Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Monsters University is a 2013 American 3D computer-animated comedy film produced by Pixar\nAnimation Studios for Walt Disney Pictures.[6] It was directed by Dan Scanlon and produced by\nKori Rae, with John Lasseter, Pete Docter, Andrew Stanton and Lee Unkrich as executive\nproducers.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:25:17.298Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The music for the film was composed by Randy Newman, marking his seventh\ncollaboration with Pixar.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:25:28.987Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Who stars in it", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T16:26:05.475Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Billy Crystal as Michael \"Mike\" Wazowski", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:26:52.422Z"
    }, 
    {
      "docIdx": 0, 
      "text": "John Goodman as James P. \"Sulley\" Sullivan", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:26:58.788Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Steve Buscemi as Randall \"Randy\" Boggs", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:27:05.346Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Helen Mirren as Dean Abigail Hardscrabble, the chair of the Scarer program at Monsters\nUniversity", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:27:11.056Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Ok. Thank you.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T16:27:14.512Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Peter Sohn as Scott \"Squishy\" Squibbles, an Oozma Kappa fraternity member", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:27:16.996Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The music for the film was composed by Randy Newman, marking his seventh\ncollaboration with Pixar.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:27:25.027Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It was the fourteenth feature film produced by Pixar, and is a prequel to\n2001's Monsters, Inc., marking the first time Pixar has made a prequel film.[7]", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:27:29.791Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Monsters University\ntells the story of two monsters, Mike and Sulley, and their time studying at college, where they start\noff as rivals, but slowly become best friends.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:27:38.812Z"
    }, 
    {
      "docIdx": 0, 
      "text": "John Goodman, Billy Crystal, Steve Buscemi, Bob\nPeterson, and John Ratzenberger reprise their roles as James P. Sullivan, Mike Wazowski,\nRandall Boggs, Roz, and the Abominable Snowman, respectively. Bonnie Hunt, who played Ms.\nFlint in the first film, voices Mike's grade school teacher Ms. Karen Graves.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:27:49.833Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sounds interesting. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T16:28:25.997Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Thanks for telling me about it. I am interested in watching.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T16:29:38.034Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Critical Response", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:36:44.389Z"
    }, 
    {
      "docIdx": 1, 
      "text": "\"is true to the spirit of [Monsters, Inc.] and matches its tone. But it never seems content to\nturn over old ground.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:36:53.062Z"
    }, 
    {
      "docIdx": 1, 
      "text": "\"It has enough of the right stuff to haunt the imagination long after the immediate buzz of\nits fluffy-furred cuteness has melted away. For a mere prequel, that's a result.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:36:59.914Z"
    }, 
    {
      "docIdx": 1, 
      "text": "\"is cute, and funny, and the animation, though not exactly inspired, is certainly colorful.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:37:03.925Z"
    }, 
    {
      "docIdx": 1, 
      "text": "\"This is a safe, predictable, edge-free, nearly bland effort from a studio that rarely hedges\nits bets.\"", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:37:07.794Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Key Scenes..", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:38:13.288Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Michael \"Mike\" Wazowski, a 7-year-old monster, aspires to become a scarer – a monster\nwho enters the human world at night to scare children and harvest their screams for energy\n– when he grows up after visiting Monsters Inc., Monstropolis' most profitable scaring\ncompany, on a school field trip.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:38:24.234Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Eleven years later, Mike is a first-year scare major at\nMonsters University, where he meets fellow monster, James P. \"Sulley\" Sullivan.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:39:07.001Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Mike\nstudies hard, while the privileged Sulley, coming from a family of talented scarers, relies\nonly on his natural ability and begins to falter.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:40:11.249Z"
    }, 
    {
      "docIdx": 1, 
      "text": "As the semester progresses, Mike and Sulley\nattempt to join a fraternity, but only Sulley is accepted into Roar Omega Roar, the strongest\nfraternity on campus.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:40:35.259Z"
    }, 
    {
      "docIdx": 1, 
      "text": "At the semester's final exam, a fight between the two causes them to\naccidentally break Dean Abigail Hardscrabble's cherished Scream Can.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:40:50.239Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Hardscrabble fails\nboth of them immediately, stating that Sulley does not study enough, and Mike is not scary\nenough.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:40:58.168Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Great", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T16:41:08.344Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Have you seen the 1st one?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:41:20.176Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes I have", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T16:45:33.364Z"
    }, 
    {
      "docIdx": 1, 
      "text": "This is probably as good as the first. more laughs", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:49:44.636Z"
    }, 
    {
      "docIdx": 1, 
      "text": "i like the monsters designs", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:50:10.558Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, I enjoyed the first film very much so I'm sure I will like the sequel. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T16:52:36.849Z"
    }, 
    {
      "docIdx": 2, 
      "text": "more key scenes...", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:54:24.432Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Wanting to prove himself, Mike enters the university's \"Scare Games\", and makes a wager\nwith Hardscrabble to reinstate him and his team to the scare program if they win, but Mike\nmust leave the university if they lose.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:54:37.792Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He joins a group of misfits named Oozma Kappa, the\nweakest fraternity on campus, but they are denied entry to the Games for being one team\nmember short.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:54:44.804Z"
    }, 
    {
      "docIdx": 2, 
      "text": "short. Sulley subsequently joins them, seeing the competition as his ticket back\ninto the scare program.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:55:09.601Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oozma Kappa finish last in the first challenge, but are saved from\nelimination after another team is disqualified for cheating.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:55:15.296Z"
    }, 
    {
      "docIdx": 2, 
      "text": "cheating. Oozma Kappa improve gradually\ndue to Mike's training and intricate knowledge of scaring, and they advance through each\nfollowing challenge, finishing just behind Roar Omega Roar.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:55:40.391Z"
    }, 
    {
      "docIdx": 2, 
      "text": "In the final round, they defeat\nRoar Omega Roar with a decisive final scare by Mike in the simulation bedroom.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:55:50.304Z"
    }, 
    {
      "docIdx": 2, 
      "text": "However,\nMike soon discovers that he only won because Sulley tampered with the machine's difficulty\nto the easiest setting.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T16:55:56.128Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Monsters University is a 2013 American 3D computer-animated comedy film produced by Pixar Animation Studios for Walt Disney Pictures.[6] It was directed by Dan Scanlon and produced by Kori Rae, with John Lasseter, Pete Docter, Andrew Stanton and Lee Unkrich as executive producers. The music for the film was composed by Randy Newman, marking his seventh collaboration with Pixar. It was the fourteenth feature film produced by Pixar, and is a prequel to 2001's Monsters, Inc., marking the first time Pixar has made a prequel film.[7] Monsters University tells the story of two monsters, Mike and Sulley, and their time studying at college, where they start off as rivals, but slowly become best friends. John Goodman, Billy Crystal, Steve Buscemi, Bob Peterson, and John Ratzenberger reprise their roles as James P. Sullivan, Mike Wazowski, Randall Boggs, Roz, and the Abominable Snowman, respectively. Bonnie Hunt, who played Ms. Flint in the first film, voices Mike's grade school teacher Ms. Karen Graves.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T17:26:33.029Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Disney, as the rights holder, had plans for a sequel to Monsters, Inc. since 2005. Following disagreements with Pixar, Disney tasked its Circle 7 Animation unit to make the film.[8] An early draft of the film was developed; however, Disney's purchase of Pixar in early 2006 led to the cancellation of Circle 7's version of the film.[9] A Pixar-made sequel was confirmed in 2010,[6] and in 2011, it was confirmed that the film would instead be a prequel titled Monsters University.[10]", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T17:26:44.707Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Monsters University premiered on June 5, 2013 at the BFI Southbank in London, England, and was released on June 21, 2013, in the United States. It was accompanied in theaters by a short film, The Blue Umbrella, directed by Saschka Unseld.[11] The film grossed $744 million against its estimated budget of $200 million, making it the seventh highest-grossing film of 2013.[3][5] An animated short film titled Party Central, which takes place shortly after the events of Monsters University, premiered in Fall 2013.[12][13]", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T17:26:51.126Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Michael \"Mike\" Wazowski, a 7-year-old monster, aspires to become a scarer – a monster who enters the human world at night to scare children and harvest their screams for energy – when he grows up after visiting Monsters Inc., Monstropolis' most profitable scaring company, on a school field trip. Eleven years later, Mike is a first-year scare major at Monsters University, where he meets fellow monster, James P. \"Sulley\" Sullivan. Mike studies hard, while the privileged Sulley, coming from a family of talented scarers, relies only on his natural ability and begins to falter. As the semester progresses, Mike and Sulley attempt to join a fraternity, but only Sulley is accepted into Roar Omega Roar, the strongest fraternity on campus. At the semester's final exam, a fight between the two causes them to accidentally break Dean Abigail Hardscrabble's cherished Scream Can. Hardscrabble fails both of them immediately, stating that Sulley does not study enough, and Mike is not scary enough.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T17:26:59.036Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Wanting to prove himself, Mike enters the university's \"Scare Games\", and makes a wager with Hardscrabble to reinstate him and his team to the scare program if they win, but Mike must leave the university if they lose. He joins a group of misfits named Oozma Kappa, the weakest fraternity on campus, but they are denied entry to the Games for being one team member short. Sulley subsequently joins them, seeing the competition as his ticket back into the scare program. Oozma Kappa finish last in the first challenge, but are saved from elimination after another team is disqualified for cheating. Oozma Kappa improve gradually due to Mike's training and intricate knowledge of scaring, and they advance through each following challenge, finishing just behind Roar Omega Roar. In the final round, they defeat Roar Omega Roar with a decisive final scare by Mike in the simulation bedroom. However, Mike soon discovers that he only won because Sulley tampered with the machine's difficulty to the easiest setting.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T17:27:07.722Z"
    }, 
    {
      "docIdx": 2, 
      "text": "ground.\"\n● \"It has enough of the right stuff to haunt the imagination long after the immediate buzz of\nits fluffy-furred cuteness has melted away. For a mere prequel, that's a result.\"\n● \"is cute, and funny, and the", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T17:37:59.082Z"
    }
  ], 
  "rating": 2, 
  "status": false, 
  "uid1LogInTime": "2018-03-20T16:24:06.826Z", 
  "uid1LogOutTime": "2018-03-20T17:56:29.941Z", 
  "uid1response": {
    "response": [], 
    "type": "abandonWithoutAnsweringFeedbackQuestions"
  }, 
  "uid2LogInTime": "2018-03-20T16:24:06.889Z", 
  "user1_id": "USR144", 
  "user2_id": "USR4833", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 23
}