{
  "date": "2018-03-16T18:34:21.950Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hey there, have you seen Batman v Superman: Dawn of Justice?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:35:14.085Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, it was an ok movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:35:31.643Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I though it was okay as well.  I did not care of Ben Affleck as Bruce Wayne", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:36:29.232Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I 100% agree. I wonder why they chose him over more obvious people who were better suited for the part. How did you feel about the story line?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:37:57.199Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It seemed really long and drawn out.  Jesse Eisenberg as Lex Luthor was a bit strange in my opinion especially the jolly rancher scene.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:38:45.713Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I actually think that Jesse Eisenberg was a great Lex Luthor. I can't really think of a better person to fill that role. I also approve of Henry Cavill  as Superman. Are you more for Batman or Superman?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:41:34.238Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am definitely more for Superman.  Henry Cavill is amazing for the part.  It really really bothered me when he died. How do you feel about Wonderwoman being in there?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:44:22.512Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am more for Batman. I mean he has no special powers just his money. That is awesome.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:46:29.900Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you think Zach Snyder did a good job directing? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:46:58.475Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Wonderwoman seemed to be just added with no particular point. I mean I am sure it was to hint at the Justice League. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:47:46.302Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The movie was directed well but the screen writers should have done a little better. In my opinion. What would you have changed about the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:48:46.544Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I enjoyed how dark the filming was.  I have a soft spot for those.  Honestly I wouldn't have casted Ben Afleck and probably would have shortened the film just a bit more or would have split it into two movies.  What about you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:50:17.983Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Who would you prefer to play Batman? Christian Bale turned down the role if I remember correctly.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:51:38.245Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You know I am not sure.  He's always been Batman to me so if not him then maybe someone that could hold the role better.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:53:16.867Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That is what I was thinking. Christian Bale did a great job. How would you turn it into two movies?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:54:58.236Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I would probably split it about halfway through and leave it on a cliff hanger.  Just so no one loses interest.  What would you like to change about the movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:56:04.102Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Everything. Except Jesse and Henry. I feel like they shouldn't have made a movie putting them against each other or they maybe make another where Superman wins. Even it out a bit.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T18:58:40.561Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I have to agree.  Maybe Jesse would have been more tolerable if he had been in a different situation. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T18:59:50.123Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I also think Martha should have been played by Julianne Moore. Not sure about Amy as Lois Lane either.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T19:01:27.760Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Julianne Moore would have been perfect as Martha!  I don't care for Amy as Lois Lane tbh.  Maybe Bryce Dallas Howard would have been a better fit if they wanted a redhead.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T19:02:08.302Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Ooh Bryce Dallas Howard...yes that would have been fantastic. They should have made that choice...What were they thinking?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T19:04:02.597Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I have no clue.  Maybe she was just too busy with other movies.  I mean they recasted batman they could have recasted Lois Lane too", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T19:04:34.856Z"
    }, 
    {
      "docIdx": 3, 
      "text": "This movie was 3 hours long of just bad casting choices.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T19:05:04.637Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes it was!  For some reason it bothered me watching Lex take Zod's body and mutilates it into something terrible.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T19:06:05.506Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I will say Gal Gadot was great as Wonderwoman but like I stated before. It didn't make much sense for her to be there. Possible sex appeal?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T19:06:13.809Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think so.  That and to get people all keyed up for Justice League and Wonderman in general.  She did do a great job though, she certainly\n fits the part.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T19:06:46.315Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I will have to agree with you on that...weird. Then again, Lex is a weird guy even in the comics.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T19:07:23.759Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Did it really explain why Batman thought Superman was a threat? For some reason I am coming up with a blank on that.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T19:09:43.545Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think just because Lex played them against each other.  Also because of what had happened with Zod before and the fact that Superman was kinda encroaching on his territory in a way.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T19:10:45.832Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Then again realistically Batman really had no place to judge because he had been painted as a villain as well so he should understand first hand that possibly Superman wasn't malignant\n. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-16T19:11:24.569Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes I knew the fight against Zod had something to do with it. I mean there was a lot of damage done.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T19:11:45.167Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh yes. This is very true. He was even on the run.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-16T19:12:12.898Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-16T18:34:21.950Z", 
  "uid1LogOutTime": "2018-03-16T19:12:10.596Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-16T18:34:21.954Z", 
  "uid2LogOutTime": "2018-03-16T19:12:16.195Z", 
  "uid2response": {
    "feedback": "I don't remember a lot of the movie.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR116", 
  "user2_id": "USR3119", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 13
}