{
  "date": "2018-03-20T19:27:13.953Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello.  Did you see Toy Story when it came out in 1995?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:28:16.748Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes I did I loved the movie", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T19:29:07.509Z"
    }, 
    {
      "docIdx": 0, 
      "text": "So did I.  A lot of other people did too.  It has a 100% rating on Rotten Tomatoes.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:29:55.968Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What genre was this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T19:32:12.162Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Toy Story was an animated adventure comedy.  Did you know Woody the cowboy doll was voiced by Tom Hanks?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:33:30.689Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes I did, Did you know Tim Allen Played Buzz Lightyear.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T19:34:46.398Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I did.  I really liked the way that they portrayed the competition between Buzz Lightyear and Woody for their owner Andy's affection.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:36:02.569Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree with that. they knew how to appeal to a kid's heart. Did you know that pixar animation studios worked on the film with walt disney?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T19:38:50.410Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I remember hearing about that.  I really liked Randy Newman's music in the movie, how about you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:40:08.577Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I loved a Friend In need. That was my favorite song", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T19:42:16.535Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That was a great song and the scene was really touching.  I liked the use at the end of the movie showing how Woody and Buzz had become friends.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:44:10.516Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Me too I liked in the beginning of the movie The toys are doesn't relaize his birthday has been moved up a week. and shortly after buzz is introduced", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T19:46:45.989Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I thought the idea of toys being alive but only when humans aren't present was really clever.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:47:33.515Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes it was very clever, I also attribute the success of the movie to John Lasseter's directing style. He did a great job making all the characters come together.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T19:50:26.279Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree.  I also think that Tim Allen's portrayal of Buzz Lightyear as a toy who thought he was an actual space ranger was wonderful.  The scene where Buzz realizes that he is a toy has always made me feel very strongly.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:53:06.498Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes It made me feel a deep connection as well. Did you know one of the executive producers was Steve Jobs?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T19:55:56.600Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No, I didn't realize that.  Do you remember when Woody accidentally knocked Buzz out of the window and none of the other toys believed that it was an accident?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T19:58:19.823Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, I do I felt sad in that moment and wanted them to believe woody. Do you remember when woody get's stuck in the arcade game and Sid retrevies him?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T20:01:27.967Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I was always afraid of Andy's neighbor Sid.  He was a scary kid.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T20:02:54.506Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes he was. Everything works out in the end though. What did you think about when Andy took woody instead of buzz. I was a little bit sad but I know they become friends in the end.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T20:08:30.745Z"
    }, 
    {
      "docIdx": 2, 
      "text": "When I was a kid, I remember thinking that it was a little mean of Andy to forget about Buzz and take Woody.  After all, they were going to Pizza Planet.  That would be perfect for Buzz Lightyear.  Do your remeber how excited Buzz was to see all of the space games at that restaurant?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T20:11:06.696Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes I do remember and he hitches a ride with a few other toys and go to the restaurant with Andy, stowed away. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T20:13:22.267Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wasn't it exciting when Woody and Buzz were trying to get into the moving truck with the rest of Andy's toys?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T20:14:11.627Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes it was I remember that know! they eventually made it to the truck but they thought that woddy was trying to get rid of rc but eventually they realize the mistake. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T20:18:01.309Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That was a little sad", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T20:18:09.150Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Oh yes, I forgot that the toys thought Woody was trying to get rid of RC.  I thought it was really neat when Woody lit the rocket on Buzz's back to catch up to the truck after RC's battery died.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T20:19:48.504Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That was really inventive thinking on Woody's part. I also Like at the end on Christmas day they have a mission to see what new toys there might be but after discovering that it is a puppy they share a smile", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T20:21:27.794Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I did like that scene, it was a nice callback to Sarge and the other toy soldiers doing reconnaissance like they did at Andy's birthday party.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T20:23:05.635Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was just like Andy's birthday party. My favorite toy story characters are Buzz and Woody, but I also have a soft spot for Rex and the other toys.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T20:24:44.758Z"
    }
  ], 
  "rating": 2, 
  "status": 1, 
  "uid1LogInTime": "2018-03-20T19:27:13.953Z", 
  "uid1LogOutTime": "2018-03-20T20:25:47.456Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-20T19:27:14.010Z", 
  "uid2LogOutTime": "2018-03-20T20:24:48.332Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1653", 
  "user2_id": "USR472", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 29
}