{
  "date": "2018-02-16T02:16:35.403Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi! It seems like the critic reviews were pretty mixed here.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:17:53.977Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you notice that it had a high score on Rotten tomatoes?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:18:40.715Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, very surprising! Plus a CinemaScore of A which is cool.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:22:11.917Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely.  I wonder if the CinemaScore has to do with the really great 3D animation.  The 3D animation used was\n great.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:24:29.766Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I agree! Plus the really strong cast, Gerard Butler and Jay Baruchel really made the movie amazing.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:25:19.493Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I love both of them.  I find it hard to agree with one of the reviews that didn't think it was funny.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:26:15.077Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely. Plus the one that says there wasn't much to character or story development, I definitely think there was a strong storyline.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:27:33.300Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Agreed!!!  I know that book adaptions are hard because die hard fans of the book are looking for specific things that remind them of what they read. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:28:34.827Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's hard not to hold a grudge against a movie based on a book, that's for sure. I didn't realise this was directed by the same guys who directed Lilo and Stitch, they really know their stuff!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:30:08.332Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I didn't realize that either.  Plus I assumed that it was made by Pixar but instead it was released by DreamWorks.  They aren't known for the innovative animation that Pixar is.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:31:55.777Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I didn't realise that Hiccup is only 15! I thought he was older than that for some reason.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:32:43.495Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I didn't realize that either.  It makes him saving the dragon that much more endearing", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:33:29.199Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Definitely. Such a kind heart for a young boy. I love the part when he sets the dragon free, it really touches my heart.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:34:15.362Z"
    }, 
    {
      "docIdx": 1, 
      "text": "OMG I know.  It totally made me cry.  Plus Hiccup is amazing for all his inventions.  I love that he keeps trying even though they backfire.  He doesn't give up.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:35:19.078Z"
    }, 
    {
      "docIdx": 1, 
      "text": "His inventions are really cool, it's interesting to see such innovation in a kid's movie, it's a good example to set for younger kids.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:36:37.857Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He's definitely a great example and totally relateable to the the awkward middle school kids who aren't doing what they would like to do", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:39:04.371Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I love that he named the dragon Toothless, it's such a cute name for a fearsome dragon.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:40:22.894Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was really clever.  You would assume by his name that his issue was with his teeth and not his crippled fin", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:41:20.369Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Right? And his face when he retracts his teeth is so cute, he looks like a cat.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:41:47.957Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Kind of reminded me of the chershire cat from Alice in wonderland.  I was surprised that the blacksmith was the one teaching the dragon fighting class", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:42:50.015Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Gobber was easily one of my favourite characters, he provided so much comedy.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:43:40.653Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Craig Ferguson was the perfect person to play that part.  So hilarious!!!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:44:12.895Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He's such a phenomenal actor, I love all of his work. I love that once Hiccup bonds with Toothless, he won't harm another dragon, even for his father.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:45:17.955Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He knew the risk of bonding with toothless and was willing to risk being disowned in order to act according to what he believes is right.  such an amazing message for kids  :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:46:23.293Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Right? Always stand up for what is right, even if you're opposed by your family or friends. The right thing to do isn't always the easiest.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:48:29.401Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Definitely.  I'm sure it was devastating for Stoick to see his son almost die because of a situation he put him though", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:49:39.826Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, I'm glad it all turned out okay. They all learned some pretty important lessons throughout the story.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:50:26.018Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Definitely.  It's a great movie for parents to take their kids to where they will have fun and not realized that they are learning some really important lessons", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:51:13.465Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Plus it's a fun movie! Critics may not have received it well, but I don't know any kids who've seen this movie and didn't enjoy it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:51:58.479Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's probably why it got an 98% on Rotten Tomatoes versus the critics", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:53:07.896Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Probably. When I watch movies I usually trust regular people's reviews and ratings more than the critics, I think they're jaded by being so involved in the movie industry.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T02:53:52.733Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Me too!!! I think that critics aren't always looking for the same things as the intended audience for the movie", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T02:54:51.382Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-16T02:16:35.403Z", 
  "uid1LogOutTime": "2018-02-16T02:54:53.546Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-16T02:16:35.414Z", 
  "uid2LogOutTime": "2018-02-16T02:54:19.151Z", 
  "uid2response": {
    "feedback": "Easy, excellent conversation.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1868", 
  "user2_id": "USR3610", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 10
}