{
  "date": "2018-03-22T15:09:20.613Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "good morning", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:10:20.864Z"
    }, 
    {
      "docIdx": 0, 
      "text": "good morning to you", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:10:27.784Z"
    }, 
    {
      "docIdx": 0, 
      "text": "this is new to me so I will try to do my best", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:10:48.101Z"
    }, 
    {
      "docIdx": 0, 
      "text": "me also lol we can tak baby steps ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:11:08.273Z"
    }, 
    {
      "docIdx": 0, 
      "text": "^^ So the film is pretty much a classic: Home Alone", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:11:22.351Z"
    }, 
    {
      "docIdx": 0, 
      "text": "great movie is it in the summer winter ?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:11:43.690Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It takes place during Christmas, do you have an affinity for those kinds of Christmas films?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:12:18.594Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like Christmas films brings the family together ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:12:47.515Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Snow setting in the mountains or suburban area?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:13:22.902Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's right. Now, the film has some pretty great folks associated with it, you have Chris Columbus famous for numerous films, but you also have John Hughes writing, Joe Pesci in the cast, it's supposed to be funny. In the suburbs, definitely", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:14:13.773Z"
    }, 
    {
      "docIdx": 1, 
      "text": "ok great. love joe pesci. what style of home ubdate or modern. I like the older passed down house look gives the story some depth ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:15:58.968Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The first scene sounds like a doozy, have you ever had trouble with older siblings?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:17:09.368Z"
    }, 
    {
      "docIdx": 1, 
      "text": "lol yes I did they made for great stories later on in life", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:18:07.512Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You should love the opening then, at the very least, crazy things happen from the get go. The film surprisingly, didn't have that good of a critical reception at the time it was released. Do you usually listen to critics?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:19:04.483Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I used to watch sisbrg an ebert reviews. but  didn't follow there advise\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:20:37.957Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Home Alone actually has a 62 % on Rotten Tomatoes, and an average rating of 5.5/10, ridiculous in my opinion, what do you think?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:21:26.925Z"
    }, 
    {
      "docIdx": 2, 
      "text": "yes the movie is an all time brigde between ages me an mother still watch it with the kids. my wife bought the dvd set an vhs set just to keep an pass it along. wow  American CLASSIC. I LOVE THE MOVIE ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:23:41.501Z"
    }, 
    {
      "docIdx": 2, 
      "text": "So do I ;-) All time classic. Seeing the description of the second scene, I was wondering if you were ever in a situation where you were stranded at an airport, or somehow someone who was supposed to be here was left behind?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:24:53.051Z"
    }, 
    {
      "docIdx": 2, 
      "text": "scene setting is great airports have great lighting an back grounds. why yes i was stranded at an airport ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:26:30.881Z"
    }, 
    {
      "docIdx": 2, 
      "text": "For how long were you stranded? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:27:22.844Z"
    }, 
    {
      "docIdx": 2, 
      "text": "12 hours at Regan national i was 13 ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:28:02.520Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wow ! Well, Kevin is just a boy, 8 actually in the film, alone in his house, was it scary? Did it make you empathize deeper with Kevin as a result?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:29:12.688Z"
    }, 
    {
      "docIdx": 3, 
      "text": "ok 8 is a frightening time growing up especially in a house that have sounds that make the imagination go wild, yes i did empathize with him the feeling of being left carries\n along way.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:31:15.646Z"
    }, 
    {
      "docIdx": 3, 
      "text": "exactly. How did you like seeing Kevin actually rigging the house with all those booby traps, did it feel believable to you? Was it too much? Some critics seemed to think so", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:32:52.253Z"
    }, 
    {
      "docIdx": 3, 
      "text": "None of the critics have imagination. Tel\nsa had imagination Albert Einstein Had imagination. people whom criticize tend to think only logically. So yes I believe the rigging could work, its never to much when a child is using his imagination an building skills; guess the first flight test was a fluke if they had to be there the critics of this error of course.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:37:18.315Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's been criticized by a few as being implausible and therefore hard to care about Kevin, I disagree completely. Did it feel sadistic though to you? In the way it was done?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:38:44.301Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wow the movie is based on being left an defending the home an protecting one self with minimal impact but a lot of laughs. Some people forget the 3 stooges, a lot of there scenes where real an well thought out. The riggings work if your a boy scou\nt an prankster. It wasn't sadistic it was compassion an hilarious to see people still getting feathered  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:42:56.096Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I completely agree. Which performance was your favorite in the film?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-22T15:44:03.133Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yes awesome", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:45:01.116Z"
    }, 
    {
      "docIdx": 3, 
      "text": "my favorite was the scene with the paint bucket an the stairs classic", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-22T15:45:51.480Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-22T15:09:20.613Z", 
  "uid1LogOutTime": "2018-03-22T15:49:15.265Z", 
  "uid1response": {
    "feedback": "Speaking with the other User was easy an comfortable. The movie itself is a classic during the holidays of snow days. An where just getting some snow an need a vacation I can watch this with the family today. Thank you", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-22T15:09:20.701Z", 
  "uid2LogOutTime": "2018-03-22T15:44:09.620Z", 
  "uid2response": {
    "feedback": "The AI on the other end is still quite rough, numerous typos but overall understandable, answers quite slow to come however", 
    "response": [
      1, 
      2, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2349", 
  "user2_id": "USR347", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 20
}