{
  "date": "2018-02-18T22:08:11.627Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "hello", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:09:08.088Z"
    }, 
    {
      "docIdx": 0, 
      "text": "hello there", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:09:11.684Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What did you think of Leonardo decapirao in this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:09:43.550Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Leonardo Dicaprio was fantastic in this movie. One of my favorites of his. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:10:01.662Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I throughly enjoyed the movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:10:25.416Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you enjoy Joseph Gordon-Levitt's performance?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:10:27.643Z"
    }, 
    {
      "docIdx": 0, 
      "text": "He was okay but I preferred Leonardo's character much better.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:11:08.687Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you like the dream sequences, they seemed so real.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:11:22.009Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did. I think it was even crazier how they would place dreams within a dream. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:11:45.627Z"
    }, 
    {
      "docIdx": 0, 
      "text": "How each dream added a new layer to the last. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:11:51.595Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes the female Ellen Page was amazing.  Did you like her performance too?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:12:07.882Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I do like Ellen Page. It wasn't one of my favorite performances of hers. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:12:50.638Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I did not like the tsaumi, it gave me nightmares. LOL  What did you think of the visuals in that sequence?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:13:49.321Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The visuals were amazing. It's also crazy how the visuals became more intense each level of the dream they went deeper. Did you like the scene where they first enter into Fisher's dreams? I like the idea of the \"kick\" that they had setup to ensure that they were able to get back to the first level of consciousness", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:15:03.709Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, I remember that part it was amazing the imagery and how detailed everything was in the dream sequence..  I like how they would forget being in the dream and believing it was real.  Like how Cobb revealed he was dying in the dream.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:16:28.031Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That was a powerful scene. I think even despite that they were being attacked and setback that they still agreed to continue with the mission. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:17:26.460Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I liked how it wove in and out on Dominick performing espionage to take over the company and infiltrate the subconscious minds of their targets to obtain information.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:18:58.808Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was such a crazy idea of a plot and that it worked well. How did you feel about the scene when Cobb revelaled that his wife had committed suicide because she was unable to accept their reality after having been in limbo for so long?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:20:28.766Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I cried it, it made me so sad.  It must have been very difficult for her to live like that everyday.  It was sad to see the old man mourn too.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:21:26.563Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes it was. I think it was even more sad on the fact that he had to flee the US for something that he hadn't done and be away from his children. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:22:11.338Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, that was horrible.  It was like being in a war and running for your life, knowing you could never come back again.  It was a well thought out sequence.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:23:17.806Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think that part of the back story added so much to the over all plot and explained the difficult place that Cobb was living in. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:24:18.295Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He had to convenience Fisher's son Robert to dissolve his father's company.  That must have been a horrible thing to do to that kid.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:25:26.683Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree. I'm happy that Cobb was able to eventually make peace with his wife's death. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:26:37.352Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I was just thinking about the garden sequence when he got to see his children.  It must have been difficult for him to leave them.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:28:46.596Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I couldn't imagine the pain that would come from having to make a choice. I'm also happy that he was able to find Saito in the limbo sequences to hold up that end of the deal. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:29:36.544Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I wonder if he hadn't have found Saito if he would have remained in limbo.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:29:51.993Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, that was phenomenal that he was able to do that. The build up of anxiety was so riveting during the movie.  I was on the edge of my seat during the different scenes.  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:30:52.763Z"
    }, 
    {
      "docIdx": 3, 
      "text": "As was I. I still often wonder if him returning to his children was a dream sequence or not. Since the story doesn't let us see if the top falls over, we may never know. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:31:38.959Z"
    }, 
    {
      "docIdx": 3, 
      "text": "You are right, now I am going to think about that and relive the movie again in mind.  I can not see that he really did ever see his children.  ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:32:44.638Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was done on purpose to let the viewer wonder. Well thank you for taking your time to chat with me. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-18T22:33:22.764Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I was just thinking about the spinning top it was they way he tested to prove that he was in the real world, did you notice that?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-18T22:34:06.886Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-18T22:08:11.627Z", 
  "uid1LogOutTime": "2018-02-18T22:34:04.355Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-18T22:08:11.652Z", 
  "uid2LogOutTime": "2018-02-18T22:34:08.628Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4186", 
  "user2_id": "USR503", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 5
}