{
  "date": "2018-03-27T16:09:40.008Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello there, the movie document provided is about the new film out 'The Shape of Water' by Del Toro. Have you heard about this movie before?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:11:59.076Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think I have heard about it. Didn't it get a bunch of awards?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:12:39.300Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah it did, it's got really high ratings on many platforms too, even though the movie has some unconventional themes like inter-species relationships. I didn't expect a positive reception", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:14:59.753Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Huh inter-species relationships sounds interesting I guess it proves love has no bounds. Could you give me a bit more about the story line without giving away the whole thing? I really don't like when I'm told the whole movie before I see it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:17:01.777Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I get the same way, I'm even avoiding most trailers these days. The story is of a mute woman working as a janitor in a secret government lab. The movie is through and through a love story, if you enjoy those kinda movies you'll probably like this movie. The director is great at his craft.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:19:46.643Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sounds interesting and like something I will have to check out. I love love lol of course getting the hubby to watch probably won't happen. Thanks for the info :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:21:07.422Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wouldn't watch it with any children around though, just a warning :). I've seen the film and I quite enjoyed my time with it, hard movie for me recommend  to friends though with it being a romance and me being a guy :P", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:23:29.343Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Well that just gave me leverage to get my hubby to watch. Proof his man card won't be ripped away lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:24:21.229Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Made by the same guy who made Hellboy, Pans labyrinth and pacific rim, not really love movies so it was pretty shocking to see him handle this kinda movie so well. I'm a big movie lover so I usually know all these useless facts about them ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:29:34.311Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm the same way with music I can tell you all about a song and the lyrics stick with me forever but don't ask me who sings it or the title lol. \nIsn't there another movie or 2 you want to talk about?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:30:49.654Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah but I'm not entirely sure about how all this works. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:33:57.113Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The instructions said 3 movies and after three responses on to the next for a total of 15 responses which is what we needed for a minimum.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:35:17.926Z"
    }, 
    {
      "docIdx": 1, 
      "text": "sorry 5 responses", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:35:38.596Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I've got the document at the side, just the shape of water that's here. Tasks to tell you about the movie and convince you to watch or not watch it, we achieved that quite quickly. Says I will get the next movie automatically after \"3 turns\n\"", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:37:16.938Z"
    }, 
    {
      "docIdx": 1, 
      "text": "well then guess they have something broke or this is really what they want to see how we react to something not working lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:38:25.084Z"
    }, 
    {
      "docIdx": 2, 
      "text": "You never know lol. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:39:03.008Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Mine just says to make sure I get the title and info on the movie to make a decision at the feedback page.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:39:27.913Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Your right I have done some studies where they say at the end thanks and we were really looking for xyz not abc  :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:40:03.618Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Is your finish conversation button clickable? Maybe you have to click it to go to the next one", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:40:49.689Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Ah yeah mine is grayed out.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:41:09.523Z"
    }, 
    {
      "docIdx": 2, 
      "text": "A\n new part just loaded into the document. Descriptions of scenes and stuff, wont talk about em though to now spoil the movie for you :P", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:41:15.668Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It changes the more we talk I think, still shape of water though", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:41:35.264Z"
    }, 
    {
      "docIdx": 2, 
      "text": "hehe well you can give it a read maybe there's some more info that would be interesting to me and not spoil it :)", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:42:13.136Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Well she works cleaning up at the secret government place with her best friend. The story kicks off when a new subject is brought in.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:43:36.564Z"
    }, 
    {
      "docIdx": 2, 
      "text": "You can imagine what it is :D", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:43:46.405Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I bet an alien and man or at least in looks lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:44:07.268Z"
    }, 
    {
      "docIdx": 3, 
      "text": "She starts taking time away from her work and her friend to spend time with it", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:44:16.724Z"
    }, 
    {
      "docIdx": 3, 
      "text": "But of course that's how it goes and the more time they spend together the more she likes him and one thing leads to another.......", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:45:26.632Z"
    }, 
    {
      "docIdx": 3, 
      "text": "...and romance :D Yeah.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:45:50.965Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The main character is totally mute though the movie, so there's a little bit of subtitles. Not too much though, the main character is quite funny in the movie working with her friend", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:47:10.610Z"
    }, 
    {
      "docIdx": 3, 
      "text": "lol the different species and the government office sounds like something to help give it a new spin though. Of course I'm a big fan of the X-Files so I say its a government conspiracy and aliens are among us now lol. Ya, not being able to talk makes the whole communication thing a bit trickier I imagine then again it made it easy for the actress to learn here lines.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:49:18.379Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Alotta sign language, her friend does some translating but they are a funny pair. Like if the mute girl swears off at someone in her sign language the other would just say \"She said have a nice day\".", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:51:34.036Z"
    }, 
    {
      "docIdx": 3, 
      "text": "There's a little comedy in the movie, makes it more lightharted :)", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:52:02.527Z"
    }, 
    {
      "docIdx": 3, 
      "text": "lol that sounds like a good match", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:52:02.630Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Finish convo is available now, looks like", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:52:28.403Z"
    }, 
    {
      "docIdx": 3, 
      "text": "cool beans I'm ready if you are :) Thanks for the chat and have a great week", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-27T16:52:59.665Z"
    }, 
    {
      "docIdx": 3, 
      "text": "you too", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-27T16:53:04.656Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-27T16:09:40.008Z", 
  "uid1LogOutTime": "2018-03-27T16:53:07.417Z", 
  "uid1response": {
    "feedback": "The other user was very good. He had the document for the movie and did a good job of explaining it without giving away the whole thing. I had been wanting to watch it but my husband wasn't into the idea now I have more info to present him that is more likely to get him to watch with me. Your instructions were not that clear though. It sounded like there were 3 movies not 1 and like a new chat would start with each one automatically after 3-5 exchanges between us.", 
    "response": [
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-27T16:09:40.048Z", 
  "uid2LogOutTime": "2018-03-27T16:53:05.782Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2355", 
  "user2_id": "USR3898", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 27
}