{
  "date": "2018-02-28T18:17:51.998Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hey! Seen any new movies lately?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:18:55.231Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The Social Network came out in 2010 and was directed by David Fincher. It was adapted from a book called The Accidental Billionaires. It stars Jesse Eisenberg and Andrew Garfield. It's about the founding of Facebook. Have you seen it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:19:21.040Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I haven't seen it, but I heard it was good.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:19:57.228Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Justin Timberlake was in it. So was the actor Armie Hammer. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:20:47.402Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That's kind of strange to see Justin Timberlake in movies, seeing that he's a singer. Was he any good?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:21:44.900Z"
    }, 
    {
      "docIdx": 0, 
      "text": "He plays a character named Sean Parker who was kind of a jerk in the movie. You should see the film, it got great reviews. Critical response was very good.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:22:54.185Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I think I am definitely interested in watching it. Do you know it's rating or age restriction?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:24:10.242Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Unfortunately I do not know the rating/age restriction.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:24:56.923Z"
    }, 
    {
      "docIdx": 0, 
      "text": "That's fine. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:26:17.485Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Would you say it's a serious or lighthearted movie? What genre would you classify it as?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:26:35.299Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's in the biographical/drama genre. Do you like dramatic movies in general?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:27:25.800Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Just occasionally, because it can be pretty boring sometimes in my opinion. But I heard that this movie is not boring at all. Do you agree?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:28:25.808Z"
    }, 
    {
      "docIdx": 1, 
      "text": "There are some interesting scenes in the movie. For example, Mark Zuckerberg is a student at Harvard and gets dumped by his girlfriend. He gets upset and\n then creates a website called Facemash by hacking into the \"facebooks\" of the various groups on campus and allows users of the site to rate which women are more attractive. This causes a lot of problems naturally and Zuckerberg gets academic probation, but the idea for Facebook springs out of that scene and sets the rest of the movie in motion.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:31:42.377Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah that definitely sounds like a very interesting movie.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:32:10.103Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I will definitely see it as soon as possible", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:32:18.601Z"
    }, 
    {
      "docIdx": 1, 
      "text": "There was a little bit of controversy around the movie. The screenplay was based off of a book and some people believe that the author wasn't exactly truthful about everything. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:33:13.553Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's crazy, but I believe it. I've heard about some craziness with the origin of facebook and stolen ideas, etc.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:34:54.859Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Do you think the movie was an accurate portrayel or do you think it was not truthful?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:35:15.340Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It's hard to say. Some critics said the author/screenplay writer took liberties with the biographical information but I don't know for sure, as I have not read the book. I would not be surprised if some details were changed for entertainment purposes.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:36:42.909Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I might decide to read the book first so I can make that judgement for myself.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:37:10.725Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Did you know that Facebook used to be called TheFacebook? Justin Timberlake's character Sean Parker (who was also the co-founder of Napster) told Zuckerberg to drop \"the\" and change it to just Facebook.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:38:03.151Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think I've heard that. Facebook definitely has a better ring to it than \"The Facebook\".", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:39:05.964Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you know any other interesting facts about this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:39:16.002Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The actor Armie Hammer actually plays two characters in the movie, which are twins. He played both roles. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:39:50.403Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh wow, that's crazy. I thought it was real twins\n playing that from what I saw in a trailer.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:40:26.135Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Facebook also used to be limited to just a few Ivy League colleges. Funny now that it's open to everyone.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:41:19.673Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, I don't use Facebook that much anymore, but it's a good thing it became open to\n everyone or it would have never been the success it is today and there would be no movie about it. haha", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:42:50.201Z"
    }, 
    {
      "docIdx": 3, 
      "text": "There was a big lawsuit surrounding the creation of Facebook. The movie gets into it a bit. The twins claim that Zuckerberg stole their idea and so there's an aspect of the film that touches on all of the legal drama. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:43:49.162Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Right. That makes sense. So, it kind of just explains the whole madness of facebook from the very beginning", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:45:19.997Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I have decided that I'm going to watch it this weekend.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:45:42.868Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Cool. I don't think you will regret it. The movie got a 96% score on Rotten Tomatoes. Do you pay attention to sites like that at all when you decide to watch a movie?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:46:18.979Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I actually don't. I tend to watch movies even with bad reviews or scores on rotten tomatoes, because I like to make up my own mind and sometimes people are too critical on movies.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:47:40.900Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you agree with the high score it got>", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:47:50.202Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think so. I enjoyed the movie quite a lot and have seen it maybe three or four times. I am big fan of the director in general.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:48:24.179Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thanks for the convo, have a great day.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:48:33.659Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-28T18:17:51.998Z", 
  "uid1LogOutTime": "2018-02-28T18:48:36.769Z", 
  "uid1response": {
    "feedback": "Fun experiment.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-28T18:17:52.379Z", 
  "uid2LogOutTime": "2018-02-28T18:48:54.104Z", 
  "uid2response": {
    "feedback": "This took way longer than 20 minutes, even though we had responded to each other more than 12 times.", 
    "response": [
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1216", 
  "user2_id": "USR4693", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 17
}