{
  "date": "2018-02-16T03:33:30.588Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:34:23.806Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello - I've been reading about The Imitation Game. You should see it!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:36:23.423Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, what is it about?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:36:42.939Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's a thriller about a real-life British cryptanalyst who decrypted German intelligence codes for the British Government during the Second World War.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:38:25.829Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Really!  I like history and thrillers.   Who is acting in it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:39:18.131Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It stars Benedict Cumberbatch. The Hollywood Reporter said he was great at portraying a \"genius at work\".", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:41:23.337Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sounds great.  When does it come out for viewing?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:42:16.996Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It came out in 2014, and it got a 91% from Rotten Tomatoes.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:43:22.223Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I guess that I am a little behind on my movies then.  I definetely check it out next time I'm in a video rental place.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:44:30.543Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Great! Do you mind if it's not exactly 100% historically accurate?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:47:12.231Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Not really.  They never are very accurate.  Is it very sensationalized?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:48:22.833Z"
    }, 
    {
      "docIdx": 1, 
      "text": "They just had to make a story people could follow. It starts with some police questioning Turing after a break in at his home. I've no idea if that really happened, but it made a good excuse for him to start talking about who he is...", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:51:05.568Z"
    }, 
    {
      "docIdx": 1, 
      "text": "As long as it makes for a good story.  Are there any books that describe the true story?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:52:40.177Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think Turing's life is widely documented, at least the interesting bits. It's well known that he had romantic feelings for other men, for example.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:55:18.617Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh.  That was not a great time, or place to be a gay man.  Does the movie go into how he dealt with that?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T03:56:28.688Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, it includes experiences from his boarding school life. In the film, he had a school friend he loved who unexpectedly died from tuberculosis. But the story then moves on to what happened in the war.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T03:58:39.975Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Are there any subtitles?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T04:01:03.813Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm not really sure. There is a lot about breaking German codes with a machine they build, but I don't remember if anyone speaks much German. Do you like films where they speak other languages?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T04:04:27.068Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Makes it more realistic in my opinion.  When appropriate anyways.  What is the movie rating?  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T04:06:24.758Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I don't think I know the age rating, if that's what you mean. Sorry about that. It got a Metacritic score of 73/100 and a CinemaScore of A+ though, if that helps!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T04:09:19.161Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I was reffering to the age rating.  I have a young daughter and I don't want to have to explain the birds and bees until she is at least 45.  Are there any explicit scenes that she couldn't see?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T04:11:50.307Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sorry, I don't recall if there is anything explicit, physically. There is quite a bit of talk about sexuality, as Turing marries a woman but keeps his homosexuality a secret, which is a major part of his character.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T04:15:47.525Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, she probably shouldn't watch.  But the cinamegraphics were good huh?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T04:17:55.297Z"
    }, 
    {
      "docIdx": 3, 
      "text": "There are a lot of nice things to see, yes, like Bletchley Park where they worked on the codes, and while there is machinery they have to film for the story, there are lots of interesting characters too.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T04:19:52.177Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Awesome.  Well, I'm interested for sure.  Actually, it makes me really want popcorn.  Is it one of those movies that you can eat popcorn while watching, or will the sound of the chewing make it impossible to watch?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T04:22:46.566Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Now that is a great question, and I can hardly ever watch a movie without popcorn! With all the characters crossing and double crossing, I guess it's important to follow the dialogue, but as long as you can hear over your crunching, you should be fine!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T04:26:01.078Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I really don't know how much more to ask.  Decent soundtrack?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T04:28:35.616Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Can't really say. I can't imagine a decent thriller without one, though, can you? It really is a good drama with a great cast.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-16T04:32:08.200Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well, thanks for the info.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-16T04:32:32.105Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-16T03:33:30.588Z", 
  "uid1LogOutTime": "2018-02-16T04:32:36.005Z", 
  "uid1response": {
    "feedback": "That is a conversation that took way longer than a normal coversation to make up my mind.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-16T03:33:30.603Z", 
  "uid2LogOutTime": "2018-02-16T04:33:03.542Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3139", 
  "user2_id": "USR3766", 
  "whoSawDoc": [
    "user2"
  ], 
  "wikiDocumentIdx": 1
}