{
  "date": "2018-02-08T23:00:58.010Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hi how many times have you seen Jaws, I cringe when I hear the music because my husband watches it whenever it come on", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:03:20.222Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have seen Jaws about tens times. I originally saw it as a child in the movie theater. I was the scariest movie ever!", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:04:24.918Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I never thought it was scary. I love the water and after we saw jaws when I was a little kid I had to look up the stats about shark attacks. I did like Richard Dreyfuss in this movie though.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:06:45.233Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Wow. I did not go into the ocean for a long time. Maybe because I lived in Rhode Island. I thought the Richard Dreyfus character was awesome. Very different from the book but he was great.My fav character though was Quint. He was the best. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:08:40.908Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I liked Quinn too, but what really bothered me about this movie was that theu were concerned with shark attacks but did nothing to keep the tourists out of the water.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:10:06.767Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The attach scenes were a little too gruesome. I remember my father had to take my little brother out of the movie but I stayed with my mother. I think that was the first movie I saw that made me scared in real life too. I don't even think I saw what the shark looked like until I watched the movie on TV. My eye were closed most of the time.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:13:54.412Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Aw that's cute. The scenes were scary as kids, but watching it now and comparing it to some of the horror movies today makes kids say that was scary? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:17:37.154Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I remember watching it with my young daughter and her friend at the time on TV one afternoon and they were making fun of me because I was telling them to hide their eyes. They laughed at me and said it was so fake. They grew up with Discovery Channel and Shark Week. lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:19:22.060Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I know, children are so jaded lately.  Iaughed at the description where they said it was too gruesome for children. I think it was R rated when it came out.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:22:25.596Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I am not sure what is was rated but my parents took me. Must have been the popularity at the time. I remember everyone screaming not just the kids. Lots of people walked out.  Too bad we are so used to violence and gore now.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:24:30.522Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah, that was not a movie my parents would have taken me to see because the content would have scared the snot out of my little brother", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:26:15.810Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I know. The first scene with the girl swimming at night and getting dragged under. Even at 12, I remember thinking that was dumb to go in the water alone at night. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:27:32.674Z"
    }, 
    {
      "docIdx": 1, 
      "text": " i think we are at the end of conversation?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:28:19.355Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Not sure. How to we know? I thought there were four docs to comment on. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:28:57.204Z"
    }, 
    {
      "docIdx": 1, 
      "text": "You do not see the docs do you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:29:36.960Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes \nThat's what they said but also  said 4 turns, they did nt change doc", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:30:20.503Z"
    }, 
    {
      "docIdx": 2, 
      "text": "My docs are changing. I thought it said twelve turn. Oh well. Guess it was not clear. They are not talking about the prank with the little boys and cardboard fin,", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:32:33.237Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I still am on jaws nothing changing, just went back to turk and it does say 12x. but I am about talked out about Jaws.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-08T23:34:58.860Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It is hard to notice. Look under key scenes. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:36:06.892Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you remember the scene with the fake fin?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:37:41.435Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you remember the scene with the dismembered leg? Gross! lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:39:04.313Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do give up we can do this! lol", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:39:32.630Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Are you giving up? lol. Just follow my lead.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:41:10.861Z"
    }, 
    {
      "docIdx": 2, 
      "text": "My partner abandoned the conversation. I have been doing this hit for 30 mins. Please pay me lol ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-08T23:42:45.206Z"
    }
  ], 
  "rating": 2, 
  "status": 0, 
  "uid1LogInTime": "2018-02-08T23:00:58.010Z", 
  "uid1LogOutTime": "2018-02-08T23:42:49.006Z", 
  "uid1response": {
    "feedback": "I was unable to keep my partner engaged. I tried if you see the conversation. I do not think she understood task. I did my best.", 
    "response": [
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-08T23:00:58.030Z", 
  "uid2LogOutTime": "2018-02-08T23:41:18.501Z", 
  "uid2response": {
    "response": [
      2
    ], 
    "type": "abandon"
  }, 
  "user1_id": "USR1898", 
  "user2_id": "USR4217", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 2
}