{
  "date": "2018-03-20T03:06:45.074Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Do you like romance movies like this?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:08:32.468Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did it bother you that the movie featured a love story with a non-human being?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:08:33.563Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It did not bother me and I thought it was a unique look at romance. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:08:48.114Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Sure. I have no problem with romance films, though normally not what I look for in a film. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:08:59.674Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Same for me. I was curious about it and was completely intrigued.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:09:14.085Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I also am not usually a fan of movies that revolve around romance but I really liked the 'sci-fi' aspect of it, and am a fan of Guillermo del Toro", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:09:38.859Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I really liked the supporting cast, too.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:10:03.308Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I don't have much experience with del Toro, but I'll be looking for his works in the future.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:10:38.899Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What was your favorite moment of the film? For me, it was the ending. Very thought-provoking. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:10:44.948Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Favorite moment? Perhaps the getting to know each other. I liked how her muteness added to the relationship, rather than inhibited it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:11:59.587Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Did you find her muteness added to the storyline?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:12:18.662Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The whole \"difference isn't bad\" was important. That seems key in a lot of sci-fi, of which I'm a fan.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:13:18.343Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes, it made her different from the rest of society just like he was also different from other people. They were both outcasts in a way, which made their connection stronger since they could understand each other like no one else had ever tried. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:13:26.927Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The supporting cast were also somewhat outcast. The bad guy didn't fit either", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:15:00.523Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What other del Toro films would you recommend?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:16:49.332Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think all of them are very good. Which one of the supporting cast was your favorite?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:17:41.445Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I really liked Giles, but Zelda was really good, too. I have decided I need to see more Octavia Spencer. Incidentally, seeing this movie started me seeing every movie and short nominated for Oscars. I thought Octavia should have taken best actress in a supporting role. I thought Shape of Water was best picture.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:19:53.155Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What did you think about the look of the film? I loved the look and feel.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:22:03.995Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The cinematography was great. The contrast between the dark and light in the scenes really made it more suspenseful and emotional. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:22:47.916Z"
    }, 
    {
      "docIdx": 1, 
      "text": "What did you think of Sally Hawkins? I had never seen her in anything before. After watching,\n I think she is an amazing actress. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:23:52.911Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The Cold War sensibilities were spot on, too. We feared the other, then, too. The Red Menace. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:23:56.431Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Agreed. I loved her in that. She had my vote for Best Active in a Leading Role. She was able to convey so much emotion without words", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:24:56.854Z"
    }, 
    {
      "docIdx": 2, 
      "text": "the guy that played the scientist was good. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:26:57.862Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, he gave a great performance. I had never seen that actor in anything else before either. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:27:29.159Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Despite a romance with \"a fish\" what was least believable? I thought the filling up and \nswimming in the bathroom was a bit silly.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:27:48.965Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He was also in Call Me by Your Name and, briefly, in The Post.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:29:14.819Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yes, that was definitely just for visual spectacle more than anything. I really liked Octavia Spencer's character but find it difficult to believe that she wasn't questioning her friend's relationship more than she did. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:29:57.951Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Maybe Octavia's character was sympathetic because her relationship was so frustrating.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:31:26.124Z"
    }, 
    {
      "docIdx": 2, 
      "text": "\"You never say anything and now you won't shut up!\" that was a great line.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:31:50.795Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Did you find yourself a little embarrassed for liking it? It was kind of hard to \"defend myself\" for liking it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:33:01.113Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I wasn't embarrassed for liking it, but most of my friends also liked it. If they had disliked it, then maybe I would feel that way too. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:34:03.399Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't know anyone else who saw it. I'm in the Army and I was laughed at when I expressed how I thought it was a surefire win for best picture. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:35:23.547Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I saw it in a packed little (old) theater with a bunch of old couples, it seems, and we all applauded after. I was stunned at the unanimous outpouring of affection for the film.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:36:30.997Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think explaining the concept of the film to people makes it seem more outlandish or crazy than it really is, but when they actually watch the film, it's very easy to become emotionally invested in the characters. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:37:18.398Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I liked the healing capability the creature had. Though, as a bald guy, I never thought baldness needed curing!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:37:47.419Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I agree. Far better to see it", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:38:08.729Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I felt like if people hadn't kept mistreating the creature, maybe the creature would have decided to use his powers for the good of society as a whole. But instead, the villain mistreated him to where he just wanted to do anything to avoid people at all. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:40:01.676Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The villain was horrible. He was so easy to hate. Mistreated the creature, his wife, the cleaning staff.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:41:19.893Z"
    }, 
    {
      "docIdx": 3, 
      "text": "He was terrible! I would like to hope that if humans did encounter another humanoid creature, we would have more compassion than that guy. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:42:50.661Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I was a Soldier in the Cold War, and I thought they conveyed that fear/hatred of the other pretty well. I thought we demonized the Russians so we could more easily hate them. He hated the creature and worked hard to justify his hatred.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:42:58.466Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I am afraid that fear of difference is common. Or so it seems.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:43:48.400Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I liked the rain in the movie, too. It seemed ever present and added so much texture to the film", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:45:11.279Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I guess a lot of humans already hate other humans quite a bit, so it wouldn't be that surprising of us to start hating the humanoids sadly. And I agree that the rain was a wonderful element of the film; it really kept the characters and audience connected to the water in some way at all times. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:45:56.701Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What did you think of the music? I thought it, too, was lovely.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:46:48.870Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It helped to build the emotion of the film and also kept us in the time period. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:48:32.263Z"
    }, 
    {
      "docIdx": 3, 
      "text": "While I'm enjoying our conversation, this HIT is taking a long time, isn't it?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:50:58.016Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes... I thought the new paragraphs would be appearing much quicker. :-P ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-20T03:51:22.770Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I just thought of this film in comparison to \"The Little Mermaid\". ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-20T03:52:34.039Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-20T03:06:45.074Z", 
  "uid1LogOutTime": "2018-03-20T03:52:23.919Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-20T03:06:45.350Z", 
  "uid2LogOutTime": "2018-03-20T03:54:54.682Z", 
  "uid2response": {
    "feedback": "I participated actively in the conversation. The other participant, after a lengthy conversation, departed.", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR3335", 
  "user2_id": "USR2978", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 27
}