{
  "date": "2018-03-30T15:41:17.008Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:41:50.142Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:42:00.732Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What did you think about the first Ironman movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:42:32.069Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I found it to be rather good, I enjoyed the whole secretly creating a suit down in my million dollar basement, what about you?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:43:11.046Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought it was great film, and a great start to what is a great franchise. Ironman being one of my favorite Marvel heroes.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:43:41.113Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I thought that the villain was a little lack luster, but since this was the first movie for Marvel I kind of gave them a small pass for it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:44:20.602Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Do you think that Robert Downey Jr. Fit this role when the movie first came out?\n ", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:45:18.251Z"
    }, 
    {
      "docIdx": 0, 
      "text": "He isn't my favorite, but a good one none the less. Being a genius inventor and industrialist you would believe the first suit he would make would be less of a prototype and more of a powerful machine that cannot be stopped. Yet I also disagree, the first Captain America movie had an enormous amount of criminal activity, so I kind of was put off by the whole fact that there wasn't more of a take out bad guys scene.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:45:30.227Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do also believe that Robery Downey Jr. fits the role 110% he plays it like no other, just the way he looks through it all, he IS Iron Man.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:46:03.871Z"
    }, 
    {
      "docIdx": 0, 
      "text": "How do you feel about the first Iron man suit?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:46:48.885Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Same, and the way he acts like a smart aleck made it even better.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:47:05.005Z"
    }, 
    {
      "docIdx": 0, 
      "text": "How do you feel about the first Iron Man Suit?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:48:20.455Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I liked the first Iron Man suit. it looked tradition to what he had in the cartoons, and comics.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:48:59.872Z"
    }, 
    {
      "docIdx": 1, 
      "text": "it was good to see overtime Tony Stark improve his suit after every movie since then, and switched it up a little.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:49:39.200Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Agreed, I love how the emblem on his chest would slowly changed to the one it is today, did you ever expect Tony Stark to be able to stop the Ten Rings, let alone stop a Jericho Missile?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:50:17.397Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yes I did expect him to stop a Jericho Missile cause of the weapons Tony Integrated on his suit.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:51:30.867Z"
    }, 
    {
      "docIdx": 1, 
      "text": "He never used his weapons though he had stopped it with his hands I thought?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:52:06.944Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh yea I forgot lol. I've seen so many sometimes I mix up what happens in certain movies. my bad.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:52:44.763Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Did you think Terrence Howard did a good enough job, or was Don Cheadal a better upgrade?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:53:18.205Z"
    }, 
    {
      "docIdx": 1, 
      "text": "as Rhodey", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:53:53.036Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Lol no problem it has been awhille since the movie came out, I just remember that was the biggest scene! and I preferred Terrence he gave the movie just that bit more of an edge you know what I'm saying?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:53:53.837Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Could you believe when he got shot by those jets? it was unreal I didn't expect him to survive", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:55:06.106Z"
    }, 
    {
      "docIdx": 2, 
      "text": "lol right?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:56:09.703Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Do you believe that Tony Stark did the right thing in the first movie by announcing he was Ironman, and not waiting until the sequel?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:56:48.155Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I felt he should have waited, the anticipation that would arise in the 2nd movie would have made it just crazy wonders. The fact as to where nobody knew who it was and then come beginning of the sequel something crazy happens forcing him to have to prove he's ironman instead of him just revealing it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T15:57:49.796Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I agree, but I believe he should've waited until Civil War.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T15:59:29.844Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I would've loved to see Ironman vs Captain America but dealing with if their Identities should be out in the open like that.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T16:00:01.469Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well I mean Captain America would destroy Iron Man any day but I do enjoy the fact as to where after revealing his identity he became more humble. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T16:00:35.760Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yet got a bit more deranged.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T16:00:40.285Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Did you think Tony Stark destroying all his weapons he manufactured a selfish move on his part since he made him a suit for himself?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T16:02:39.448Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes it was very selfish, he could of done a lot more good by possible getting the military in on it and making Stark Grade Military Unit Iron Suits for the Military", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T16:03:26.193Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I do also agree, but at the same time he didn't want the technology to fall into the wrong hands.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T16:04:40.637Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Like if someone in the military used the suit for their personal gain, or sold it on the black market.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T16:05:05.813Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Maybe he could of been there to govern it, govern the blue prints, possibly even get people on the inside to follow his works and follow the miltary making sure that that is prevented", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T16:05:53.525Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you feel that SHIELD should have admit to being Iron Man even when knowing Stark waS?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T16:06:26.562Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think it would'", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T16:07:00.904Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think it would've made SHIELD look bad and taking all the credit from Tony. Unless he were to agree with it.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T16:07:24.920Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's why he denied it at a press conference when they did admit it", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-30T16:08:17.299Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think it would be a little weird if SHIELD took all the credit. maybe if their story was little more fleshed out because casual movie goers would be confused.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-30T16:09:18.978Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-30T15:41:17.009Z", 
  "uid1LogOutTime": "2018-03-30T16:10:01.278Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-30T15:41:17.051Z", 
  "uid2LogOutTime": "2018-03-30T16:09:52.666Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2889", 
  "user2_id": "USR2705", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 21
}