{
  "date": "2018-03-06T19:06:57.827Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "I really liked Despicable Me. I enjoy animated movies and Steve Carell was excellent in his voice role.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:07:55.718Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hi, yes, I like Steve Carell's work.  He is an actor that exudes slime in a funny way!", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:09:14.663Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you seen many 3D animations?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:10:31.714Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Slime from the movie? I'm not sure I remember that part. There was a lot of funny bits though, so maybe I just lost the memory. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:10:36.075Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I like a lot of Pixars movies. Like Toy Story, Up, things like that.... they're nostalgic and entertaining ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:10:54.515Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I just meant in general about the slime comment.  Sounds like you know your 3D animation.  This is actually new to me, I'm amazed at the sophistication of the special effects of 3D.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:12:13.485Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, it's definitely come a long way in the past few years. I'm really excited to see how movies are going to look in the next couple of decades- the technology keeps getting better and better.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:13:03.536Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Looks like the reviews are pretty good for this movie, do you agree with them?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:13:27.304Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I agree a lot with the idea that both kids and adults will enjoy it. There's comedy at different levels so that it's not just an adult watching a kids movie, but a movie that's appropriate for both adults and kids", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:14:52.220Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think that's cool that both adults and kids get something out of this movie.  I wonder how many sequels this movie will produce over time?  I wonder if the sequels would be just as good.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:16:14.334Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think there are at least two sequels and a spinoff... I haven't seen any of them, but I know the franchise was quite popular for a wshile", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:17:33.305Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I bet they will produce toys based on the movie too, a Gru doll, etc.  Given the times we are in, it is especially fun to have an escape/adventure film like this.  Do you know what else we should address about this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:19:15.845Z"
    }, 
    {
      "docIdx": 1, 
      "text": "No, I'm not sure what else they want us to cover... I thought it was going to change documents after four comments but I'm not sure.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:20:47.351Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Let's see...this movie was made back in 2010.  I wonder how many movies since then were directly influenced by this movie's success.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:22:04.641Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Thats a good question.... ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:23:10.220Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I know it was very commercially and critically successful ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:24:33.487Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I'm new to the 3D movie thing.  I love movies, but I tend to watch the old classics.  I'm a big fan of movies from the 1930's, 40's, 50's.  I like film noir, musicals, etc.  What movies do you follow?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:24:50.271Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I have a wide variety of tastes, but I enjoy everything from the classics to terrible 'B' movies", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:25:35.954Z"
    }, 
    {
      "docIdx": 2, 
      "text": "okay I just got a new document", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:25:43.739Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Me too, tells more about Gru's adventures.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:26:12.698Z"
    }, 
    {
      "docIdx": 2, 
      "text": "So the scene with Gru at the theme park was really a central part to the film.... it helped to humanize the character and make him less terrifying to the audience. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:26:30.716Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I really like movies that develop characters and make them relatable at some level.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:27:16.196Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Exactly.... you never expect him to become attached based on how he's presented at the beginning of the movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:28:08.998Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Character changes definitely make the movie more interesting.  So do good actors.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:28:59.200Z"
    }, 
    {
      "docIdx": 3, 
      "text": "The moon expanding scene was very cool.... it goes back to what you were talking about earlier about how amazing the special effects can be in animated movies nowadays. I think that was the highlight of the entire film.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:30:28.091Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What was your favorite part?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:31:53.854Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Let's see, so Vector ends up flying out with the moon, is that correct?  Kids are so sophisticated these days because of computers and technology.  When I was a kid I was intrigued by Etch-a-sketch and slinkies!  We've come a long ways.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:31:56.310Z"
    }, 
    {
      "docIdx": 3, 
      "text": "My favorite part...that's hard to single out.  I definitely also relate to what is going on music-wise in a particular scene.  I think I need to see the movie again to identify my favorite part.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:33:04.832Z"
    }, 
    {
      "docIdx": 3, 
      "text": "We have come a long ways. And yes, it would be nice to rewatch it. There were so many good parts", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:35:08.573Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes, definitely.  I'd like to see it again also because now I have some input from you which makes me appreciate different things going on in the movie that I missed the first time around.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:36:19.815Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I also want to see the sequels now to see how they differ from this movie. It'd be intersting to see if there's any 'burnout'- that the stories get kind of stale after multiple movies", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:37:34.786Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I also wonder what new characters they would add to each sequel to keep the movies fresh.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-06T19:38:15.190Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Okay, I think we're able to finish the conversation now. It's been really nice chatting with you. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-06T19:38:33.444Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-06T19:06:57.827Z", 
  "uid1LogOutTime": "2018-03-06T19:38:37.172Z", 
  "uid1response": {
    "feedback": "There were a couple issues with understanding what they were talking about, but for the most part, it was pretty smooth. ", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-06T19:06:57.857Z", 
  "uid2LogOutTime": "2018-03-06T19:39:11.965Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1198", 
  "user2_id": "USR1304", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 16
}