{
  "date": "2018-02-28T17:46:37.281Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello, what do you think of The Blind Side?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T17:48:25.791Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have  actually seen The Blind Side a couple of times. I think its a pretty good story.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T17:49:48.742Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, it's been a while for me but it's a good movie. Very touching. Sandra Bullock is fantastic", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T17:50:32.052Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I actually didn't know Tim McGraw played the dad.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T17:50:44.260Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, shes really good in it. Very headstrong and forceful. Really gets into that role, kinda what you would expect from a sports mom type.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T17:51:45.097Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Definitely. It's just such a wholesome and feel-good story. A poor kid gets adopted and goes on to be a professional football player. I didn't realize it was a book first before a movie. Maybe I'll have to give that a read.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T17:53:40.865Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, Tim Mcgraw did play the dad in that film. I dont really follow him that closely but I know his face when I see him. Watching the movie, I knew he was famous but I couldn't put his name to his face.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T17:54:42.044Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I also had no knowledge of the book. I agree its a feel good story. One that I wish we would hear about more often. The character Michael Oher represents thousands of kids across this country every day.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T17:56:43.487Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did the same thing! I don't listen to much country music but I knew I recognized his face from somewhere. Also the son, SJ in the movie was hysterical. I would've thought the movie had a bit higher ratings than just a 6/10. I remember it blowing up when it first came out.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T17:57:00.907Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Oh definitely, Michael is the exception to the typical life a kid in his position would normally have. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T17:57:59.842Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Definitely, Michael's life and story are clear examples that even all the talent in the world cannot get you to achieve your max potential unless there are people around you who care and help you.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:00:51.408Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's all about who you know, not what you know necessarily. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:02:57.491Z"
    }, 
    {
      "docIdx": 1, 
      "text": "To some degree I suppose. A mans talent will definitely make room for him. Will get him access and audiences where he/she otherwise would not be able to but it takes good sense and understanding stay on top and to navigate many pitfalls. Mike Tyson is a great example of  what im saying.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:05:28.345Z"
    }, 
    {
      "docIdx": 1, 
      "text": "For sure, but the struggle is much harder than having someone to prop you up every step of the way. Not every one is that lucky to have people to influence your position on your behalf. Hard work pays off though and hopefully prevails in the end.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:09:26.436Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Absolutely, I dont remember much about Michael staying with a bunch of different foster families in Memphis!", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:10:49.783Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Such a sad situation. It was good of his friend's dad to try and get him in the school though. Glad they took a chance on him even though his academic record was poor. He was able to focus on football and let his talent shine.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:14:11.146Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah, his beginnings were really rough. Drug addictions violence. I had it good growing up compared to this scenario.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:16:45.774Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I imagine allowing Michael into their home had to be a little intimidating at first because of his sheer size.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:20:55.690Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It was awesome to see the mother address the younger daughter about her feelings on Michael staying with them. They both demonstrated compassion and faith over fear and distrust.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:22:33.348Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I do admit it would be intimidating, but to jump to conclusions about his intentions like Leigh Anne's friends did was terrible. Michael, or at least how he was portrayed in the film, was so sweet and gentle. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:22:33.988Z"
    }, 
    {
      "docIdx": 2, 
      "text": "True, he was portrayed as sweet and gently but when you dont really know someone like that, its scary bring them into your home. Sleeping around them and not really knowing.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:24:20.894Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It did not surprise me when Leigh Annes friends responded the way they did. That's just part of the dynamic , especially in the south.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:27:10.056Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Oh definitely. Getting the children actively involved in taking in someone so different from them is good for everyone. Not only to quell any fear or prejudice, but then to embrace Michael and a new perspective on life and learn from his experiences is awesome.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:27:20.239Z"
    }, 
    {
      "docIdx": 2, 
      "text": "But the movie does of good job of showing us that love is greater than the some of our fears and physical differences. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:27:55.531Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Great point about the kids. Having Michael their broke all sorts of stereotypes in their minds im sure.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:28:51.019Z"
    }, 
    {
      "docIdx": 2, 
      "text": "The greatest successes of this movie was Micheal overcoming his own fears and sense of self worth. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:30:08.324Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He used his physical strengths to be become both mentally and emotionally stronger. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:30:43.936Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, it's great exposure for all of them I'm sure. Even for Leigh Anne's snooty friends. It's such a shame that sort of prejudice is found in pretty much everyone. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:31:09.199Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Its so ingrained that its hard to root it out of our minds. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:32:40.336Z"
    }, 
    {
      "docIdx": 3, 
      "text": "His transformation was incredible. The support of his new family and knowing that he didn't need to be afraid anymore allowed him to use his size to his advantage and become a football star. I'm sure he was probably self-conscious about that before. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:34:12.790Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It really shows how people can change for the better if given a chance.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:34:38.208Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Absolutely. The movie does a great job of depicting his self conscience issues.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:35:13.026Z"
    }, 
    {
      "docIdx": 3, 
      "text": "yes it does.", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T18:39:10.143Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It would be hard not to be self-conscious in his situation. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T18:39:27.786Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-28T17:46:37.281Z", 
  "uid1LogOutTime": "2018-02-28T18:39:53.096Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-28T17:46:37.335Z", 
  "uid2LogOutTime": "2018-02-28T18:39:39.377Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR2967", 
  "user2_id": "USR2845", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 18
}