{
  "date": "2018-02-05T15:24:55.205Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "What is the name of the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:26:19.834Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is the Imitation Game. Have you seen it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:26:35.616Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I have not. Who is staring in the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:26:48.865Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The four main stars are Benedict Cumberbatch, Keira Knightley, Matthew Goode, and Tom Goodman-Hill", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:27:18.107Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like Keira Knightley and Tom Goodman-Hill. Is it an action movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:27:48.755Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It is a historical drama and it is based on a real life cryptanalyst Alan Turing. It gets excellent ratings.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:28:52.077Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I am not sure what a cryptanalyst does. Will people who don't know be able to follow the story? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:29:25.793Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The critical reviews say that it is written well and that Benedict Cumberbatch does a great job of portraying Turing so it sounds like anyone would still be able to follow the story.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:30:55.448Z"
    }, 
    {
      "docIdx": 0, 
      "text": "You are probably right. Benedict Cumberbatch is a popular actor. What time period does the movie take place? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:31:37.116Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It takes place during World War II because Turing decrypted German intelligence codes for the British government during that war.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:32:42.996Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I did not know that. I wonder since it is a WWII movie it is violent or if they will only show the decryption related scenes? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:33:49.042Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm not sure but it also shows some of Turing's childhood too. It shows how he got his love of cryptogrphy and then progresses to his time helping the British. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:35:04.136Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I like that it has some of his backstory in it. It would be helpful to understand why he decided to take that path. Is it a family movie or rated more for adults? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:36:11.642Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I really don't know for certain. However, parts of the movie show that Turing lost the person he loves to tuberculosis and then when he works with the British they are trying to decrypt coded messages from the Nazis, so it sounds like it is more for adults.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:39:38.410Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I agree. It sounds like there is some romance element to it also. Does Keira play the love interest? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:40:26.839Z"
    }, 
    {
      "docIdx": 2, 
      "text": "No, I don't know the actor who plays the love interest. But the love interest is actually the man who sparked Turing's interest in cryptography, however he dies from tuberculosis before Turing can actually tell him. All of this takes place before Turing starts working with the British.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:42:02.989Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That sounds like it will be sad to watch. Is there music in the movie? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:43:17.815Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It isn't in the musical genre so I don't know if there is much music, but interestingly, even though Keira Knightley does not play Turing's initial love interest, she and Turing end up getting married because Turing keeps his homosexuality a secret. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:44:50.937Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That would add an interesting twist to the story. Does it say how they met? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:46:05.420Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It sounds like they are both cryptographers. After Turing initially has trouble decoding messages, he gets fired, but other cryptographers threaten to leave if he does. Her character, Joan Clarke, is one who was going to leave before Turing proposed.\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:47:50.366Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It sounds like there is some suspense in the film too. Does it give any background into how Joan decideds to get into this line of work? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:48:48.268Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm not sure why she got into the line of work, but it certainly sounds like his road to decryption wasn't easy. He finally succeeded though by programming the machine to decode the words he already knows exists in some messages.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:50:30.475Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Does it explain how he learned those words? Or how he keeps track of them? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:51:14.734Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It doesn't, but the movie has even more interesting twists. The only person to whom Turing confessed his homosexuality (Cairncross) turned out to be a Soviet spy, and threatens to disclose Turing's sexuality if Turing reveals Cairncross is a Soviet agent.", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:53:06.760Z"
    }, 
    {
      "docIdx": 3, 
      "text": "How does he discover he is a secret agent? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:54:08.753Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I don't know how he discovers it, but he finally reveals the fact to an MI6 agent. The story gets even crazier here because the MI6 agent knew Cairncross was a secret agent and planted him in the group to leak messages to the Soviets that would\n actually benefit the British. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:55:37.757Z"
    }, 
    {
      "docIdx": 3, 
      "text": "How long is the M16 agent involved? Do you think they picked him from the beginning to plant him? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-05T15:56:54.553Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It is really hard to say for sure. But at the end after the war is over, the MI6 agent makes the cryptographers destroy all of their work and they are no longer to see one another or tell anyone about the work they did. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-05T15:58:05.161Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-05T15:24:55.205Z", 
  "uid1LogOutTime": "2018-02-05T15:58:38.423Z", 
  "uid1response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-05T15:24:55.235Z", 
  "uid2LogOutTime": "2018-02-05T15:58:46.863Z", 
  "uid2response": {
    "feedback": "There wasn't much of a lag between discussion points. I didn't see the document. ", 
    "response": [
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR307", 
  "user2_id": "USR3070", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 1
}