{
  "date": "2018-03-01T19:05:25.741Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:05:39.146Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hello there.  So, Batman vs. Superman eh?  Critics didn't much care for it.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:06:12.015Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yeah, I didn't bother watching it. Did you?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:06:35.084Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I did.  I don't agree with the critics.  I think it was a goofy fun superhero movie.  Are you a fan of the genre?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:07:15.252Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes, I loved Black Panther. What made you want to see Batman V Superman?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:07:50.522Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'll pretty much see any big budget thing in theaters, not much to do in this small town.  But, I must say, mediocre performances from everyone, but Jesse Eisenberg did play a descent into madness pretty admirably.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:08:30.712Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I like Ben Affleck as a director but I think he's a horrible Batman. Do you think they're going to make a sequel?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:09:17.125Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I do think they're setting everything up - the justice league type thing, though I heard that didn't do great either.  I can't imagine Affleck is going to play Batman half as long as Christian Bale did though.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:10:05.478Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I didn't catch Suicide Squad either. I think the last DC movie I saw was the last Nolan Batman. Why do you think DC has trouble compared to Marvel Studios?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:10:52.677Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think DC just is more concerned with getting big named actors (Affleck, Amy Adams, Jesse Eisenberg) than they are actually developing story.  Batman v. Superman felt kind of rushed, and even with the star power in the movie, it just didn't do enough for it critically.  Hiring already established actors for these roles is rough unless they are exceptional actors.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:12:05.471Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Tjat\n'", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:12:22.857Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's a great point. Marvel doesn't mind taking risks with quality but lower tier actors. Who do you think would have been a better Batman?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:12:48.804Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's a hard role to cast really.  An undeveloped person with a deep voice, and big muscles haha.  Someone new to the scene would have been great.  But, the one thing I'll say was interesting in the movie to me was Superman being the borderline villain, it's how I imagine the real world would react to him.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:13:33.686Z"
    }, 
    {
      "docIdx": 1, 
      "text": "That's interesting. I heard geeks were angry that Superman would murder because he never did in the comics. Do you think Superman was a better character than Batman in this film?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:14:25.460Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think even though Affleck's delivery was weak, Superman was the more boring of the two.  I mean, in reality he just didn't do much.  The only real star of the movie was Lex Luthor, but I suppose there isn't anything wrong with the villain surpassing the heroes in these movies, it's what got the Bond movies so good.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:15:20.214Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Yeah Superman is usually a bland character because he has too many strengths. How did Eisenberg do as Luthor?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:16:07.013Z"
    }, 
    {
      "docIdx": 2, 
      "text": "He portrayed him as a kind of out of control Mark Zuckerberg.  Eccentric but likeable at the beginning, but then betrayer/madness as the movie progressed.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:16:41.892Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I was suprised by the casting because he doesn't really look like a Lex Luthor. Do you think Zack Snyder is losing his touch as a director?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:17:30.858Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I think you might say that, but I mean..I think even a master would have difficulty working with the script.  The one part that stands out really bad is Batman is about to kill Superman but Superman asks him to \"save Martha\", who is Superman's adopted mother that shares a name with Batman's.  This makes him halt...but I just feel like it was cheesy, doesn't it sound it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:18:33.938Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's so weak! How would you have changed that scene?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:19:23.778Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It's a tough thing, because just the way the movie was set up I don't know how they could swap it around.  I think that's my gripe, Superman wanting to kill Batman was all because Luthor wanted him to, and kidnapped his mom - this seems a little extreme, and could have been brought to a head better.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:20:56.319Z"
    }, 
    {
      "docIdx": 2, 
      "text": "How did they set up the movie? Why did Batman and Superman cross paths in the first place?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:21:42.660Z"
    }, 
    {
      "docIdx": 3, 
      "text": "They just kind of had them in the same area.  Batman was basically edgy and started mutilating people.  Superman felt he was being extreme and wanted him to stop.  But it doesn't make any sense to me, because Batman has always been written as the character that like does it because he has to...if there was an all powerful god who could end all the crime, I doubt Batman would be patrolling, right?", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:22:43.938Z"
    }, 
    {
      "docIdx": 3, 
      "text": "BRB in a sec", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:23:14.895Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That's ok, for when you get back - the cheesiest part of the movie is Superman \"dies\" but it's heavily hinted at the end that he isn't actually dead.  The fight scene was really good, but having a character who clearly isn't going to die \"die\" kind of ruined it for me.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:23:54.150Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Sorry about that. Yeah I think false death cop outs are horrible.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:28:28.879Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do you think it deserves it's rotten tomatoes rating?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:28:44.802Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yes and no.  As I said, if you go in there not expecting much, you're going to walk away pleasantly surprised.  If you go in there expecting The Dark Knight's brilliance, well...you're going to get a remorseful Batman at the end despite no remorse shown throughout the entire movie, lol.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:29:35.925Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I see, is it worth a netflix watch?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-01T19:29:59.203Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I think so, if as you said you are a fan of the genre.  I always like to see what new people bring to the roles.  All my gripes about it are just that, gripes.  But, they do have some good moments, like as I said, Eisenberg's performance.  Wonder Woman the little bit she's in it is pretty good too.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-01T19:30:56.608Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-01T19:05:25.741Z", 
  "uid1LogOutTime": "2018-03-01T19:31:01.462Z", 
  "uid1response": {
    "feedback": "User had to go AFK a bit, and didn't seem to want to stay focused on the documents.\n\nBut, it was still a somewhat engaging conversation when they finally got on topic and returned.\n\nI think there are better documents about the movie we can use for this movie, having seen it.", 
    "response": [
      1, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-01T19:05:25.793Z", 
  "uid2LogOutTime": "2018-03-01T19:31:15.658Z", 
  "uid2response": {
    "feedback": null, 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR4579", 
  "user2_id": "USR2027", 
  "whoSawDoc": [
    "user1", 
    "user2"
  ], 
  "wikiDocumentIdx": 13
}