{
  "date": "2018-03-05T22:12:53.691Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "What is the name of the movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:13:35.763Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The movie is Despicable Me released in 2010.  ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:14:24.798Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What is the movie about?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:14:37.044Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It's an animated comedy targeted at children, but based upon the 81% Rotten Tomatoes score adults have enjoyed it too.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:15:57.786Z"
    }, 
    {
      "docIdx": 0, 
      "text": "What genre would you say it fits into?  Comedy?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:16:28.138Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Who are the lead voice actors or actresses?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:17:41.155Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It features a supervillain Gru, although he refers to himself as Despicable Me, Gru's archenemy, Victor \"Vector\" Perkins and an elderly man in the employ of Gru, the friendly scientist. The movie is definitely a comedy.\n ", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:17:49.736Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Steve Carell is the voice actor for Gru, Jason Segel voices Victor Perkins, and Russell Brand voices Dr. Nefario (the aforementioned friendly scientist).", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:18:53.834Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Have you watched this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:19:18.447Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Yes and I found it quiet amusing.  It seems as though Pixar succeeded when they released this movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:20:24.967Z"
    }, 
    {
      "docIdx": 1, 
      "text": "How long is the runtime of this movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:20:48.336Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I'm unsure of how long the movie is.  The first scene of the movie sets the stage for all that follows.  Gru learns that a villian, Vector but Gru learns this later, stole the Great Pyramid of Giza.  This leads to have the desire to on up Vector by stealing the Moon!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:23:40.620Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Would you be willing to watch this movie again?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:24:21.900Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Is this a \"G\" rated movie?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:27:22.499Z"
    }, 
    {
      "docIdx": 1, 
      "text": "But alas, Gru doesn't have the money required so he is required to seek assistance from the Bank of Evil by means of a loan. The Bank President agrees to provide Gru with the required money if he obtains the shrink ray used to steal the Pyramid.  She reveals that Vector was the villian behind the Pyramid theft, which sparks Gru's rivalry with Vector.  \n\nI would be willing to watch the movie again and although the document does not state it has a G rating, it is targeted at young children, so I would presume it does.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:28:03.104Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I would advise you check online to confirm the G rating though.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:29:37.085Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Would you consider the ending to be a happy ending?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:31:00.362Z"
    }, 
    {
      "docIdx": 2, 
      "text": "As Gru came to car for three young girls he adopted - Margo, Edith, and Agnes - I would say it ends happy for Gru.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:33:32.854Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That is all I really need to know.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:35:34.307Z"
    }, 
    {
      "docIdx": 2, 
      "text": "In fact, Gru came to realize he was beginning to care for the girls when he became conflicted, since their dance recital interfered with his plans to steal the moon.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:35:53.855Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Although that was Gru's first truly human moment, it was nearly spoiled by the dastardly Dr. Nefario, when he attempted to have the girls returned to the orphanage (and to think he was supposed to be a good guy - for a movie about supervillians).", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:37:00.177Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Is this chat ever going to end?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:37:45.583Z"
    }, 
    {
      "docIdx": 2, 
      "text": "One more document to go... and it should loud after this response.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:38:14.956Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wonderful", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:38:47.805Z"
    }, 
    {
      "docIdx": 3, 
      "text": "One of my favorite scenes of the movies occurs immediately after Gru surrenders the Moon to Vector - Vector was holding the girls hostage.  Dr. Nefario discovers that the effects of the shrink ray are temporary and the length of time the object remains in it's shrunken state is inversely correlated to the size of the object.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:41:28.048Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thus, while the moon was aboard Vector's ship the moon begins to expand until it explodes out of his ship reclaiming its position among the stars", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:42:14.710Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Well it seems you have told me the whole story.  I don't even need to watch the movie now.", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:42:35.837Z"
    }, 
    {
      "docIdx": 3, 
      "text": "But I haven't even told you where most of the comedy arises, the Gru's Minions!", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:43:25.270Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Albeit you are correct, that is essentially the entire movie.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:43:45.018Z"
    }, 
    {
      "docIdx": 3, 
      "text": "What remains: You reply, me, you and we're done.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:46:23.537Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Thank you for sharing.  That was more than enough information.  Are we done yet?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:46:58.261Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Nearly, I do feel like adding that Gru did wind up showing up to the girls recital, which is when he realized they were kidnapped by Vector.", 
      "uid": "user1", 
      "utcTimestamp": "2018-03-05T22:48:17.569Z"
    }, 
    {
      "docIdx": 3, 
      "text": "How do we finish the conversation?", 
      "uid": "user2", 
      "utcTimestamp": "2018-03-05T22:48:39.205Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-03-05T22:12:53.692Z", 
  "uid1LogOutTime": "2018-03-05T22:48:47.780Z", 
  "uid1response": {
    "feedback": "The document says virtually nothing about the Minions themselves.  That's a bit disconcerting considering, they're the main selling point for Children (and Adults too)", 
    "response": [
      1, 
      4
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-03-05T22:12:53.743Z", 
  "uid2LogOutTime": "2018-03-05T22:48:53.251Z", 
  "uid2response": {
    "feedback": "That took way longer and included entirely too much information.  It left me feeling like I had already watched the movie, when all I wanted was some brief details, not the entire storyline.", 
    "response": [
      1, 
      2, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR1464", 
  "user2_id": "USR3701", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 16
}