{
  "date": "2018-02-28T22:32:11.562Z", 
  "history": [
    {
      "docIdx": 0, 
      "text": "Hello! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:33:24.658Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Hi, how are you today? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:33:33.004Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Good, you? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:33:39.375Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I'm doing pretty good. Up to anything fun? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:33:54.734Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Not much, just working on mTurk. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:34:08.772Z"
    }, 
    {
      "docIdx": 0, 
      "text": "The movie given to us today is How To Train Your Dragon. Have you seen it?", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:34:22.685Z"
    }, 
    {
      "docIdx": 0, 
      "text": "Same here. Been a pretty quiet day on mTurk. I have not seen it, but I've heard a lot of good things about it. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:34:37.418Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It looks like it has great reviews. It has a 98% on Rotten Tomatoes. Do you ever read that site? ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:34:59.265Z"
    }, 
    {
      "docIdx": 0, 
      "text": "You know, I probably should, but since I'm a huge sci-fi fan, I tend to stay away. Their rating system isn't kind to my favorite genre. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:35:30.583Z"
    }, 
    {
      "docIdx": 0, 
      "text": "I never used to pay too much attention, but I have to admit, I've found they are accurate a lot of the time, for me anyway. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:36:05.112Z"
    }, 
    {
      "docIdx": 0, 
      "text": "It says this film has witty dialogue and a thrilling action-adventure story, so it sounds like it would be a fun movie to put on sometime. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:36:32.401Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It does sound interesting. Do you think it's more geared towards an older audience or maybe my 5 year old might enjoy it? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:37:06.787Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think a 5 year old would probably enjoy it. It's just that some of the dialogue might be lost on them. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:37:35.553Z"
    }, 
    {
      "docIdx": 1, 
      "text": "There's one particular scene where a character manages to capture a rare dragon but can't bring themselves to kill it. I think that's probably a good message for children. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:38:21.217Z"
    }, 
    {
      "docIdx": 1, 
      "text": "I think at that age most dialogue is lost. So do you have any more details on it? Like who the central character is or the basic plot line? Who's training Dragons? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:38:23.208Z"
    }, 
    {
      "docIdx": 1, 
      "text": "Oh, yeah, that's a pretty good message to get across. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:38:37.511Z"
    }, 
    {
      "docIdx": 1, 
      "text": "The chief of the Viking tribe is too small to fight any dragons, so he comes up with mechanical devices to use, although they backfire sometimes. The main character is Hiccup, who is voiced by Jay Baruchel. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:39:50.474Z"
    }, 
    {
      "docIdx": 1, 
      "text": "It's actually referred to as a coming of age dramedy, which is interesting for the film type. You might not expect that from an animated film. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:40:30.399Z"
    }, 
    {
      "docIdx": 2, 
      "text": "So why are they fighting the dragons? Are the dragons bad? That is surprising that it's an animated film billed as a coming-of-age story. Most animated films tend to focus on much younger characters. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:42:10.975Z"
    }, 
    {
      "docIdx": 2, 
      "text": "A lot of the story appears to be about this one character, Hiccup, and how he ends up taming one or more dragons. His dragon companion Toothless is named that way due to its retractable teeth. He studies their behavior and becomes successful in subduing dragons while training them. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:44:24.270Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That explains why my daughter's best friend keeps trying to name one of my chickens \"Toothless.\" That's actually a great plot line message for kids. Sounds like it's promoting how to not harm others while making a connection with them. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:45:50.216Z"
    }, 
    {
      "docIdx": 2, 
      "text": "Yeah I agree. And I think being gentle and kind with animals is always a good lesson. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:46:31.766Z"
    }, 
    {
      "docIdx": 2, 
      "text": "I've never seen this movie, but I wonder if in the end they switch from dragon-fighting to dragon-taming or something like that. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:47:07.046Z"
    }, 
    {
      "docIdx": 2, 
      "text": "That's a hugely popular topic in our house since we have a lot of livestock. I think I'll definitely be letting my kids watch it. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:47:18.374Z"
    }, 
    {
      "docIdx": 2, 
      "text": "It would be cool if they did switch from fighting to taming. Do you think you'll watch it? ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:47:32.846Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I might be quicker to watch it if it's available on a streaming site. It's just easier to bring up Netflix and play something that's on there. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:48:15.484Z"
    }, 
    {
      "docIdx": 3, 
      "text": "I'm pretty sure I've seen it on Netflix, unless they took it off already. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:48:34.723Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Nevermind, it's not on Netflix and you have to rent it on Amazon. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:49:32.101Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It's only 3.99 on Amazon to rent, but if it's not really your thing, I wouldn't pay for it. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:50:12.827Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Hiccup subdues a dragon instead of killing it in his final training test, which ends up leading to his dragon Toothless being taken by his father, who disowns him. Hiccup and his friends have to set off to save the dragon and stop his father and the others, and his father ends up saving both him and Toothless. The dragons and the people end up living peacefully after that. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:50:40.403Z"
    }, 
    {
      "docIdx": 3, 
      "text": "That sounds like a good ending. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:51:08.461Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Yeah, I bet it's probably cheaper at the video store anyway. I know Family Video has kids rentals for free. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:51:10.850Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Do video stores still exist? I live 2 hours from the closest city....so I don't exactly know if those are still around. ", 
      "uid": "user2", 
      "utcTimestamp": "2018-02-28T22:51:38.012Z"
    }, 
    {
      "docIdx": 3, 
      "text": "Wow! I'm jealous of you in some ways but not others. haha Yeah, I live in a small city of something like 30k people and we have 3 video stores. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:52:13.049Z"
    }, 
    {
      "docIdx": 3, 
      "text": "There's also the Redbox boxes that you can go rent from. ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:52:21.205Z"
    }, 
    {
      "docIdx": 3, 
      "text": "It was nice talking to you today! ", 
      "uid": "user1", 
      "utcTimestamp": "2018-02-28T22:52:50.443Z"
    }
  ], 
  "rating": 3, 
  "status": 1, 
  "uid1LogInTime": "2018-02-28T22:32:11.562Z", 
  "uid1LogOutTime": "2018-02-28T22:52:52.461Z", 
  "uid1response": {
    "feedback": "I enjoyed talking to this person. ", 
    "response": [
      1, 
      2, 
      3, 
      5
    ], 
    "type": "finish"
  }, 
  "uid2LogInTime": "2018-02-28T22:32:11.965Z", 
  "uid2LogOutTime": "2018-02-28T22:53:00.960Z", 
  "uid2response": {
    "feedback": "I have a 3 and 5 year olds that both love fantasy and animal plot lines, so I definitely think I'll be showing them this movie. The other user did a great job of explaining the plot and was very friendly. ", 
    "response": [
      1, 
      2, 
      3, 
      4
    ], 
    "type": "finish"
  }, 
  "user1_id": "USR981", 
  "user2_id": "USR1763", 
  "whoSawDoc": [
    "user1"
  ], 
  "wikiDocumentIdx": 10
}